#pragma once

// Borderlands 3 SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "BL3_Basic.hpp"
#include "BL3_GbxInventory_classes.hpp"
#include "BL3_GbxUI_classes.hpp"
#include "BL3_EngineSettings_classes.hpp"
#include "BL3_GbxGameSystemCore_classes.hpp"
#include "BL3_Engine_classes.hpp"
#include "BL3_GbxWeapon_classes.hpp"
#include "BL3_GbxRuntime_classes.hpp"
#include "BL3_GbxDialog_classes.hpp"
#include "BL3_CoreUObject_classes.hpp"
#include "BL3_GbxAI_classes.hpp"
#include "BL3_GbxNav_classes.hpp"
#include "BL3_AIModule_classes.hpp"
#include "BL3_GbxCameraModes_classes.hpp"
#include "BL3_GbxDynamicRoom_classes.hpp"
#include "BL3_UMG_classes.hpp"
#include "BL3_GbxMission_classes.hpp"
#include "BL3_OnlineSubsystemUtils_classes.hpp"
#include "BL3_GameplayTags_classes.hpp"
#include "BL3_WwiseAudio_classes.hpp"
#include "BL3_PhysXVehicles_classes.hpp"
#include "BL3_GbxAnimRuntime_classes.hpp"
#include "BL3_GameplayTasks_classes.hpp"
#include "BL3_ScaleformUI_classes.hpp"
#include "BL3_SlateCore_classes.hpp"
#include "BL3_InputCore_classes.hpp"
#include "BL3_GbxAbilities_classes.hpp"
#include "BL3_GbxSpawn_classes.hpp"
#include "BL3_GbxInput_classes.hpp"
#include "BL3_GbxAudio_classes.hpp"
#include "BL3_GbxStreamingInteraction_classes.hpp"
#include "BL3_GbxTravelStation_classes.hpp"
#include "BL3_OnlineSubsystem_classes.hpp"
#include "BL3_ReplicationGraph_classes.hpp"
#include "BL3_GbxTimeOfDay_classes.hpp"
#include "BL3_GbxVehicle_classes.hpp"
#include "BL3_AnimGraphRuntime_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum OakGame.EExitDownStateReason
enum class EExitDownStateReason : uint8_t
{
	ExitDownStateReason_None       = 0,
	ExitDownStateReason_Revived    = 1,
	ExitDownStateReason_SecondWind = 2,
	ExitDownStateReason_TimerExpired = 3,
	ExitDownStateReason_Interrupted = 4,
	ExitDownStateReason_Instant    = 5,
	ExitDownStateReason_Custom     = 6,
	ExitDownStateReason_MAX        = 7
};


// Enum OakGame.EDownState
enum class EDownState : uint8_t
{
	DownState_Healthy              = 0,
	DownState_Down                 = 1,
	DownState_DownAndExerting      = 2,
	DownState_Resurrecting         = 3,
	DownState_GivingUp             = 4,
	DownState_MAX                  = 5
};


// Enum OakGame.EReviveState
enum class EReviveState : uint8_t
{
	ReviveState_None               = 0,
	ReviveState_BeingRevived       = 1,
	ReviveState_Reviving           = 2,
	ReviveState_MAX                = 3
};


// Enum OakGame.EOakElementalType
enum class EOakElementalType : uint8_t
{
	None                           = 0,
	Corrosive                      = 1,
	Cryo                           = 2,
	Fire                           = 3,
	Shock                          = 4,
	Radiation                      = 5,
	MAX                            = 6
};


// Enum OakGame.EKilledEnemyFriendEventType
enum class EKilledEnemyFriendEventType : uint8_t
{
	None                           = 0,
	Enemy                          = 1,
	NamedEnemy                     = 2,
	Boss                           = 3,
	EKilledEnemyFriendEventType_MAX = 4
};


// Enum OakGame.EMatchmakingState
enum class EMatchmakingState : uint8_t
{
	Idle                           = 0,
	PreparingToSearch              = 1,
	Searching                      = 2,
	ConfirmingPlayers              = 3,
	StartingGameplay               = 4,
	Canceling                      = 5,
	EMatchmakingState_MAX          = 6
};


// Enum OakGame.EBossbarEventType
enum class EBossbarEventType : uint8_t
{
	Intro_Event                    = 0,
	Enable_Invulnerable_Event      = 1,
	Disable_Invulnerable_Event     = 2,
	Shake_Event                    = 3,
	Destroy_Event                  = 4,
	NONE                           = 5,
	EBossbarEventType_MAX          = 6
};


// Enum OakGame.EOakLeague
enum class EOakLeague : uint8_t
{
	OL_None                        = 0,
	OL_BloodyHarvest               = 1,
	OL_ValentinesDay               = 2,
	OL_TheCartels                  = 3,
	OL_SummerOfGreed               = 4,
	OL_MAX                         = 5
};


// Enum OakGame.EEffectivePlayerCountSetting
enum class EEffectivePlayerCountSetting : uint8_t
{
	GameForced                     = 0,
	UserRequested                  = 1,
	Actual                         = 2,
	EEffectivePlayerCountSetting_MAX = 3
};


// Enum OakGame.EOakGameStateUIGroupMode
enum class EOakGameStateUIGroupMode : uint8_t
{
	Unknown                        = 0,
	Cooperation                    = 1,
	Coopetition                    = 2,
	EOakGameStateUIGroupMode_MAX   = 3
};


// Enum OakGame.EMultiplayerLootMode
enum class EMultiplayerLootMode : uint8_t
{
	Standard                       = 0,
	Instanced                      = 1,
	EMultiplayerLootMode_MAX       = 2
};


// Enum OakGame.ENewGameState
enum class ENewGameState : uint8_t
{
	None                           = 0,
	IntroMovie                     = 1,
	CharacterSelect                = 2,
	WaitingForPlayerPawns          = 3,
	ENewGameState_MAX              = 4
};


// Enum OakGame.EPlayerExperienceType
enum class EPlayerExperienceType : uint8_t
{
	Generic                        = 0,
	Combat                         = 1,
	Mission                        = 2,
	EPlayerExperienceType_MAX      = 3
};


// Enum OakGame.EPlayerExperienceSource
enum class EPlayerExperienceSource : uint8_t
{
	XPUnknown                      = 0,
	XPCombat                       = 1,
	PlotMissionAward               = 2,
	Discovery                      = 3,
	SideMissionAward               = 4,
	SaveGame                       = 5,
	EPlayerExperienceSource_MAX    = 6
};


// Enum OakGame.ECommandRingLocationType
enum class ECommandRingLocationType : uint8_t
{
	Default                        = 0,
	Ground                         = 1,
	Feet                           = 2,
	ECommandRingLocationType_MAX   = 3
};


// Enum OakGame.ECommandRingAlignmentType
enum class ECommandRingAlignmentType : uint8_t
{
	Default                        = 0,
	SurfaceWorld                   = 1,
	SurfaceView                    = 2,
	View                           = 3,
	View2D                         = 4,
	Actor                          = 5,
	ECommandRingAlignmentType_MAX  = 6
};


// Enum OakGame.ECommandRingReferenceActorType
enum class ECommandRingReferenceActorType : uint8_t
{
	Target                         = 0,
	Owner                          = 1,
	Custom                         = 2,
	ECommandRingReferenceActorType_MAX = 3
};


// Enum OakGame.EOakStatusEffectResourceEffectType
enum class EOakStatusEffectResourceEffectType : uint8_t
{
	Cryo                           = 0,
	EOakStatusEffectResourceEffectType_MAX = 1
};


// Enum OakGame.EHealthAdded
enum class EHealthAdded : uint8_t
{
	Success                        = 0,
	Falure                         = 1,
	EHealthAdded_MAX               = 2
};


// Enum OakGame.EValidIndex
enum class EValidIndex : uint8_t
{
	Valid                          = 0,
	Invalid                        = 1,
	EValidIndex_MAX                = 2
};


// Enum OakGame.EHealthState
enum class EHealthState : uint8_t
{
	Healthy                        = 0,
	Low                            = 1,
	VeryLow                        = 2,
	Injured                        = 3,
	Dead                           = 4,
	EHealthState_MAX               = 5
};


// Enum OakGame.EWeaponActionChannel
enum class EWeaponActionChannel : uint8_t
{
	Use                            = 0,
	Zoom                           = 1,
	Reload                         = 2,
	Other                          = 3,
	EWeaponActionChannel_MAX       = 4
};


// Enum OakGame.EZoomEventType
enum class EZoomEventType : uint8_t
{
	None                           = 0,
	ZoomingIn                      = 1,
	ZoomingOut                     = 2,
	EZoomEventType_MAX             = 3
};


// Enum OakGame.EDeathType
enum class EDeathType : uint8_t
{
	None                           = 0,
	HealthDepleted                 = 1,
	Suicide                        = 2,
	ScriptedInstantDeath           = 3,
	FellOutOfWorld                 = 4,
	Ragdoll                        = 5,
	EDeathType_MAX                 = 6
};


// Enum OakGame.EOakGender
enum class EOakGender : uint8_t
{
	Male                           = 0,
	Female                         = 1,
	Random                         = 2,
	EOakGender_MAX                 = 3
};


// Enum OakGame.EWeaponHolsteredSizeType
enum class EWeaponHolsteredSizeType : uint8_t
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	ExtraLarge                     = 3,
	EWeaponHolsteredSizeType_MAX   = 4
};


// Enum OakGame.ETargetedNameplateType
enum class ETargetedNameplateType : uint8_t
{
	Standard                       = 0,
	NPC                            = 1,
	Boss                           = 2,
	None                           = 3,
	ETargetedNameplateType_MAX     = 4
};


// Enum OakGame.EA9KSawState
enum class EA9KSawState : uint8_t
{
	NotStarted                     = 0,
	Cooldown                       = 1,
	PickTarget                     = 2,
	TryToReachTarget               = 3,
	ReachedTarget                  = 4,
	EquipSaw                       = 5,
	WaitForQuipAnimDone            = 6,
	Anticipation                   = 7,
	PrepareToShootAndShoot         = 8,
	WaitForBPCallback              = 9,
	FollowingTarget                = 10,
	Resting                        = 11,
	EA9KSawState_MAX               = 12
};


// Enum OakGame.EVaultRewardType
enum class EVaultRewardType : uint8_t
{
	None                           = 0,
	EridianAnalyser                = 1,
	EridianResonator               = 2,
	ArtifactSlot                   = 3,
	EridianFabricator              = 4,
	MayhemMode                     = 5,
	EVaultRewardType_MAX           = 6
};


// Enum OakGame.ETrackedIconOwner
enum class ETrackedIconOwner : uint8_t
{
	Unknown                        = 0,
	Released                       = 1,
	Minimap_Clamped                = 2,
	Minimap_Interior3D             = 3,
	InWorldContainer               = 4,
	ETrackedIconOwner_MAX          = 5
};


// Enum OakGame.EAnointedDeathState
enum class EAnointedDeathState : uint8_t
{
	PreFreeze                      = 0,
	Freezing                       = 1,
	Frozen                         = 2,
	ShatterKilled                  = 3,
	TimedOut                       = 4,
	EAnointedDeathState_MAX        = 5
};


// Enum OakGame.EVehicleDeathType
enum class EVehicleDeathType : uint8_t
{
	None                           = 0,
	HealthDepleted                 = 1,
	FellOutOfWorld                 = 2,
	DigistuctOut                   = 3,
	InstantDeath                   = 4,
	EVehicleDeathType_MAX          = 5
};


// Enum OakGame.EClearInputFilter
enum class EClearInputFilter : uint8_t
{
	ClearWeapons                   = 0,
	ClearInputComponent            = 1,
	DisableHover                   = 2,
	ClearAll                       = 3,
	EClearInputFilter_MAX          = 4
};


// Enum OakGame.ENavPainterLayer
enum class ENavPainterLayer : uint8_t
{
	Default                        = 0,
	Driver                         = 1,
	Scripted                       = 2,
	ENavPainterLayer_MAX           = 3
};


// Enum OakGame.EVehicleEffectEvent
enum class EVehicleEffectEvent : uint8_t
{
	None                           = 0,
	Boost                          = 1,
	BoostChargeCountChanged        = 2,
	BoostPoolEmpty                 = 3,
	BoostPoolFull                  = 4,
	StartEngine                    = 5,
	Braking                        = 6,
	Hover                          = 7,
	Horn                           = 8,
	Digithrust                     = 9,
	ShieldBreak                    = 10,
	ShieldHealthEvent_Normal       = 11,
	ShieldHealthEvent_Low          = 12,
	ShieldHealthEvent_VeryLow      = 13,
	ShieldFullHealth               = 14,
	Backfire                       = 15,
	MaxRPMBackfire                 = 16,
	HealthEvent_Healthy            = 17,
	HealthEvent_Low                = 18,
	HealthEvent_VeryLow            = 19,
	HealthEvent_Dead               = 20,
	StatusEffect_CryoFrozen        = 21,
	StatusEffect_CryoThawing       = 22,
	StatusEffect_Cryo              = 23,
	StatusEffect_Corrosive         = 24,
	StatusEffect_Shock             = 25,
	StatusEffect_Fire              = 26,
	StatusEffect_Radiation         = 27,
	EVehicleEffectEvent_MAX        = 28
};


// Enum OakGame.ENavCorrectionSetting
enum class ENavCorrectionSetting : uint8_t
{
	Default                        = 0,
	Enabled                        = 1,
	Disabled                       = 2,
	ENavCorrectionSetting_MAX      = 3
};


// Enum OakGame.EVehicleHealthState
enum class EVehicleHealthState : uint8_t
{
	Healthy                        = 0,
	Low                            = 1,
	VeryLow                        = 2,
	Dead                           = 3,
	EVehicleHealthState_MAX        = 4
};


// Enum OakGame.EIronBearExitReason
enum class EIronBearExitReason : uint8_t
{
	Undefined                      = 0,
	ActionSkillStopped             = 1,
	ManualExit                     = 2,
	Died                           = 3,
	FellOutOfWorld                 = 4,
	EmergencyExit                  = 5,
	EIronBearExitReason_MAX        = 6
};


// Enum OakGame.EIronBearHardPointOrientation
enum class EIronBearHardPointOrientation : uint8_t
{
	None                           = 0,
	Left                           = 1,
	Right                          = 2,
	EIronBearHardPointOrientation_MAX = 3
};


// Enum OakGame.EIronBearCoreType
enum class EIronBearCoreType : uint8_t
{
	None                           = 0,
	GundamBear                     = 1,
	StrengthThroughBalance         = 2,
	GunnersNest                    = 3,
	SurpriseforYou                 = 4,
	VeryIronBear                   = 5,
	HighVoltage                    = 6,
	IronCub                        = 7,
	EIronBearCoreType_MAX          = 8
};


// Enum OakGame.EIronBearDamageLevel
enum class EIronBearDamageLevel : uint8_t
{
	None                           = 0,
	Light                          = 1,
	Moderate                       = 2,
	Heavy                          = 3,
	EIronBearDamageLevel_MAX       = 4
};


// Enum OakGame.EIronBearSpawnStyle
enum class EIronBearSpawnStyle : uint8_t
{
	Full                           = 0,
	Quick                          = 1,
	EIronBearSpawnStyle_MAX        = 2
};


// Enum OakGame.EJumpType
enum class EJumpType : uint8_t
{
	None                           = 0,
	Default                        = 1,
	Sprint                         = 2,
	Slide                          = 3,
	UpwardLadderJump               = 4,
	EJumpType_MAX                  = 5
};


// Enum OakGame.EGameModeNotificationType
enum class EGameModeNotificationType : uint8_t
{
	None                           = 0,
	Raid_RaidSurvived              = 1,
	Raid_TeleporterActivated       = 2,
	Raid_Defeat                    = 3,
	Raid_PlayerIsOut               = 4,
	Raid_Start                     = 5,
	Raid_CountDown                 = 6,
	COS_Victory                    = 7,
	COS_Defeat                     = 8,
	COS_Wave                       = 9,
	COS_NotAllPlayersAssembled     = 10,
	GearUp_Victory                 = 11,
	GearUp_Defeat                  = 12,
	GearUp_Respawn                 = 13,
	GearUp_Start                   = 14,
	GearUp_Countdown               = 15,
	GearUp_SupplyDrop              = 16,
	GearUp_CircleClosing           = 17,
	GearUp_NewCircle               = 18,
	Off                            = 19,
	EGameModeNotificationType_MAX  = 20
};


// Enum OakGame.EDeathCircleStatus
enum class EDeathCircleStatus : uint8_t
{
	DCS_None                       = 0,
	DCS_Stable                     = 1,
	DCS_Transitioning              = 2,
	DCS_Complete                   = 3,
	DCS_MAX                        = 4
};


// Enum OakGame.EOakReticleFeedbackGameEvent
enum class EOakReticleFeedbackGameEvent : uint8_t
{
	None                           = 0,
	DamageCaused                   = 1,
	DeathCaused                    = 2,
	EOakReticleFeedbackGameEvent_MAX = 3
};


// Enum OakGame.ECanReRollInventoryResult
enum class ECanReRollInventoryResult : uint8_t
{
	Yes                            = 0,
	CantAfford                     = 1,
	No                             = 2,
	ECanReRollInventoryResult_MAX  = 3
};


// Enum OakGame.EPOIActivationResult
enum class EPOIActivationResult : uint8_t
{
	Success                        = 0,
	Failure_Generic                = 1,
	Failure_PlayerInMenu           = 2,
	Failure_AllyDown               = 3,
	Failure_FastTravelDisabled     = 4,
	Failure_PlayerInVehicle        = 5,
	Failure_ClientJoining          = 6,
	Failure_PlayerDueling          = 7,
	Failure_PhotoModeActive        = 8,
	EPOIActivationResult_MAX       = 9
};


// Enum OakGame.EKickReason
enum class EKickReason : uint8_t
{
	None                           = 0,
	Kicked                         = 1,
	Invite                         = 2,
	QuitGame                       = 3,
	SessionEnd                     = 4,
	TitleScreen                    = 5,
	IncompatibleMission            = 6,
	EKickReason_MAX                = 7
};


// Enum OakGame.EInventoryListType
enum class EInventoryListType : uint8_t
{
	IL_Primary                     = 0,
	IL_Bank                        = 1,
	IL_LostLoot                    = 2,
	IL_GearUp                      = 3,
	IL_MAX                         = 4
};


// Enum OakGame.EPlayerDifficultySetting
enum class EPlayerDifficultySetting : uint8_t
{
	Normal                         = 0,
	StoryMode                      = 1,
	MAX                            = 2
};


// Enum OakGame.ELateJoinState
enum class ELateJoinState : uint8_t
{
	NotLateJoining                 = 0,
	SelectingCharacter             = 1,
	ApplyingSaveGame               = 2,
	ELateJoinState_MAX             = 3
};


// Enum OakGame.ETradeRequestReceptionType
enum class ETradeRequestReceptionType : uint8_t
{
	All                            = 0,
	FriendsOnly                    = 1,
	Off                            = 2,
	MAX                            = 3
};


// Enum OakGame.EHyperHoopState
enum class EHyperHoopState : uint8_t
{
	Invalid                        = 0,
	NotStarted                     = 1,
	AttachingPawn                  = 2,
	Accelerating                   = 3,
	Moving                         = 4,
	Deccelerating                  = 5,
	DetachingPawn                  = 6,
	EHyperHoopState_MAX            = 7
};


// Enum OakGame.EVendingMachineBuyType
enum class EVendingMachineBuyType : uint8_t
{
	Regular                        = 0,
	BuyBack                        = 1,
	GearSoldByFriend               = 2,
	ItemOfTheDay                   = 3,
	EVendingMachineBuyType_MAX     = 4
};


// Enum OakGame.EVendingMachineScrollDirection
enum class EVendingMachineScrollDirection : uint8_t
{
	Forward                        = 0,
	Backward                       = 1,
	EVendingMachineScrollDirection_MAX = 2
};


// Enum OakGame.EGrenadeThrowFailureReason
enum class EGrenadeThrowFailureReason : uint8_t
{
	UnknownError                   = 0,
	ActionsLocked                  = 1,
	NotHealthy                     = 2,
	InternalCooldown               = 3,
	NotEnoughAmmo                  = 4,
	EGrenadeThrowFailureReason_MAX = 5
};


// Enum OakGame.EDuelClassification
enum class EDuelClassification : uint8_t
{
	Standard1v1                    = 0,
	FreeForAll                     = 1,
	EDuelClassification_MAX        = 2
};


// Enum OakGame.EDuelLoseReason
enum class EDuelLoseReason : uint8_t
{
	None                           = 0,
	PlayerKilled                   = 1,
	PlayerQuit                     = 2,
	OutOfBounds                    = 3,
	EDuelLoseReason_MAX            = 4
};


// Enum OakGame.EVehicleImpactForce
enum class EVehicleImpactForce : uint8_t
{
	Unknown                        = 0,
	Grinding                       = 1,
	VerySmall                      = 2,
	Small                          = 3,
	Medium                         = 4,
	Heavy                          = 5,
	Count                          = 6,
	EVehicleImpactForce_MAX        = 7
};


// Enum OakGame.EEffectStateType
enum class EEffectStateType : uint8_t
{
	Play                           = 0,
	Stop                           = 1,
	Count                          = 2,
	EEffectStateType_MAX           = 3
};


// Enum OakGame.EFreezeType
enum class EFreezeType : uint8_t
{
	Cryo                           = 0,
	Anointed                       = 1,
	MAX                            = 2
};


// Enum OakGame.EShieldEffectState
enum class EShieldEffectState : uint8_t
{
	Full                           = 0,
	Damaged                        = 1,
	Depleted                       = 2,
	EShieldEffectState_MAX         = 3
};


// Enum OakGame.EFreezeState
enum class EFreezeState : uint8_t
{
	None                           = 0,
	Freezing                       = 1,
	Frozen                         = 2,
	Thawing                        = 3,
	EFreezeState_MAX               = 4
};


// Enum OakGame.EOakUIInventoryItemUseType
enum class EOakUIInventoryItemUseType : uint8_t
{
	Unknown                        = 0,
	EquippableInternal             = 1,
	UsableInternal                 = 2,
	EOakUIInventoryItemUseType_MAX = 3
};


// Enum OakGame.EInteractiveObjectInteractiveState
enum class EInteractiveObjectInteractiveState : uint8_t
{
	None                           = 0,
	Interactive                    = 1,
	NonInteractive                 = 2,
	Uninitialized                  = 3,
	EInteractiveObjectInteractiveState_MAX = 4
};


// Enum OakGame.EInteractiveObjectLockState
enum class EInteractiveObjectLockState : uint8_t
{
	None                           = 0,
	Unlocked                       = 1,
	Locked                         = 2,
	Uninitialized                  = 3,
	EInteractiveObjectLockState_MAX = 4
};


// Enum OakGame.EInteractiveObjectState
enum class EInteractiveObjectState : uint8_t
{
	None                           = 0,
	Enabling                       = 1,
	Enabled                        = 2,
	Disabling                      = 3,
	Disabled                       = 4,
	Locked                         = 5,
	Uninitialized                  = 6,
	EInteractiveObjectState_MAX    = 7
};


// Enum OakGame.EPlayerAlertType
enum class EPlayerAlertType : uint8_t
{
	Location                       = 0,
	Neutral                        = 1,
	Friendly                       = 2,
	Hostile                        = 3,
	Loot                           = 4,
	Chest                          = 5,
	Max                            = 6
};


// Enum OakGame.EInteractiveObjectTrapActivationType
enum class EInteractiveObjectTrapActivationType : uint8_t
{
	ActivateTrap                   = 0,
	DeactivateTrap                 = 1,
	EInteractiveObjectTrapActivationType_MAX = 2
};


// Enum OakGame.EManagedWidgetType
enum class EManagedWidgetType : uint8_t
{
	Basic                          = 0,
	OnlineMessageAnimation         = 1,
	EManagedWidgetType_MAX         = 2
};


// Enum OakGame.EZoneMapChallengeStatus
enum class EZoneMapChallengeStatus : uint8_t
{
	ZMC_AvailableChallenge         = 0,
	ZMC_CompletedChallenge         = 1,
	ZMC_Unknown                    = 2,
	ZMC_MAX                        = 3
};


// Enum OakGame.EZoneMapMissionStatus
enum class EZoneMapMissionStatus : uint8_t
{
	ZMM_AvailableMission           = 0,
	ZMM_TrackedObjective           = 1,
	ZMM_OptionalObjective          = 2,
	ZMM_NotTrackedObjective        = 3,
	ZMM_OutOfMap                   = 4,
	ZMM_Unknown                    = 5,
	ZMM_MAX                        = 6
};


// Enum OakGame.EZoneMapViewerState
enum class EZoneMapViewerState : uint8_t
{
	Level                          = 0,
	Planet                         = 1,
	Galaxy                         = 2,
	Invalid                        = 3,
	EZoneMapViewerState_MAX        = 4
};


// Enum OakGame.EZoneMapMovementMode
enum class EZoneMapMovementMode : uint8_t
{
	Direct                         = 0,
	Interpolate                    = 1,
	Animate                        = 2,
	EZoneMapMovementMode_MAX       = 3
};


// Enum OakGame.EMissionDeliveryMenuDisplayState
enum class EMissionDeliveryMenuDisplayState : uint8_t
{
	Description                    = 0,
	Friends                        = 1,
	EMissionDeliveryMenuDisplayState_MAX = 2
};


// Enum OakGame.EOakMessageType
enum class EOakMessageType : uint8_t
{
	MessageType_PlayerJoined       = 0,
	MessageType_PlayerChangedName  = 1,
	MessageType_PlayerLeft         = 2,
	MessageType_PlayerUnableToJoin = 3,
	MessageType_SpectatorJoined    = 4,
	MessageType_MAX                = 5
};


// Enum OakGame.EMessageSpecialType
enum class EMessageSpecialType : uint8_t
{
	MST_None                       = 0,
	MST_TradeOffer                 = 1,
	MST_SeatSwapOffer              = 2,
	MST_MAX                        = 3
};


// Enum OakGame.EMainMenuViewpointType
enum class EMainMenuViewpointType : uint8_t
{
	TitleScreen                    = 0,
	OptionsMenu                    = 1,
	PlaythroughMode                = 2,
	NewGameSettings                = 3,
	MainMenuGroup                  = 4,
	CharacterSelect                = 5,
	BehindTheScenes                = 6,
	MAX                            = 7
};


// Enum OakGame.EActivityFeedImageAspectRatio
enum class EActivityFeedImageAspectRatio : uint8_t
{
	FEED_IMAGE_ASPECT_RATIO_1_X    = 0,
	FEED_IMAGE_ASPECT_RATIO_1_51_X = 1,
	FEED_IMAGE_ASPECT_RATIO_2_08_X = 2,
	FEED_IMAGE_ASPECT_RATIO_16_X   = 3,
	FEED_IMAGE_ASPECT_RATIO_4_X    = 4,
	FEED_IMAGE_ASPECT_RATIO_MAX    = 5
};


// Enum OakGame.EAIOOrientedParticleTargetType
enum class EAIOOrientedParticleTargetType : uint8_t
{
	None                           = 0,
	DefaultPosition                = 1,
	UIObject                       = 2,
	EAIOOrientedParticleTargetType_MAX = 3
};


// Enum OakGame.EA9KFightPhase
enum class EA9KFightPhase : uint8_t
{
	NotStarted                     = 0,
	Phase1                         = 1,
	Phase2                         = 2,
	Phase3                         = 3,
	Phase4                         = 4,
	Dead                           = 5,
	EA9KFightPhase_MAX             = 6
};


// Enum OakGame.EVehicleAchetypeNative
enum class EVehicleAchetypeNative : uint8_t
{
	Null                           = 0,
	Technical                      = 1,
	Outrunner                      = 2,
	Revolver                       = 3,
	Emperor                        = 4,
	Num                            = 5,
	EVehicleAchetypeNative_MAX     = 6
};


// Enum OakGame.EHeldActorPreset
enum class EHeldActorPreset : uint8_t
{
	Explosive                      = 0,
	Melee                          = 1,
	Shield                         = 2,
	EHeldActorPreset_MAX           = 3
};


// Enum OakGame.ECarnivoraBones
enum class ECarnivoraBones : uint8_t
{
	Root                           = 0,
	RW_Root                        = 1,
	RW_SuspensionR0                = 2,
	RW_SuspensionR1                = 3,
	RW_Wheel0                      = 4,
	RW_Tire0                       = 5,
	RW_Wheel1                      = 6,
	RW_Tire1                       = 7,
	RW_Wheel2                      = 8,
	RW_Tire2                       = 9,
	RW_SuspensionB0                = 10,
	RW_SuspensionB1                = 11,
	TrackShaft3                    = 12,
	TrackSuspension3               = 13,
	TrackTire3                     = 14,
	TrackShaft3_T                  = 15,
	SideAxle                       = 16,
	TrackShaft0                    = 17,
	TrackSuspension2               = 18,
	TrackTire2                     = 19,
	TrackShaft0_T                  = 20,
	SideAxle1                      = 21,
	TrackShaft1                    = 22,
	SideAxleSecondary              = 23,
	TrackSuspension1               = 24,
	TrackTire1                     = 25,
	TrackShaft1_T                  = 26,
	SideAxleSecondary1             = 27,
	SideAxle2                      = 28,
	TrackShaft2                    = 29,
	TrackSuspension0               = 30,
	TrackTire0                     = 31,
	TrackShaft2_T                  = 32,
	TunnelDoor                     = 33,
	MainAxle                       = 34,
	MainAxle_Part1                 = 35,
	MainAxle_Part2                 = 36,
	Count                          = 37,
	ECarnivoraBones_MAX            = 38
};


// Enum OakGame.EEmperorBones
enum class EEmperorBones : uint8_t
{
	Body                           = 0,
	Cannon_Yaw                     = 1,
	Cannon_Pitch                   = 2,
	Cannon_Recoil                  = 3,
	EntropyCore                    = 4,
	CannonTurret_Main              = 5,
	CannonTurret_Pitch             = 6,
	L_Turret_Yaw                   = 7,
	L_Turret_Pitch                 = 8,
	R_Turret_Yaw                   = 9,
	R_Turret_Pitch                 = 10,
	F_R_Wheel                      = 11,
	F_R_Wheel1                     = 12,
	F_R_Wheel2                     = 13,
	F_L_Wheel                      = 14,
	F_L_Wheel1                     = 15,
	F_L_Wheel2                     = 16,
	R_R_Wheel                      = 17,
	R_L_Wheel                      = 18,
	R_L_Wheel1                     = 19,
	R_R_Wheel1                     = 20,
	F_L_ThreadSuspension           = 21,
	F_R_ThreadSuspension           = 22,
	F_L_BigWheel_Suspension        = 23,
	F_R_BigWheel_Suspension        = 24,
	F_R_Hover01                    = 25,
	F_R_Hover02                    = 26,
	F_R_Hover03                    = 27,
	F_L_Hover01                    = 28,
	F_L_Hover02                    = 29,
	F_L_Hover03                    = 30,
	R_R_Hover01                    = 31,
	R_R_Hover02                    = 32,
	R_L_Hover01                    = 33,
	R_L_Hover02                    = 34,
	Count                          = 35,
	EEmperorBones_MAX              = 36
};


// Enum OakGame.EOutrunnerBoosterBones
enum class EOutrunnerBoosterBones : uint8_t
{
	Body                           = 0,
	L_Muffler                      = 1,
	R_Muffler                      = 2,
	M_Turbine                      = 3,
	L_Turbine                      = 4,
	R_Turbine                      = 5,
	L_Top_Muffler                  = 6,
	L_Bot_Muffler                  = 7,
	R_Top_Muffler                  = 8,
	R_Bot_Muffler                  = 9,
	L_Razor_Wing                   = 10,
	R_Razor_Wing                   = 11,
	Count                          = 12,
	EOutrunnerBoosterBones_MAX     = 13
};


// Enum OakGame.EOutrunnerBones
enum class EOutrunnerBones : uint8_t
{
	Body                           = 0,
	F_L_SuspensionArm              = 1,
	F_L_Steering                   = 2,
	F_L_Wheel                      = 3,
	F_R_SuspensionArm              = 4,
	F_R_Steering                   = 5,
	F_R_Wheel                      = 6,
	R_L_SuspensionArm              = 7,
	R_L_Steering                   = 8,
	R_L_Wheel                      = 9,
	R_R_SuspensionArm              = 10,
	R_R_Steering                   = 11,
	R_R_Wheel                      = 12,
	Turret_Yaw                     = 13,
	F_Cannon                       = 14,
	F_Cannon_Visual                = 15,
	Turret_Pitch                   = 16,
	SteeringWheel                  = 17,
	F_L_Spring01                   = 18,
	F_L_Spring02                   = 19,
	F_R_Spring01                   = 20,
	F_R_Spring02                   = 21,
	R_L_Spring01                   = 22,
	R_L_Spring02                   = 23,
	R_R_Spring01                   = 24,
	R_R_Spring02                   = 25,
	SeatMain                       = 26,
	Count                          = 27,
	EOutrunnerBones_MAX            = 28
};


// Enum OakGame.ERevolverBoosterBones
enum class ERevolverBoosterBones : uint8_t
{
	Root                           = 0,
	Main                           = 1,
	Muffler                        = 2,
	Helix                          = 3,
	Count                          = 4,
	ERevolverBoosterBones_MAX      = 5
};


// Enum OakGame.ERevolverBones
enum class ERevolverBones : uint8_t
{
	Body_Banking                   = 0,
	Body_Pitch                     = 1,
	Wheels                         = 2,
	SteeringWheel                  = 3,
	Count                          = 4,
	ERevolverBones_MAX             = 5
};


// Enum OakGame.ETechnicalBones
enum class ETechnicalBones : uint8_t
{
	Body                           = 0,
	LeftMuffler                    = 1,
	RightMuffler                   = 2,
	Engine                         = 3,
	R_Axle                         = 4,
	R_R_Wheel                      = 5,
	R_L_Wheel                      = 6,
	F_R_Wheel                      = 7,
	F_L_Wheel                      = 8,
	F_L_Axle                       = 9,
	F_L_Steering                   = 10,
	F_L_Steering_T                 = 11,
	F_L_SteeringShaft              = 12,
	F_L_SuspensionUp               = 13,
	F_L_SuspensionBodyUp_T         = 14,
	F_L_SuspensionBodyDn           = 15,
	F_L_SuspensionDn_T             = 16,
	F_L_SuspensionSprings          = 17,
	F_L_SuspensionSpringsBody      = 18,
	F_R_Axle                       = 19,
	F_R_Steering                   = 20,
	F_R_Steering_T                 = 21,
	F_R_SteeringShaft              = 22,
	F_R_SuspensionUp               = 23,
	F_R_SuspensionBodyUp_T         = 24,
	F_R_SuspensionBodyDn           = 25,
	F_R_SuspensionDn_T             = 26,
	F_R_SuspensionSprings          = 27,
	F_R_SuspensionSpringsBody      = 28,
	F_Cannon                       = 29,
	F_Cannon_Visual                = 30,
	Turret                         = 31,
	Player2                        = 32,
	R_DriveShaftPole               = 33,
	R_DriveShaftBodyPole           = 34,
	R_DriveShaftAttach             = 35,
	R_DriveShaftBodyAttach         = 36,
	F_R_DriveShaft00               = 37,
	F_R_DriveShaft01               = 38,
	F_R_DriveShaft02               = 39,
	F_L_DriveShaft00               = 40,
	F_L_DriveShaft01               = 41,
	F_L_DriveShaft02               = 42,
	SteeringWheel                  = 43,
	F_R_Wheel_Hover                = 44,
	F_L_Wheel_Hover                = 45,
	R_R_Wheel_Hover                = 46,
	R_L_Wheel_Hover                = 47,
	F_DriveShaftAttach             = 48,
	F_DriveShaftPole               = 49,
	F_DriveShaftBodyAttach         = 50,
	R_L_Suspension_Body            = 51,
	R_L_Suspension_Axle            = 52,
	R_R_Suspension_Body            = 53,
	R_R_Suspension_Axle            = 54,
	EngineShaft                    = 55,
	EngineBelt                     = 56,
	Seat                           = 57,
	Count                          = 58,
	ETechnicalBones_MAX            = 59
};


// Enum OakGame.ETrailerBones
enum class ETrailerBones : uint8_t
{
	F_Axle                         = 0,
	F_R_Wheel                      = 1,
	F_L_Wheel                      = 2,
	R_Axle                         = 3,
	R_R_Wheel                      = 4,
	R_L_Wheel                      = 5,
	R_R_Spring_Axle                = 6,
	R_L_Spring_Axle                = 7,
	R_R_Spring_Body                = 8,
	R_L_Spring_Body                = 9,
	Count                          = 10,
	ETrailerBones_MAX              = 11
};


// Enum OakGame.EDualWeaponBones
enum class EDualWeaponBones : uint8_t
{
	Root                           = 0,
	Main                           = 1,
	Base                           = 2,
	L_Base                         = 3,
	L_Shoulder                     = 4,
	L_Elbow                        = 5,
	L_End                          = 6,
	L_Elbow_Piston                 = 7,
	L_Shoulder_Piston              = 8,
	L_Pitch                        = 9,
	L_Projectile                   = 10,
	R_Base                         = 11,
	R_Shoulder                     = 12,
	R_Elbow                        = 13,
	R_End                          = 14,
	R_Elbow_Piston                 = 15,
	R_Shoulder_Piston              = 16,
	R_Pitch                        = 17,
	R_Projectile                   = 18,
	L_BaseAttach                   = 19,
	R_BaseAttach                   = 20,
	Count                          = 21,
	EDualWeaponBones_MAX           = 22
};


// Enum OakGame.EWeaponBones
enum class EWeaponBones : uint8_t
{
	None                           = 0,
	Root                           = 1,
	Main                           = 2,
	Turret_Yaw                     = 3,
	Turret_Pitch                   = 4,
	Cannon_Yaw                     = 5,
	Cannon_Pitch                   = 6,
	Projectile                     = 7,
	Count                          = 8,
	EWeaponBones_MAX               = 9
};


// Enum OakGame.EPetRespawnCooldownRefundType
enum class EPetRespawnCooldownRefundType : uint8_t
{
	PetProfileChanged              = 0,
	EPetRespawnCooldownRefundType_MAX = 1
};


// Enum OakGame.EPetReleaseReason
enum class EPetReleaseReason : uint8_t
{
	SpawnCheckFailed               = 0,
	PetProfileChanged              = 1,
	PetDied                        = 2,
	PlayerDied                     = 3,
	EPetReleaseReason_MAX          = 4
};


// Enum OakGame.EBehindTheScenesItemType
enum class EBehindTheScenesItemType : uint8_t
{
	Video                          = 0,
	Slideshow                      = 1,
	EBehindTheScenesItemType_MAX   = 2
};


// Enum OakGame.EIntroType
enum class EIntroType : uint8_t
{
	EnterFromGround                = 0,
	EnterFromSwapSeat              = 1,
	HijackFromGround               = 2,
	HijackFromSwapSeat             = 3,
	EIntroType_MAX                 = 4
};


// Enum OakGame.ECARStatus
enum class ECARStatus : uint8_t
{
	Locked                         = 0,
	Unfolding                      = 1,
	Active                         = 2,
	Inactive                       = 3,
	ECARStatus_MAX                 = 4
};


// Enum OakGame.ECarnivoraFakeTurretShootingStyle
enum class ECarnivoraFakeTurretShootingStyle : uint8_t
{
	TARGET_AROUND_PLAYER           = 0,
	CONE_IN_DIRECTION              = 1,
	ECarnivoraFakeTurretShootingStyle_MAX = 2
};


// Enum OakGame.ECarnivoraAverageLocation
enum class ECarnivoraAverageLocation : uint8_t
{
	FRONT_RIGHT                    = 0,
	FRONT_LEFT                     = 1,
	BACK_RIGHT                     = 2,
	BACK_LEFT                      = 3,
	NUM                            = 4,
	ECarnivoraAverageLocation_MAX  = 5
};


// Enum OakGame.ECarnivoraPartName
enum class ECarnivoraPartName : uint8_t
{
	FRONT_WHEEL                    = 0,
	FRONT_WHEEL01                  = 1,
	FRONT_WHEEL02                  = 2,
	TIRE_TRACK                     = 3,
	TIRE_TRACK01                   = 4,
	TIRE_TRACK02                   = 5,
	TIRE_TRACK03                   = 6,
	NUM                            = 7,
	ECarnivoraPartName_MAX         = 8
};


// Enum OakGame.ECharacterEchoDataMediaPlaybackType
enum class ECharacterEchoDataMediaPlaybackType : uint8_t
{
	PlayAndClose                   = 0,
	LoopUntilAudioEnds             = 1,
	ECharacterEchoDataMediaPlaybackType_MAX = 2
};


// Enum OakGame.ECrosshairColorsEnum
enum class ECrosshairColorsEnum : uint8_t
{
	NONE                           = 0,
	WHITE                          = 1,
	GREEN                          = 2,
	RED                            = 3,
	TEAL                           = 4,
	ORANGE                         = 5,
	PURPLE                         = 6,
	MAX                            = 7
};


// Enum OakGame.EDamagePresentationLevel
enum class EDamagePresentationLevel : uint8_t
{
	Negligible                     = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	MAX                            = 4
};


// Enum OakGame.EDiscoveryAreaDrawStyle
enum class EDiscoveryAreaDrawStyle : uint8_t
{
	None                           = 0,
	Wire                           = 1,
	Solid                          = 2,
	SolidAndWire                   = 3,
	EDiscoveryAreaDrawStyle_MAX    = 4
};


// Enum OakGame.EDuelTotemDestroyReason
enum class EDuelTotemDestroyReason : uint8_t
{
	None                           = 0,
	TimedOut                       = 1,
	Canceled                       = 2,
	DuelFinished                   = 3,
	EDuelTotemDestroyReason_MAX    = 4
};


// Enum OakGame.EPotentialDuelState
enum class EPotentialDuelState : uint8_t
{
	None                           = 0,
	WaitingToBeAccepted            = 1,
	WaitingToStart                 = 2,
	Started                        = 3,
	EPotentialDuelState_MAX        = 4
};


// Enum OakGame.EActiveDuelStatus
enum class EActiveDuelStatus : uint8_t
{
	WaitingToStart                 = 0,
	InProgress                     = 1,
	Finished                       = 2,
	EActiveDuelStatus_MAX          = 3
};


// Enum OakGame.EDuelMode
enum class EDuelMode : uint8_t
{
	OnFoot                         = 0,
	Vehicle                        = 1,
	EDuelMode_MAX                  = 2
};


// Enum OakGame.ECanSprintResult
enum class ECanSprintResult : uint8_t
{
	Yes                            = 0,
	No                             = 1,
	Cancel                         = 2,
	ECanSprintResult_MAX           = 3
};


// Enum OakGame.EEchoDeviceButton
enum class EEchoDeviceButton : uint8_t
{
	Button1                        = 0,
	Button2                        = 1,
	Button3                        = 2,
	Count                          = 3,
	EEchoDeviceButton_MAX          = 4
};


// Enum OakGame.EEchoLogBlockedStartMethod
enum class EEchoLogBlockedStartMethod : uint8_t
{
	Cancel                         = 0,
	PlayInWorldOnly                = 1,
	Queue                          = 2,
	Interrupt                      = 3,
	EEchoLogBlockedStartMethod_MAX = 4
};


// Enum OakGame.EEchoLogDisplayCategory
enum class EEchoLogDisplayCategory : uint8_t
{
	EchoLog                        = 0,
	EridianLog                     = 1,
	TyphonLog                      = 2,
	EEchoLogDisplayCategory_MAX    = 3
};


// Enum OakGame.EDamagePresentationModifier
enum class EDamagePresentationModifier : uint8_t
{
	Default                        = 0,
	Increase                       = 1,
	Decrease                       = 2,
	EDamagePresentationModifier_MAX = 3
};


// Enum OakGame.EElementalEffectSizeComputationType
enum class EElementalEffectSizeComputationType : uint8_t
{
	BoundsSphereRadius             = 0,
	BoundsBoxExtentMaxAxis         = 1,
	EElementalEffectSizeComputationType_MAX = 2
};


// Enum OakGame.EElementalInteractionMode
enum class EElementalInteractionMode : uint8_t
{
	Default                        = 0,
	OnlyTransmit                   = 1,
	OnlyReceive                    = 2,
	EElementalInteractionMode_MAX  = 3
};


// Enum OakGame.EElementalInteractionSourceMode
enum class EElementalInteractionSourceMode : uint8_t
{
	Default                        = 0,
	Always                         = 1,
	Never                          = 2,
	OnlyThroughBlueprint           = 3,
	EElementalInteractionSourceMode_MAX = 4
};


// Enum OakGame.EPuddleState
enum class EPuddleState : uint8_t
{
	Spawning                       = 0,
	Idle                           = 1,
	CleaningUp                     = 2,
	CleanedUp                      = 3,
	EPuddleState_MAX               = 4
};


// Enum OakGame.ENativeEnemyExperienceType
enum class ENativeEnemyExperienceType : uint8_t
{
	Chump                          = 0,
	Normal                         = 1,
	NormalHigh                     = 2,
	Tough                          = 3,
	ToughHigh                      = 4,
	Badass                         = 5,
	SuperBadass                    = 6,
	UltimateBadass                 = 7,
	Boss                           = 8,
	ENativeEnemyExperienceType_MAX = 9
};


// Enum OakGame.EWeaponInputChannel
enum class EWeaponInputChannel : uint8_t
{
	Channel1                       = 0,
	Channel2                       = 1,
	EWeaponInputChannel_MAX        = 2
};


// Enum OakGame.EWeaponUseMode
enum class EWeaponUseMode : uint8_t
{
	Mode1                          = 0,
	Mode2                          = 1,
	Mode3                          = 2,
	EWeaponUseMode_MAX             = 3
};


// Enum OakGame.EFriendEventPriority
enum class EFriendEventPriority : uint8_t
{
	Highest                        = 0,
	High                           = 1,
	Normal                         = 2,
	Low                            = 3,
	EFriendEventPriority_MAX       = 4
};


// Enum OakGame.EFriendEventType
enum class EFriendEventType : uint8_t
{
	None                           = 0,
	LevelUp                        = 1,
	GearSold                       = 2,
	GearReceived                   = 3,
	PlotMissionCompletion          = 4,
	SideMissionCompletion          = 5,
	PropagateRareSpawnMission      = 6,
	KilledEnemy                    = 7,
	KilledNamedEnemy               = 8,
	KilledBoss                     = 9,
	GuardianRankMilestone          = 10,
	ChallengeUpdate                = 11,
	ChallengeCompletion            = 12,
	ProvingGroundCompletion        = 13,
	CircleOfSlaughterCompletion    = 14,
	RaidCompletion                 = 15,
	UnlockedTrueVaultHunterMode    = 16,
	SlotMachineJackpot             = 17,
	OpenedGoldenChest              = 18,
	SentMail                       = 19,
	FriendGearPurchased            = 20,
	LookingForHelp                 = 21,
	AchievementUnlocked            = 22,
	ChallengeUpdatesMerged         = 23,
	LikedEvent                     = 24,
	CustomizationAcquired          = 25,
	Max                            = 26
};


// Enum OakGame.EFriendEventNotificationLifetime
enum class EFriendEventNotificationLifetime : uint8_t
{
	Normal                         = 0,
	Long                           = 1,
	VeryLong                       = 2,
	EFriendEventNotificationLifetime_MAX = 3
};


// Enum OakGame.EFriendEventNotificationFrequency
enum class EFriendEventNotificationFrequency : uint8_t
{
	Off                            = 0,
	VeryLow                        = 1,
	Low                            = 2,
	Normal                         = 3,
	High                           = 4,
	VeryHigh                       = 5,
	EFriendEventNotificationFrequency_MAX = 6
};


// Enum OakGame.EFrontendStandInAnimType
enum class EFrontendStandInAnimType : uint8_t
{
	Default                        = 0,
	CharacterSelect                = 1,
	CharacterCreate                = 2,
	RnRCharaterCreate              = 3,
	EFrontendStandInAnimType_MAX   = 4
};


// Enum OakGame.EOakCharacterMovementConditionType
enum class EOakCharacterMovementConditionType : uint8_t
{
	IsGroundSlamming               = 0,
	IsLandingFromGroundSlam        = 1,
	EOakCharacterMovementConditionType_MAX = 2
};


// Enum OakGame.EBoostChargeCountComparisonMode
enum class EBoostChargeCountComparisonMode : uint8_t
{
	Equal                          = 0,
	NotEqual                       = 1,
	GreaterThan                    = 2,
	GreaterThanOrEqual             = 3,
	SmallerThan                    = 4,
	SmallerThanOrEqual             = 5,
	FullCharges                    = 6,
	EBoostChargeCountComparisonMode_MAX = 7
};


// Enum OakGame.EBoostPoolValueComparisonMode
enum class EBoostPoolValueComparisonMode : uint8_t
{
	Equal                          = 0,
	NotEqual                       = 1,
	GreaterThan                    = 2,
	GreaterThanOrEqual             = 3,
	SmallerThan                    = 4,
	SmallerThanOrEqual             = 5,
	EBoostPoolValueComparisonMode_MAX = 6
};


// Enum OakGame.EGbxGFxDialogBoxButtonType
enum class EGbxGFxDialogBoxButtonType : uint8_t
{
	ListButtons                    = 0,
	HintBox                        = 1,
	EGbxGFxDialogBoxButtonType_MAX = 2
};


// Enum OakGame.EGbxGFxDialogBoxStyle
enum class EGbxGFxDialogBoxStyle : uint8_t
{
	Default                        = 0,
	Warning                        = 1,
	Error                          = 2,
	Keybinding                     = 3,
	EGbxGFxDialogBoxStyle_MAX      = 4
};


// Enum OakGame.EShiftReportReason
enum class EShiftReportReason : uint8_t
{
	Username                       = 0,
	Sportsmanship                  = 1,
	Abuse                          = 2,
	HateSpeech                     = 3,
	LeavingOrAfk                   = 4,
	Cheating                       = 5,
	UserGeneratedContent           = 6,
	IllicitBehavior                = 7,
	EShiftReportReason_MAX         = 8
};


// Enum OakGame.EGbxInputEvent_OakUIAxis_Events
enum class EGbxInputEvent_OakUIAxis_Events : uint8_t
{
	Pressed                        = 0,
	Held                           = 1,
	Released                       = 2,
	EGbxInputEvent_OakUIAxis_MAX   = 3
};


// Enum OakGame.EGeyserBehavior
enum class EGeyserBehavior : uint8_t
{
	None                           = 0,
	Intermittent                   = 1,
	AlwaysOn                       = 2,
	EGeyserBehavior_MAX            = 3
};


// Enum OakGame.EGeyserState
enum class EGeyserState : uint8_t
{
	None                           = 0,
	SteamOn                        = 1,
	SteamOff                       = 2,
	SteamAnticipationOn            = 3,
	SteamAnticipationOff           = 4,
	EGeyserState_MAX               = 5
};


// Enum OakGame.EAmmoBarMode
enum class EAmmoBarMode : uint8_t
{
	None                           = 0,
	NoMode                         = 1,
	ModeSwitch                     = 2,
	COV                            = 3,
	EridianFabricator              = 4,
	EAmmoBarMode_MAX               = 5
};


// Enum OakGame.EMovieFFRWState
enum class EMovieFFRWState : uint8_t
{
	RegularPlayback                = 0,
	FastForward                    = 1,
	Rewind                         = 2,
	EMovieFFRWState_MAX            = 3
};


// Enum OakGame.EBuddyWidgetFanfareState
enum class EBuddyWidgetFanfareState : uint8_t
{
	None                           = 0,
	LevelUp                        = 1,
	SecondWind                     = 2,
	EBuddyWidgetFanfareState_MAX   = 3
};


// Enum OakGame.EBuddyWidgetState
enum class EBuddyWidgetState : uint8_t
{
	Healthy                        = 0,
	Healthy_JustRespawned          = 1,
	Dying                          = 2,
	BeingRevived                   = 3,
	Respawning                     = 4,
	RespawnTimer                   = 5,
	Spectating                     = 6,
	EBuddyWidgetState_MAX          = 7
};


// Enum OakGame.EBuddyWidgetContainerAnimState
enum class EBuddyWidgetContainerAnimState : uint8_t
{
	Inactive                       = 0,
	SlideIn                        = 1,
	SlideOut                       = 2,
	SlideDown                      = 3,
	EBuddyWidgetContainerAnimState_MAX = 4
};


// Enum OakGame.EGFxCARMenuPage
enum class EGFxCARMenuPage : uint8_t
{
	Loadout                        = 0,
	Customize                      = 1,
	Deploy                         = 2,
	EGFxCARMenuPage_MAX            = 3
};


// Enum OakGame.EGFxCARMenuPartCellType
enum class EGFxCARMenuPartCellType : uint8_t
{
	None                           = 0,
	LoadoutButton                  = 1,
	CustomizeCell                  = 2,
	EGFxCARMenuPartCellType_MAX    = 3
};


// Enum OakGame.EGFxChallegeProgressWidgetState
enum class EGFxChallegeProgressWidgetState : uint8_t
{
	Off                            = 0,
	On                             = 1,
	Out                            = 2,
	EGFxChallegeProgressWidgetState_MAX = 3
};


// Enum OakGame.ECheckpointWidgetState
enum class ECheckpointWidgetState : uint8_t
{
	None                           = 0,
	Hidden                         = 1,
	Intro                          = 2,
	Idle                           = 3,
	Exit                           = 4,
	ECheckpointWidgetState_MAX     = 5
};


// Enum OakGame.EColorPickerMode
enum class EColorPickerMode : uint8_t
{
	All                            = 0,
	PrimarySecondary               = 1,
	PrimaryOnly                    = 2,
	EColorPickerMode_MAX           = 3
};


// Enum OakGame.EColorSelectionType
enum class EColorSelectionType : uint8_t
{
	TopColor                       = 0,
	BottomColor                    = 1,
	ResetBothToDefault             = 2,
	EColorSelectionType_MAX        = 3
};


// Enum OakGame.ECrosshairType
enum class ECrosshairType : uint8_t
{
	NORMAL                         = 0,
	IRONBEAR                       = 1,
	ECrosshairType_MAX             = 2
};


// Enum OakGame.ECrosshairState
enum class ECrosshairState : uint8_t
{
	NORMAL                         = 0,
	ACTION_SKILL                   = 1,
	SPRINTING                      = 2,
	MELEE                          = 3,
	ECrosshairState_MAX            = 4
};


// Enum OakGame.EGFxCurrencyCounterState
enum class EGFxCurrencyCounterState : uint8_t
{
	Off                            = 0,
	AnimatingToValue               = 1,
	HoldingOnValue                 = 2,
	EGFxCurrencyCounterState_MAX   = 3
};


// Enum OakGame.EGFxDuelingTimerState
enum class EGFxDuelingTimerState : uint8_t
{
	TimerOnly                      = 0,
	TimerAndMatch                  = 1,
	Challenger                     = 2,
	TimeOut                        = 3,
	Hidden                         = 4,
	EGFxDuelingTimerState_MAX      = 5
};


// Enum OakGame.EECHOLOGWidgetState
enum class EECHOLOGWidgetState : uint8_t
{
	Inactive                       = 0,
	Activating                     = 1,
	Displayed                      = 2,
	Deactivating                   = 3,
	EECHOLOGWidgetState_MAX        = 4
};


// Enum OakGame.EGFxMailboxMenuMailSort
enum class EGFxMailboxMenuMailSort : uint8_t
{
	Date                           = 0,
	Unread                         = 1,
	Friend                         = 2,
	System                         = 3,
	EGFxMailboxMenuMailSort_MAX    = 4
};


// Enum OakGame.EGFxMailboxMenuState
enum class EGFxMailboxMenuState : uint8_t
{
	None                           = 0,
	Receive                        = 1,
	Send_ChooseItem                = 2,
	Send_ChooseFriend              = 3,
	Send_Confirm                   = 4,
	EGFxMailboxMenuState_MAX       = 5
};


// Enum OakGame.EGFxRosterCellType
enum class EGFxRosterCellType : uint8_t
{
	EmptyCell                      = 0,
	FindShiftFriendButton          = 1,
	ManageShiftFriendsButton       = 2,
	OnlineFriendInThisGame         = 3,
	OnlineFriend                   = 4,
	OfflineFriend                  = 5,
	EGFxRosterCellType_MAX         = 6
};


// Enum OakGame.EECHOWidgetState
enum class EECHOWidgetState : uint8_t
{
	Inactive                       = 0,
	Activating                     = 1,
	Displayed                      = 2,
	Deactivating                   = 3,
	EECHOWidgetState_MAX           = 4
};


// Enum OakGame.EGFxExperienceBarState
enum class EGFxExperienceBarState : uint8_t
{
	None                           = 0,
	ExperienceAddedAnimation       = 1,
	LevelUpAnimation               = 2,
	FadingOut                      = 3,
	EGFxExperienceBarState_MAX     = 4
};


// Enum OakGame.EGFxFeedWidgetState
enum class EGFxFeedWidgetState : uint8_t
{
	Off                            = 0,
	On                             = 1,
	Out                            = 2,
	EGFxFeedWidgetState_MAX        = 3
};


// Enum OakGame.EFFYLBarState
enum class EFFYLBarState : uint8_t
{
	Dying                          = 0,
	BeingRevived                   = 1,
	Reviving                       = 2,
	EFFYLBarState_MAX              = 3
};


// Enum OakGame.EGFxFrontendLandingPageType
enum class EGFxFrontendLandingPageType : uint8_t
{
	WantsOnline                    = 0,
	WantsLan                       = 1,
	WantsInGameForMail             = 2,
	EGFxFrontendLandingPageType_MAX = 3
};


// Enum OakGame.EGFxFrontendMenuFocusAnim
enum class EGFxFrontendMenuFocusAnim : uint8_t
{
	Standard                       = 0,
	MainMenuFocus                  = 1,
	Focused                        = 2,
	EGFxFrontendMenuFocusAnim_MAX  = 3
};


// Enum OakGame.EGFxFrontendMenuMode
enum class EGFxFrontendMenuMode : uint8_t
{
	Unknown                        = 0,
	MainMenu                       = 1,
	EchoNetMenus                   = 2,
	SettingsMenus                  = 3,
	NewGameMenu                    = 4,
	EGFxFrontendMenuMode_MAX       = 5
};


// Enum OakGame.EGFxGrenadeIndicatorMode
enum class EGFxGrenadeIndicatorMode : uint8_t
{
	Hidden                         = 0,
	Safe                           = 1,
	Danger                         = 2,
	EGFxGrenadeIndicatorMode_MAX   = 3
};


// Enum OakGame.EGFxGuardianRankMenuState
enum class EGFxGuardianRankMenuState : uint8_t
{
	None                           = 0,
	MenuLocked                     = 1,
	GuardianRankDisabled           = 2,
	Information_RedeemButtonSelected = 3,
	Information_PerkSelected       = 4,
	TokenRedemption                = 5,
	TokenRedemption_WaitingForPurchase = 6,
	EGFxGuardianRankMenuState_MAX  = 7
};


// Enum OakGame.ECalibrationOptionSourceType
enum class ECalibrationOptionSourceType : uint8_t
{
	COST_FromPlayerController      = 0,
	COST_FromRecent                = 1,
	COST_FromDefaults              = 2,
	COST_MAX                       = 3
};


// Enum OakGame.EHUDInitAnimWidgetTarget
enum class EHUDInitAnimWidgetTarget : uint8_t
{
	None                           = 0,
	HealthBar                      = 1,
	XPBar                          = 2,
	Minimap                        = 3,
	MissionTracker                 = 4,
	AmmoBar                        = 5,
	ShieldBar                      = 6,
	GrenadeBar                     = 7,
	EHUDInitAnimWidgetTarget_MAX   = 8
};


// Enum OakGame.EPromptLinesLayouts
enum class EPromptLinesLayouts : uint8_t
{
	INVALID                        = 0,
	PrimaryPress                   = 1,
	PrimaryHold                    = 2,
	PrimaryPress_PrimaryHold       = 3,
	PrimaryPress_SecondaryPress    = 4,
	PrimaryPress_SecondaryHold     = 5,
	PrimaryHold_SecondaryPress     = 6,
	PrimaryHold_SecondaryHold      = 7,
	EPromptLinesLayouts_MAX        = 8
};


// Enum OakGame.EInteractionPromptGlyphMode
enum class EInteractionPromptGlyphMode : uint8_t
{
	InvalidForUseDef               = 0,
	Normal                         = 1,
	CantUse                        = 2,
	Locked                         = 3,
	EInteractionPromptGlyphMode_MAX = 4
};


// Enum OakGame.EGFxInventoryMenuBackpackSize
enum class EGFxInventoryMenuBackpackSize : uint8_t
{
	TwoColumns                     = 0,
	OneColumn                      = 1,
	EGFxInventoryMenuBackpackSize_MAX = 2
};


// Enum OakGame.EGFxInventoryMenuFocusSide
enum class EGFxInventoryMenuFocusSide : uint8_t
{
	None                           = 0,
	PaperDoll                      = 1,
	Backpack                       = 2,
	EGFxInventoryMenuFocusSide_MAX = 3
};


// Enum OakGame.EGFxInWorldIconClampUpdate
enum class EGFxInWorldIconClampUpdate : uint8_t
{
	Unknown                        = 0,
	NotClamped                     = 1,
	ClampedInFront                 = 2,
	ClampedBehind                  = 3,
	EGFxInWorldIconClampUpdate_MAX = 4
};


// Enum OakGame.EInWorldIconRange
enum class EInWorldIconRange : uint8_t
{
	None                           = 0,
	Near                           = 1,
	Far                            = 2,
	EInWorldIconRange_MAX          = 3
};


// Enum OakGame.EGFxItemInspectionPages
enum class EGFxItemInspectionPages : uint8_t
{
	None                           = 0,
	Inspect                        = 1,
	Manufacturer                   = 2,
	Elemental                      = 3,
	Parts                          = 4,
	Skins                          = 5,
	EGFxItemInspectionPages_MAX    = 6
};


// Enum OakGame.EBackButtonHint
enum class EBackButtonHint : uint8_t
{
	Back                           = 0,
	Cancel                         = 1,
	Exit                           = 2,
	EBackButtonHint_MAX            = 3
};


// Enum OakGame.ETradingMenuState
enum class ETradingMenuState : uint8_t
{
	Offering                       = 0,
	Backpack                       = 1,
	Done                           = 2,
	ETradingMenuState_MAX          = 3
};


// Enum OakGame.ELeaguesMenuLayout
enum class ELeaguesMenuLayout : uint8_t
{
	None                           = 0,
	Overview                       = 1,
	Challenges                     = 2,
	ELeaguesMenuLayout_MAX         = 3
};


// Enum OakGame.EGFxMainAndPauseMenuType
enum class EGFxMainAndPauseMenuType : uint8_t
{
	Unknown                        = 0,
	Main                           = 1,
	Pause                          = 2,
	EGFxMainAndPauseMenuType_MAX   = 3
};


// Enum OakGame.EGFxMapMenuProgressPanelState
enum class EGFxMapMenuProgressPanelState : uint8_t
{
	None                           = 0,
	Progress                       = 1,
	List                           = 2,
	EGFxMapMenuProgressPanelState_MAX = 3
};


// Enum OakGame.EDetailsPanelMode
enum class EDetailsPanelMode : uint8_t
{
	Unknown                        = 0,
	NoTarget                       = 1,
	POIInfo                        = 2,
	Challenge                      = 3,
	Mission                        = 4,
	PlanetOverview                 = 5,
	LevelOverview                  = 6,
	POIInfoPlayer                  = 7,
	EDetailsPanelMode_MAX          = 8
};


// Enum OakGame.EGFxMapMenuState
enum class EGFxMapMenuState : uint8_t
{
	None                           = 0,
	Tutorial_Stage1                = 1,
	Tutorial_Stage2                = 2,
	Tutorial_Stage3                = 3,
	Tutorial_Stage4                = 4,
	Tutorial_Stage5                = 5,
	Progress                       = 6,
	FastTravel                     = 7,
	Challenges                     = 8,
	Friends                        = 9,
	EGFxMapMenuState_MAX           = 10
};


// Enum OakGame.EGFxMapMenuMapState
enum class EGFxMapMenuMapState : uint8_t
{
	None                           = 0,
	Level                          = 1,
	Planet                         = 2,
	Galaxy                         = 3,
	EGFxMapMenuMapState_MAX        = 4
};


// Enum OakGame.EGFxMenuTutorialFocusDirection
enum class EGFxMenuTutorialFocusDirection : uint8_t
{
	Center                         = 0,
	Left                           = 1,
	Right                          = 2,
	SameAsStardard                 = 3,
	EGFxMenuTutorialFocusDirection_MAX = 4
};


// Enum OakGame.EGFxMenuTutorialDialogSize
enum class EGFxMenuTutorialDialogSize : uint8_t
{
	Large                          = 0,
	Medium                         = 1,
	Small                          = 2,
	EGFxMenuTutorialDialogSize_MAX = 3
};


// Enum OakGame.EGFxMinimapWidgetIconTrackedType
enum class EGFxMinimapWidgetIconTrackedType : uint8_t
{
	Unused                         = 0,
	Mission                        = 1,
	MinimapIconComponent           = 2,
	CustomWaypoint                 = 3,
	PlayerIcon                     = 4,
	EGFxMinimapWidgetIconTrackedType_MAX = 5
};


// Enum OakGame.EGFxMissionLogMissionItemType
enum class EGFxMissionLogMissionItemType : uint8_t
{
	Mission                        = 0,
	EchoLog                        = 1,
	Header                         = 2,
	EGFxMissionLogMissionItemType_MAX = 3
};


// Enum OakGame.EGFxMissionLogFilterType
enum class EGFxMissionLogFilterType : uint8_t
{
	None                           = 0,
	MissionLogMissionType          = 1,
	MissionLogByExpansion          = 2,
	MissionLogByRegion             = 3,
	EGFxMissionLogFilterType_MAX   = 4
};


// Enum OakGame.EGFxMissionLogNavType
enum class EGFxMissionLogNavType : uint8_t
{
	None                           = 0,
	Missions                       = 1,
	EchoLog                        = 2,
	TyphonLog                      = 3,
	EridianLog                     = 4,
	EGFxMissionLogNavType_MAX      = 5
};


// Enum OakGame.EGFxMissionLogMissionIconType
enum class EGFxMissionLogMissionIconType : uint8_t
{
	Normal                         = 0,
	Plot                           = 1,
	Side                           = 2,
	Contract                       = 3,
	EchoLog                        = 4,
	EridianWriting                 = 5,
	TyphonLog                      = 6,
	Complete                       = 7,
	Ignored                        = 8,
	Failed                         = 9,
	HardMission                    = 10,
	EGFxMissionLogMissionIconType_MAX = 11
};


// Enum OakGame.EGFxMissionTrackerAnimationType
enum class EGFxMissionTrackerAnimationType : uint8_t
{
	None                           = 0,
	Active                         = 1,
	SlideIn                        = 2,
	SlideInChecked                 = 3,
	SlideOut                       = 4,
	SlideInFromAbove               = 5,
	SlideInFromAboveChecked        = 6,
	SlideInFromBelow               = 7,
	SlideInFromBelowChecked        = 8,
	Checked                        = 9,
	CheckedFailed                  = 10,
	Failed                         = 11,
	SlideOutFailed                 = 12,
	EGFxMissionTrackerAnimationType_MAX = 13
};


// Enum OakGame.ETargetedNameplateState
enum class ETargetedNameplateState : uint8_t
{
	NotShowingTarget_Linger        = 0,
	NotShowingTarget               = 1,
	ShowingValidTarget             = 2,
	ShowingDyingTarget             = 3,
	ETargetedNameplateState_MAX    = 4
};


// Enum OakGame.ENameplateStyle
enum class ENameplateStyle : uint8_t
{
	Targeted                       = 0,
	BossBar                        = 1,
	Overhead                       = 2,
	ENameplateStyle_MAX            = 3
};


// Enum OakGame.EDLCMenuItemUsability
enum class EDLCMenuItemUsability : uint8_t
{
	None                           = 0,
	CanUse                         = 1,
	AlreadyStarted                 = 2,
	RequiresMissionProgress        = 3,
	NotInstalled                   = 4,
	NotLicensed                    = 5,
	EDLCMenuItemUsability_MAX      = 6
};


// Enum OakGame.EOverheadNameplateDisplayState
enum class EOverheadNameplateDisplayState : uint8_t
{
	None                           = 0,
	CenteredName_Name              = 1,
	CenteredName_Arrow             = 2,
	State_Name                     = 3,
	State_Arrow                    = 4,
	EOverheadNameplateDisplayState_MAX = 5
};


// Enum OakGame.EOverheadNameplateHealthState
enum class EOverheadNameplateHealthState : uint8_t
{
	Healthy                        = 0,
	Dying                          = 1,
	BeingRevived                   = 2,
	Respawning                     = 3,
	EOverheadNameplateHealthState_MAX = 4
};


// Enum OakGame.EPetCommandWidgetState
enum class EPetCommandWidgetState : uint8_t
{
	Off                            = 0,
	Ready                          = 1,
	Unlocked                       = 2,
	Activated                      = 3,
	BeginCooldown                  = 4,
	CoolingDown                    = 5,
	NowReady                       = 6,
	CantUse                        = 7,
	Initalization                  = 8,
	EPetCommandWidgetState_MAX     = 9
};


// Enum OakGame.EGFxPlayerStorageMenuItemAction
enum class EGFxPlayerStorageMenuItemAction : uint8_t
{
	None                           = 0,
	MoveToBank                     = 1,
	MoveToInventory                = 2,
	Inspect                        = 3,
	EGFxPlayerStorageMenuItemAction_MAX = 4
};


// Enum OakGame.EGFxPlayerStorageMenuState
enum class EGFxPlayerStorageMenuState : uint8_t
{
	None                           = 0,
	BankRetrieve                   = 1,
	BackpackDeposit                = 2,
	CompareBankFocused             = 3,
	CompareBackpackFocused         = 4,
	EGFxPlayerStorageMenuState_MAX = 5
};


// Enum OakGame.EQuickChangeMenuSortMode
enum class EQuickChangeMenuSortMode : uint8_t
{
	Rarity                         = 0,
	Alphabetic                     = 1,
	NewToOld                       = 2,
	EQuickChangeMenuSortMode_MAX   = 3
};


// Enum OakGame.EBaseQuickChangeChoiceType
enum class EBaseQuickChangeChoiceType : uint8_t
{
	Skin                           = 0,
	Head                           = 1,
	Body                           = 2,
	Emote                          = 3,
	Color                          = 4,
	ECHOSkin                       = 5,
	Respec                         = 6,
	WeaponSkin                     = 7,
	WeaponTrinket                  = 8,
	EBaseQuickChangeChoiceType_MAX = 9
};


// Enum OakGame.EBaseQuickChangeMenuState
enum class EBaseQuickChangeMenuState : uint8_t
{
	CategorySelection              = 0,
	BodySelection                  = 1,
	HeadSelection                  = 2,
	SkinSelection                  = 3,
	ColorSelection                 = 4,
	EmoteSelection                 = 5,
	ECHOSelection                  = 6,
	Respec                         = 7,
	TrinketIcon                    = 8,
	WeaponSkinIcon                 = 9,
	DecorationIcon                 = 10,
	None                           = 11,
	MAX                            = 12
};


// Enum OakGame.EReloadWidgetDisplayState
enum class EReloadWidgetDisplayState : uint8_t
{
	Default                        = 0,
	AmmoLow                        = 1,
	NoSpareAmmo                    = 2,
	NoAmmoAtAll                    = 3,
	EReloadWidgetDisplayState_MAX  = 4
};


// Enum OakGame.GFxSHiFT
enum class EGFxSHiFT : uint8_t
{
	None                           = 0,
	NotSignedIn                    = 1,
	SignInAccount                  = 2,
	CreateAccount                  = 3,
	ResetPassword                  = 4,
	CodeRedemption                 = 5,
	RewardHistory                  = 6,
	Offline                        = 7,
	GFxSHiFT_MAX                   = 8
};


// Enum OakGame.ESirenSkillScreenSlotType
enum class ESirenSkillScreenSlotType : uint8_t
{
	None                           = 0,
	ComboAbility                   = 1,
	ComboEffect                    = 2,
	ComboElement                   = 3,
	Passive                        = 4,
	ESirenSkillScreenSlotType_MAX  = 5
};


// Enum OakGame.ESkillItemActionState
enum class ESkillItemActionState : uint8_t
{
	None                           = 0,
	CanEquipPrimary                = 1,
	CanEquipSecondary              = 2,
	CanEquipBoth                   = 3,
	BlockedByTutorial              = 4,
	NoPointsToSpend                = 5,
	Unlock                         = 6,
	AddPoint                       = 7,
	Maxed                          = 8,
	NotEnoughBranchPoints          = 9,
	RequiresTreeUnlock             = 10,
	RequiresOtherSkill             = 11,
	ESkillItemActionState_MAX      = 12
};


// Enum OakGame.ESkillItemUnlockAnimState
enum class ESkillItemUnlockAnimState : uint8_t
{
	Uninitialized                  = 0,
	Unplayed                       = 1,
	Played                         = 2,
	ESkillItemUnlockAnimState_MAX  = 3
};


// Enum OakGame.ESkillScreenItemPurchaseState
enum class ESkillScreenItemPurchaseState : uint8_t
{
	CannotPurchase                 = 0,
	FirstPoint                     = 1,
	AddPoints                      = 2,
	MaxPoints                      = 3,
	ESkillScreenItemPurchaseState_MAX = 4
};


// Enum OakGame.ESkillScreenReceiveHighlightState
enum class ESkillScreenReceiveHighlightState : uint8_t
{
	Off                            = 0,
	Available                      = 1,
	Active                         = 2,
	ESkillScreenReceiveHighlightState_MAX = 3
};


// Enum OakGame.ESkillScreenLoadoutSlotClearability
enum class ESkillScreenLoadoutSlotClearability : uint8_t
{
	CannotClear_Error              = 0,
	CannotClear_SlotEmpty          = 1,
	CannotClear_SlotMustBeFilled   = 2,
	CannotClear_AbilityInUse       = 3,
	CanClear                       = 4,
	ESkillScreenLoadoutSlotClearability_MAX = 5
};


// Enum OakGame.EGFxSkillScreenLoadoutChoiceEquipState
enum class EGFxSkillScreenLoadoutChoiceEquipState : uint8_t
{
	Locked                         = 0,
	Available                      = 1,
	Equipped                       = 2,
	EGFxSkillScreenLoadoutChoiceEquipState_MAX = 3
};


// Enum OakGame.EGFxSkillScreenState
enum class EGFxSkillScreenState : uint8_t
{
	None                           = 0,
	BranchesFocused                = 1,
	LoadoutEdit                    = 2,
	PlayingUnlockAnim              = 3,
	TreeLocked_Info                = 4,
	TreeLocked_Branches            = 5,
	DraggingSkillItem              = 6,
	EGFxSkillScreenState_MAX       = 7
};


// Enum OakGame.ESkillScreenSlotType
enum class ESkillScreenSlotType : uint8_t
{
	None                           = 0,
	Compatible                     = 1,
	All                            = 2,
	ESkillScreenSlotType_MAX       = 3
};


// Enum OakGame.EGFxStatusMenuTransitionReason
enum class EGFxStatusMenuTransitionReason : uint8_t
{
	None                           = 0,
	Pushed                         = 1,
	NextPage                       = 2,
	PrevPage                       = 3,
	Switched                       = 4,
	Popped                         = 5,
	EGFxStatusMenuTransitionReason_MAX = 6
};


// Enum OakGame.EGFxStoreMenuTabType
enum class EGFxStoreMenuTabType : uint8_t
{
	Empty                          = 0,
	Featured                       = 1,
	Expansions                     = 2,
	Customizations                 = 3,
	Purchased                      = 4,
	EGFxStoreMenuTabType_MAX       = 5
};


// Enum OakGame.ESubtitleLayoutType
enum class ESubtitleLayoutType : uint8_t
{
	None                           = 0,
	SubtitlesOnly                  = 1,
	ClosedCaptionsOnly             = 2,
	Both                           = 3,
	ESubtitleLayoutType_MAX        = 4
};


// Enum OakGame.EGbxGFxSpinnerWidgetGoToMethod
enum class EGbxGFxSpinnerWidgetGoToMethod : uint8_t
{
	FromCurrent                    = 0,
	Immediately                    = 1,
	EGbxGFxSpinnerWidgetGoToMethod_MAX = 2
};


// Enum OakGame.EGFxVaultHunterProfileCardView
enum class EGFxVaultHunterProfileCardView : uint8_t
{
	Skill                          = 0,
	Inventory                      = 1,
	Stat                           = 2,
	EGFxVaultHunterProfileCardView_MAX = 3
};


// Enum OakGame.EGFxVaultHunterProfileCardMode
enum class EGFxVaultHunterProfileCardMode : uint8_t
{
	Unknown                        = 0,
	Friend                         = 1,
	Self                           = 2,
	EGFxVaultHunterProfileCardMode_MAX = 3
};


// Enum OakGame.EGFxVehiclePartWidgetState
enum class EGFxVehiclePartWidgetState : uint8_t
{
	On                             = 0,
	Off                            = 1,
	RollOn                         = 2,
	RollOff                        = 3,
	Condensed                      = 4,
	TurnIn                         = 5,
	EGFxVehiclePartWidgetState_MAX = 6
};


// Enum OakGame.UGFxVehiclePartUnlockedWidgetState
enum class EUGFxVehiclePartUnlockedWidgetState : uint8_t
{
	Off                            = 0,
	Playing                        = 1,
	UGFxVehiclePartUnlockedWidgetState_MAX = 2
};


// Enum OakGame.EGFxVehicleWeaponType
enum class EGFxVehicleWeaponType : uint8_t
{
	CHARGE                         = 0,
	MAGAZINE                       = 1,
	HEAT                           = 2,
	RECOVERY                       = 3,
	EGFxVehicleWeaponType_MAX      = 4
};


// Enum OakGame.EGFxVendingMachineMenuBackpackState
enum class EGFxVendingMachineMenuBackpackState : uint8_t
{
	Unknown                        = 0,
	Buy                            = 1,
	Sell                           = 2,
	Compare                        = 3,
	CompareToMachine               = 4,
	EGFxVendingMachineMenuBackpackState_MAX = 5
};


// Enum OakGame.EVendingMachineSocketMapStates
enum class EVendingMachineSocketMapStates : uint8_t
{
	SOCKETMAP_BUY                  = 0,
	SOCKETMAP_SELL                 = 1,
	SOCKETMAP_COMPARE              = 2,
	SOCKETMAP_VENDINGCOMPARE       = 3,
	SOCKETMAP_MAX                  = 4
};


// Enum OakGame.GFxVendingMachineDisplayMode
enum class EGFxVendingMachineDisplayMode : uint8_t
{
	GFXVENDOR_Buy                  = 0,
	GFXVENDOR_Sell                 = 1,
	GFXVENDOR_Buyback              = 2,
	GFXVENDOR_END                  = 3,
	GFXVENDOR_MAX                  = 4
};


// Enum OakGame.EGoreRegionType
enum class EGoreRegionType : uint8_t
{
	Head                           = 0,
	Arm                            = 1,
	Leg                            = 2,
	Torso                          = 3,
	EGoreRegionType_MAX            = 4
};


// Enum OakGame.EChildPayloadType
enum class EChildPayloadType : uint8_t
{
	Payload_Divider                = 0,
	Payload_MiniMirv               = 1,
	Payload_Mirv                   = 2,
	Payload_Rain                   = 3,
	Payload_Spring                 = 4,
	Payload_Sticky                 = 5,
	Payload_MAX                    = 6
};


// Enum OakGame.ELingeringDamageStyle
enum class ELingeringDamageStyle : uint8_t
{
	DamageStyle_Burst              = 0,
	DamageStyle_Beam               = 1,
	DamageStyle_Radius             = 2,
	DamageStyle_MAX                = 3
};


// Enum OakGame.EInstanceDataOperator
enum class EInstanceDataOperator : uint8_t
{
	Add                            = 0,
	Multiply                       = 1,
	EInstanceDataOperator_MAX      = 2
};


// Enum OakGame.ESpinDirection
enum class ESpinDirection : uint8_t
{
	SD_NoSpin                      = 0,
	SD_Clockwise                   = 1,
	SD_Counterclockwise            = 2,
	SD_MAX                         = 3
};


// Enum OakGame.EHolsteredGearState
enum class EHolsteredGearState : uint8_t
{
	None                           = 0,
	FadingIn                       = 1,
	FadingOut                      = 2,
	EHolsteredGearState_MAX        = 3
};


// Enum OakGame.EInWorldIconFadeType
enum class EInWorldIconFadeType : uint8_t
{
	None                           = 0,
	Distance                       = 1,
	TargetedRadius                 = 2,
	EInWorldIconFadeType_MAX       = 3
};


// Enum OakGame.EInWorldIconClassType
enum class EInWorldIconClassType : uint8_t
{
	Icon                           = 0,
	Nameplate                      = 1,
	EInWorldIconClassType_MAX      = 2
};


// Enum OakGame.EInWorldIconEdgeBehavior
enum class EInWorldIconEdgeBehavior : uint8_t
{
	Clamp                          = 0,
	Hide                           = 1,
	EInWorldIconEdgeBehavior_MAX   = 2
};


// Enum OakGame.ELootSpawnTiming
enum class ELootSpawnTiming : uint8_t
{
	OnEnabled                      = 0,
	OnEnabling                     = 1,
	OnAnimNotify                   = 2,
	ELootSpawnTiming_MAX           = 3
};


// Enum OakGame.EMissionDrivenLootableType
enum class EMissionDrivenLootableType : uint8_t
{
	None                           = 0,
	CopyPickupMissionObjective     = 1,
	UseSelfMissionObjective        = 2,
	EMissionDrivenLootableType_MAX = 3
};


// Enum OakGame.ELootableOpenReason
enum class ELootableOpenReason : uint8_t
{
	Use                            = 0,
	Damage                         = 1,
	ELootableOpenReason_MAX        = 2
};


// Enum OakGame.EDebugMatchmakingFailure
enum class EDebugMatchmakingFailure : uint8_t
{
	None                           = 0,
	CreateMatchmakingSession       = 1,
	JoinMatchmakingSession         = 2,
	FindMatchmakingSession         = 3,
	FindGameplaySession            = 4,
	JoinGameplaySession            = 5,
	InitClientMatchmakingBeacon    = 6,
	CreateHostMatchmakingBeacon    = 7,
	EDebugMatchmakingFailure_MAX   = 8
};


// Enum OakGame.EMatchmakingError
enum class EMatchmakingError : uint8_t
{
	None                           = 0,
	StartHostingFailed             = 1,
	StartMatchmakingRoundFailed    = 2,
	StartMatchmakingSearchFailed   = 3,
	CreateClientMatchmakingBeaconFailed = 4,
	SearchFailed                   = 5,
	JoinGameFailed                 = 6,
	RateLimit                      = 7,
	NetworkFailure                 = 8,
	ClientCriticalFailure          = 9,
	UpdateSessionFailed            = 10,
	StartGameplayFailed            = 11,
	SplitscreenJoinFailure         = 12,
	SplitscreenLeaveFailure        = 13,
	NoPlaylistContentAvailable     = 14,
	EMatchmakingError_MAX          = 15
};


// Enum OakGame.EMatchmakingRequirementComparisonOp
enum class EMatchmakingRequirementComparisonOp : uint8_t
{
	None                           = 0,
	Equal                          = 1,
	NotEqual                       = 2,
	LessThan                       = 3,
	GreaterThan                    = 4,
	EMatchmakingRequirementComparisonOp_MAX = 5
};


// Enum OakGame.EMatchmakingRequirementType
enum class EMatchmakingRequirementType : uint8_t
{
	None                           = 0,
	PlayerLevel                    = 1,
	PlotMission                    = 2,
	DlcInstalled                   = 3,
	EMatchmakingRequirementType_MAX = 4
};


// Enum OakGame.EMatchmakingSearchParameterOp
enum class EMatchmakingSearchParameterOp : uint8_t
{
	Invalid                        = 0,
	Equals                         = 1,
	NotEquals                      = 2,
	GreaterThan                    = 3,
	GreaterThanEquals              = 4,
	LessThan                       = 5,
	LessThanEquals                 = 6,
	Max                            = 7
};


// Enum OakGame.EInitialPlayerStatus
enum class EInitialPlayerStatus : uint8_t
{
	NotSelected                    = 0,
	Selected                       = 1,
	EInitialPlayerStatus_MAX       = 2
};


// Enum OakGame.EOakAbilityTimerResult
enum class EOakAbilityTimerResult : uint8_t
{
	Pulsed                         = 0,
	Finished                       = 1,
	Stopped                        = 2,
	Replaced                       = 3,
	EOakAbilityTimerResult_MAX     = 4
};


// Enum OakGame.EOakAbilityTimerTickPolicy
enum class EOakAbilityTimerTickPolicy : uint8_t
{
	AlwaysTick                     = 0,
	OnlyWhenActive                 = 1,
	EOakAbilityTimerTickPolicy_MAX = 2
};


// Enum OakGame.EOakAbilityTimerReplacePolicy
enum class EOakAbilityTimerReplacePolicy : uint8_t
{
	KeepExisting                   = 0,
	ReplaceExisting                = 1,
	EOakAbilityTimerReplacePolicy_MAX = 2
};


// Enum OakGame.ESkillWidgetSlot
enum class ESkillWidgetSlot : uint8_t
{
	None                           = 0,
	ActionSkillWidget              = 1,
	GrenadeActionSkillWidget       = 2,
	ESkillWidgetSlot_MAX           = 3
};


// Enum OakGame.EOakAchievements
enum class EOakAchievements : uint8_t
{
	Invalid                        = 0,
	ReachLevel2                    = 1,
	ReachLevel10                   = 2,
	ReachLevel25                   = 3,
	ReachLevel50                   = 4,
	UnlockHeadsSkins               = 5,
	UnlockVehicleParts             = 6,
	UsePhotoMode                   = 7,
	WinDuel                        = 8,
	ReviveAnotherPlayer            = 9,
	SendItemToFriend               = 10,
	WinLiveGrenadeSlotMachine      = 11,
	PerfectScoreFiringRange        = 12,
	CrazyEarl                      = 13,
	EridianSlabs                   = 14,
	CompleteAllCircleOfSlaughter   = 15,
	DiscoverAllPandoraLocations    = 16,
	DiscoverAllEden6Locations      = 17,
	DiscoverAllPrometheaLocations  = 18,
	DiscoverAllNekrotaphayoLocations = 19,
	DiscoverAllNamedLocations      = 20,
	CompleteSomeSideMissions       = 21,
	CompleteAllSideMissions        = 22,
	ClearAllProvingGrounds         = 23,
	DefeatAllLegendaryHunts        = 24,
	DefeatAllTargetsOfOpportunity  = 25,
	KillEnemyWithExplodingBarrel   = 26,
	KillEnemyWithGunBlade          = 27,
	KillMultipleEnemiesWithStickyGrenade = 28,
	EquipPurpleGear                = 29,
	LoyaltyPackage                 = 30,
	CompleteMission1               = 31,
	CompleteMission2               = 32,
	CompleteMission3               = 33,
	CompleteMission4               = 34,
	CompleteMission5               = 35,
	CompleteMission6               = 36,
	CompleteMission7               = 37,
	CompleteMission8               = 38,
	CompleteMission9               = 39,
	CompleteMission10              = 40,
	CompleteMission11              = 41,
	Suicide                        = 42,
	GoldenKey                      = 43,
	VaultRewards                   = 44,
	CompleteAllAchievements        = 45,
	DLC1_CompleteMissionVIP        = 46,
	DLC1_EmberChallenges           = 47,
	DLC1_MayorChallenges           = 48,
	DLC1_TorgueChallenges          = 49,
	DLC1_Blackjack                 = 50,
	DLC1_Clapstructor              = 51,
	DLC1_DebtCollector             = 52,
	DLC2_CompleteMission1          = 53,
	DLC2_CompleteFinalMission      = 54,
	DLC2_KillWendigo               = 55,
	DLC2_DeathrapKill              = 56,
	DLC2_CrewChallenges            = 57,
	DLC2_CollectECHO               = 58,
	DLC2_RareSpawns                = 59,
	DLC2_FishJokes                 = 60,
	DLC3_CompleteAllAchievements   = 61,
	DLC3_CrewChallenges            = 62,
	DLC3_CompleteSideMissions      = 63,
	DLC3_CompleteMission1          = 64,
	DLC3_CompleteMission2          = 65,
	DLC3_CompleteMission3          = 66,
	DLC3_CompleteMission4          = 67,
	DLC3_CompleteFinalMission      = 68,
	DLC4_CompleteMission1          = 69,
	DLC4_DefeatDarkLilith          = 70,
	DLC4_DestroyTheTrain           = 71,
	DLC4_KillBenedict              = 72,
	DLC4_DefeatPsychodin           = 73,
	DLC4_OpenAllGates              = 74,
	DLC4_SidesAndChallenges        = 75,
	DLC5_WinShootingSpreeRound     = 76,
	DLC5_Extract100PiecesOfGear    = 77,
	DLC5_ExploreEntireWhiteout     = 78,
	DLC6_SolveAllMysteries         = 79,
	DLC6_DefeatHemovorous          = 80,
	DLC6_DestroyMysteriousEridium  = 81,
	EOakAchievements_MAX           = 82
};


// Enum OakGame.EOakAnimActionAbilityEndAction
enum class EOakAnimActionAbilityEndAction : uint8_t
{
	None                           = 0,
	Stop                           = 1,
	Abort                          = 2,
	AbortReset                     = 3,
	EOakAnimActionAbilityEndAction_MAX = 4
};


// Enum OakGame.EHostileAttachState
enum class EHostileAttachState : uint8_t
{
	Loop                           = 0,
	Attack                         = 1,
	GripFeedback                   = 2,
	GetDown                        = 3,
	Ejected                        = 4,
	Completed                      = 5,
	EHostileAttachState_MAX        = 6
};


// Enum OakGame.ELeapOnVehicle_SeatType
enum class ELeapOnVehicle_SeatType : uint8_t
{
	SpecifiedSlot                  = 0,
	Driver                         = 1,
	Gunner                         = 2,
	Passenger                      = 3,
	Hostile                        = 4,
	ELeapOnVehicle_MAX             = 5
};


// Enum OakGame.EOakActionAbilitySecondaryUseActionType
enum class EOakActionAbilitySecondaryUseActionType : uint8_t
{
	None                           = 0,
	Primary                        = 1,
	Secondary                      = 2,
	EOakActionAbilitySecondaryUseActionType_MAX = 3
};


// Enum OakGame.EOakActionAbilityStopAction
enum class EOakActionAbilityStopAction : uint8_t
{
	Normal                         = 0,
	Expidited                      = 1,
	Abort                          = 2,
	EOakActionAbilityStopAction_MAX = 3
};


// Enum OakGame.ECloneSwapReason
enum class ECloneSwapReason : uint8_t
{
	Manual                         = 0,
	NewU                           = 1,
	ECloneSwapReason_MAX           = 2
};


// Enum OakGame.EOakActionAbilityPetModType
enum class EOakActionAbilityPetModType : uint8_t
{
	None                           = 0,
	Mod1                           = 1,
	Mod2                           = 2,
	Mod3                           = 3,
	Mod4                           = 4,
	Mod5                           = 5,
	EOakActionAbilityPetModType_MAX = 6
};


// Enum OakGame.EOakActionAbilityPetEvolutionType
enum class EOakActionAbilityPetEvolutionType : uint8_t
{
	None                           = 0,
	Evolution1                     = 1,
	Evolution2                     = 2,
	EOakActionAbilityPetEvolutionType_MAX = 3
};


// Enum OakGame.EOakActionAbilityPetType
enum class EOakActionAbilityPetType : uint8_t
{
	None                           = 0,
	Spiderant                      = 1,
	Jabbermon                      = 2,
	Skag                           = 3,
	Loader                         = 4,
	EOakActionAbilityPetType_MAX   = 5
};


// Enum OakGame.EPhaseTranceEffectTargetType
enum class EPhaseTranceEffectTargetType : uint8_t
{
	Actor                          = 0,
	Location                       = 1,
	EPhaseTranceEffectTargetType_MAX = 2
};


// Enum OakGame.EPhaseTranceElementalType
enum class EPhaseTranceElementalType : uint8_t
{
	None                           = 0,
	Element1                       = 1,
	Element2                       = 2,
	Element3                       = 3,
	Element4                       = 4,
	EPhaseTranceElementalType_MAX  = 5
};


// Enum OakGame.EPhaseTranceEffectType
enum class EPhaseTranceEffectType : uint8_t
{
	None                           = 0,
	Effect1                        = 1,
	Effect2                        = 2,
	Effect3                        = 3,
	Effect4                        = 4,
	Effect5                        = 5,
	Effect6                        = 6,
	EPhaseTranceEffectType_MAX     = 7
};


// Enum OakGame.EPhaseTranceAttackFamilyType
enum class EPhaseTranceAttackFamilyType : uint8_t
{
	None                           = 0,
	AttackFamily1                  = 1,
	AttackFamily2                  = 2,
	AttackFamily3                  = 3,
	AttackFamily4                  = 4,
	EPhaseTranceAttackFamilyType_MAX = 5
};


// Enum OakGame.EOperativeBarrierModType
enum class EOperativeBarrierModType : uint8_t
{
	Mod1                           = 0,
	Mod2                           = 1,
	Mod3                           = 2,
	Mod4                           = 3,
	Mod5                           = 4,
	Mod6                           = 5,
	EOperativeBarrierModType_MAX   = 6
};


// Enum OakGame.EDigiCloneModType
enum class EDigiCloneModType : uint8_t
{
	Mod1                           = 0,
	Mod2                           = 1,
	Mod3                           = 2,
	Mod4                           = 3,
	Mod5                           = 4,
	Mod6                           = 5,
	Mod7                           = 6,
	Mod8                           = 7,
	Mod9                           = 8,
	EDigiCloneModType_MAX          = 9
};


// Enum OakGame.EGRMLNModType
enum class EGRMLNModType : uint8_t
{
	Mod1                           = 0,
	Mod2                           = 1,
	Mod3                           = 2,
	Mod4                           = 3,
	Mod5                           = 4,
	Mod6                           = 5,
	EGRMLNModType_MAX              = 6
};


// Enum OakGame.EIronBearUIHardpointType
enum class EIronBearUIHardpointType : uint8_t
{
	GRENADE_LAUNCHER               = 0,
	MINIGUN                        = 1,
	BEARFIST                       = 2,
	FALCON_STRIKE                  = 3,
	SALAMANDER_THROWER             = 4,
	BUBBLE_SHIELD                  = 5,
	RAILGUN                        = 6,
	EIronBearUIHardpointType_MAX   = 7
};


// Enum OakGame.EIronBearModType
enum class EIronBearModType : uint8_t
{
	None                           = 0,
	Mod1                           = 1,
	Mod2                           = 2,
	Mod3                           = 3,
	EIronBearModType_MAX           = 4
};


// Enum OakGame.EOakAISwarmRotation
enum class EOakAISwarmRotation : uint8_t
{
	None                           = 0,
	Strafe                         = 1,
	Forward                        = 2,
	EOakAISwarmRotation_MAX        = 3
};


// Enum OakGame.ECARRestrictionType
enum class ECARRestrictionType : uint8_t
{
	Default                        = 0,
	DLC3                           = 1,
	ECARRestrictionType_MAX        = 2
};


// Enum OakGame.ECARPartType
enum class ECARPartType : uint8_t
{
	Wheel                          = 0,
	Armor                          = 1,
	CoreMod                        = 2,
	GunnerWeapon                   = 3,
	DriverWeapon                   = 4,
	Ornament                       = 5,
	MaterialDecal                  = 6,
	Material                       = 7,
	None                           = 8,
	ECARPartType_MAX               = 9
};


// Enum OakGame.EChallengRewardFormattingType
enum class EChallengRewardFormattingType : uint8_t
{
	Cash                           = 0,
	Eridium                        = 1,
	Other                          = 2,
	EChallengRewardFormattingType_MAX = 3
};


// Enum OakGame.ECameraAttachState
enum class ECameraAttachState : uint8_t
{
	CAS_Dettached                  = 0,
	CAS_Attached                   = 1,
	CAS_MAX                        = 2
};


// Enum OakGame.EVehicleArchetype
enum class EVehicleArchetype : uint8_t
{
	Null                           = 0,
	Technical                      = 1,
	Outrunner                      = 2,
	Revolver                       = 3,
	Emperor                        = 4,
	EVehicleArchetype_MAX          = 5
};


// Enum OakGame.ECinematicState
enum class ECinematicState : uint8_t
{
	Inactive                       = 0,
	PlayingIntro                   = 1,
	PlayingSequence                = 2,
	ECinematicState_MAX            = 3
};


// Enum OakGame.EOakMayhemModeConditionType
enum class EOakMayhemModeConditionType : uint8_t
{
	IsMayhemModeActive             = 0,
	CompareMayhemLevel             = 1,
	EOakMayhemModeConditionType_MAX = 2
};


// Enum OakGame.EHealthTypeState
enum class EHealthTypeState : uint8_t
{
	Normal                         = 0,
	Low                            = 1,
	VeryLow                        = 2,
	Depleted                       = 3,
	EHealthTypeState_MAX           = 4
};


// Enum OakGame.EDamageInstigatorClassification
enum class EDamageInstigatorClassification : uint8_t
{
	Other                          = 0,
	PlayerVersusPlayer             = 1,
	PlayerVersusAI                 = 2,
	AIVersusPlayer                 = 3,
	EDamageInstigatorClassification_MAX = 4
};


// Enum OakGame.EOakElementalDeathEffects
enum class EOakElementalDeathEffects : uint8_t
{
	Default                        = 0,
	Custom                         = 1,
	Disabled                       = 2,
	EOakElementalDeathEffects_MAX  = 3
};


// Enum OakGame.EUIDialogCallout
enum class EUIDialogCallout : uint8_t
{
	OutOfGrenades                  = 0,
	EquipAskillFailed              = 1,
	EquipItemFailed                = 2,
	RemoveItemFailed               = 3,
	InsufficientFunds              = 4,
	EUIDialogCallout_MAX           = 5
};


// Enum OakGame.EGRMLNHardpointType
enum class EGRMLNHardpointType : uint8_t
{
	None                           = 0,
	MachineGun                     = 1,
	Mod4                           = 2,
	EGRMLNHardpointType_MAX        = 3
};


// Enum OakGame.EOakDroneFacingMode
enum class EOakDroneFacingMode : uint8_t
{
	None                           = 0,
	FaceMoveDir                    = 1,
	FaceTarget                     = 2,
	FaceMovementTarget             = 3,
	EOakDroneFacingMode_MAX        = 4
};


// Enum OakGame.EOakDroneMovementMode
enum class EOakDroneMovementMode : uint8_t
{
	Projectile                     = 0,
	FlyToTarget                    = 1,
	HoverAtTarget                  = 2,
	HoverAtOwner                   = 3,
	EOakDroneMovementMode_MAX      = 4
};


// Enum OakGame.EOakElementalStackBucketType
enum class EOakElementalStackBucketType : uint8_t
{
	Unknown                        = 0,
	Character                      = 1,
	Weapon                         = 2,
	Grenade                        = 3,
	InteractiveObject              = 4,
	ElementalInteraction           = 5,
	EOakElementalStackBucketType_MAX = 6
};


// Enum OakGame.EInviteType
enum class EInviteType : uint8_t
{
	Public                         = 0,
	InviteOnly                     = 1,
	FriendsOnly                    = 2,
	EInviteType_MAX                = 3
};


// Enum OakGame.EFriendSyncState
enum class EFriendSyncState : uint8_t
{
	Disabled                       = 0,
	Enabled                        = 1,
	EFriendSyncState_MAX           = 2
};


// Enum OakGame.ECrossplayState
enum class ECrossplayState : uint8_t
{
	Disabled                       = 0,
	Enabled                        = 1,
	ECrossplayState_MAX            = 2
};


// Enum OakGame.ENetworkType
enum class ENetworkType : uint8_t
{
	Offline                        = 0,
	Lan                            = 1,
	Online                         = 2,
	ENetworkType_MAX               = 3
};


// Enum OakGame.EPlayerInputLockType
enum class EPlayerInputLockType : uint8_t
{
	None                           = 0,
	All                            = 1,
	Movement                       = 2,
	Looking                        = 3,
	Jumping                        = 4,
	Weapon                         = 5,
	EPlayerInputLockType_MAX       = 6
};


// Enum OakGame.EActivityCompletionFriendEventType
enum class EActivityCompletionFriendEventType : uint8_t
{
	RaidCompletion                 = 0,
	CircleOfSlaughterCompletion    = 1,
	ProvingGroundsCompletion       = 2,
	EActivityCompletionFriendEventType_MAX = 3
};


// Enum OakGame.EBenchmarkDataOutputMode
enum class EBenchmarkDataOutputMode : uint8_t
{
	None                           = 0,
	Summary                        = 1,
	DetailedCSV                    = 2,
	EBenchmarkDataOutputMode_MAX   = 3
};


// Enum OakGame.EAmbientOcclusionQuality
enum class EAmbientOcclusionQuality : uint8_t
{
	Off                            = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	Ultra                          = 4,
	EAmbientOcclusionQuality_MAX   = 5
};


// Enum OakGame.ECharacterDetail
enum class ECharacterDetail : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	ECharacterDetail_MAX           = 4
};


// Enum OakGame.ECharacterTextureDetail
enum class ECharacterTextureDetail : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	Deprecated                     = 4,
	ECharacterTextureDetail_MAX    = 5
};


// Enum OakGame.EScreenSpaceReflections
enum class EScreenSpaceReflections : uint8_t
{
	Off                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EScreenSpaceReflections_MAX    = 4
};


// Enum OakGame.EVolumetricFogType
enum class EVolumetricFogType : uint8_t
{
	Off                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EVolumetricFogType_MAX         = 4
};


// Enum OakGame.EFoliageDensity
enum class EFoliageDensity : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EFoliageDensity_MAX            = 4
};


// Enum OakGame.ETerrainType
enum class ETerrainType : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	ETerrainType_MAX               = 4
};


// Enum OakGame.EEnvironmentDetail
enum class EEnvironmentDetail : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EEnvironmentDetail_MAX         = 4
};


// Enum OakGame.EDrawDistance
enum class EDrawDistance : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EDrawDistance_MAX              = 4
};


// Enum OakGame.EEnvironmentTextureDetail
enum class EEnvironmentTextureDetail : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	Deprecated                     = 4,
	EEnvironmentTextureDetail_MAX  = 5
};


// Enum OakGame.EShadowQuality
enum class EShadowQuality : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EShadowQuality_MAX             = 4
};


// Enum OakGame.EAnisotropicFilteringType
enum class EAnisotropicFilteringType : uint8_t
{
	Trilinear                      = 0,
	TwoX                           = 1,
	FourX                          = 2,
	EightX                         = 3,
	SixteenX                       = 4,
	EAnisotropicFilteringType_MAX  = 5
};


// Enum OakGame.EMaterialQuality
enum class EMaterialQuality : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EMaterialQuality_MAX           = 4
};


// Enum OakGame.ETextureStreamingQuality
enum class ETextureStreamingQuality : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	ETextureStreamingQuality_MAX   = 4
};


// Enum OakGame.EGraphicsQuality
enum class EGraphicsQuality : uint8_t
{
	VeryLow                        = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	Ultra                          = 4,
	Badass                         = 5,
	Undefined                      = 6,
	EGraphicsQuality_MAX           = 7
};


// Enum OakGame.EFrameRateLimit
enum class EFrameRateLimit : uint8_t
{
	Smooth22_62FPS                 = 0,
	Capped30FPS                    = 1,
	Capped60FPS                    = 2,
	Capped120FPS                   = 3,
	Unlimited                      = 4,
	Custom                         = 5,
	EFrameRateLimit_MAX            = 6
};


// Enum OakGame.EResolutionScale
enum class EResolutionScale : uint8_t
{
	Scale                          = 0,
	Scale01                        = 1,
	Scale02                        = 2,
	Scale03                        = 3,
	Scale04                        = 4,
	Scale05                        = 5,
	Scale06                        = 6,
	Scale_MAX                      = 7
};


// Enum OakGame.ESupportedAspectRatios
enum class ESupportedAspectRatios : uint8_t
{
	AspectRatio_16                 = 0,
	AspectRatio_1601               = 1,
	AspectRatio_32                 = 2,
	AspectRatio_21                 = 3,
	AspectRatio_Unsupported        = 4,
	AspectRatio_MAX                = 5
};


// Enum OakGame.EHUDType
enum class EHUDType : uint8_t
{
	NoHUD                          = 0,
	StandardPlayerHUD              = 1,
	VehicleHUD                     = 2,
	IronbearHUD                    = 3,
	EHUDType_MAX                   = 4
};


// Enum OakGame.EOakInputActionEventType
enum class EOakInputActionEventType : uint8_t
{
	None                           = 0,
	Button                         = 1,
	Axis                           = 2,
	EOakInputActionEventType_MAX   = 3
};


// Enum OakGame.EPickupFlyToSettingsType
enum class EPickupFlyToSettingsType : uint8_t
{
	Dropped                        = 0,
	Container                      = 1,
	AutoLootContainer              = 2,
	EPickupFlyToSettingsType_MAX   = 3
};


// Enum OakGame.EOakInventoryItemFlags
enum class EOakInventoryItemFlags : uint8_t
{
	HasBeenSeenInInventoryMenu     = 0,
	MarkedAsFavorite               = 1,
	MarkedAsJunk                   = 2,
	EOakInventoryItemFlags_MAX     = 3
};


// Enum OakGame.EOakInventoryMenuPaperDollSlotAdjacency
enum class EOakInventoryMenuPaperDollSlotAdjacency : uint8_t
{
	Mid                            = 0,
	Left                           = 1,
	Right                          = 2,
	EOakInventoryMenuPaperDollSlotAdjacency_MAX = 3
};


// Enum OakGame.EOakInventoryMenuAmmoState
enum class EOakInventoryMenuAmmoState : uint8_t
{
	Default                        = 0,
	Highlighted                    = 1,
	HighlightedEmpty               = 2,
	Low                            = 3,
	Empty                          = 4,
	Full                           = 5,
	EOakInventoryMenuAmmoState_MAX = 6
};


// Enum OakGame.EOakInventoryMenuWhatChanged
enum class EOakInventoryMenuWhatChanged : uint8_t
{
	Initial                        = 0,
	RefreshAll                     = 1,
	SortChanged                    = 2,
	AddedItem                      = 3,
	RemovedItem                    = 4,
	UnequippedItem                 = 5,
	EquippedItem                   = 6,
	EOakInventoryMenuWhatChanged_MAX = 7
};


// Enum OakGame.EOakInventoryMenuSortMode
enum class EOakInventoryMenuSortMode : uint8_t
{
	NewestFirst                    = 0,
	Type                           = 1,
	Level                          = 2,
	Manufacturer                   = 3,
	Rarity                         = 4,
	EOakInventoryMenuSortMode_MAX  = 5
};


// Enum OakGame.EOakInventoryItemWidgetSelectType
enum class EOakInventoryItemWidgetSelectType : uint8_t
{
	Normal                         = 0,
	HideWhenSelected               = 1,
	PopoutSelection                = 2,
	EOakInventoryItemWidgetSelectType_MAX = 3
};


// Enum OakGame.EOakInventoryItemWidgetDisabledReason
enum class EOakInventoryItemWidgetDisabledReason : uint8_t
{
	NotDisabled                    = 0,
	SlotLocked                     = 1,
	BrowsingAnotherPanel           = 2,
	CantEquipInSlot                = 3,
	EOakInventoryItemWidgetDisabledReason_MAX = 4
};


// Enum OakGame.EOakStatusMenuInventoryEvent
enum class EOakStatusMenuInventoryEvent : uint8_t
{
	PaperDollItemHighlighted       = 0,
	BackpackItemHighlighted        = 1,
	BackpackHighlighted            = 2,
	PaperDollHighlighted           = 3,
	EOakStatusMenuInventoryEvent_MAX = 4
};


// Enum OakGame.EOakInventoryRarityBalanceTableType
enum class EOakInventoryRarityBalanceTableType : uint8_t
{
	Weapon                         = 0,
	EOakInventoryRarityBalanceTableType_MAX = 1
};


// Enum OakGame.EMailItemType
enum class EMailItemType : uint8_t
{
	None                           = 0,
	GearboxMail                    = 1,
	PlayerMail                     = 2,
	StreamerMail                   = 3,
	NPCMail                        = 4,
	DownloadableEntitlement        = 5,
	EMailItemType_MAX              = 6
};


// Enum OakGame.EReapOrder
enum class EReapOrder : uint8_t
{
	OldestFirst                    = 0,
	NewestFirst                    = 1,
	Random                         = 2,
	EReapOrder_MAX                 = 3
};


// Enum OakGame.EOakManufacturerBalanceTableType
enum class EOakManufacturerBalanceTableType : uint8_t
{
	Weapon                         = 0,
	EOakManufacturerBalanceTableType_MAX = 1
};


// Enum OakGame.EOakMinimapIconComponentType
enum class EOakMinimapIconComponentType : uint8_t
{
	Manual                         = 0,
	TargetingComponentDriven       = 1,
	WhileAlive                     = 2,
	EOakMinimapIconComponentType_MAX = 3
};


// Enum OakGame.EOakMissionType
enum class EOakMissionType : uint8_t
{
	Default                        = 0,
	Plot                           = 1,
	Side                           = 2,
	ProvingGrounds                 = 3,
	CircleOfSlaughter              = 4,
	Raid                           = 5,
	RareSpawn                      = 6,
	Count                          = 7,
	EOakMissionType_MAX            = 8
};


// Enum OakGame.EOakMusicLayer
enum class EOakMusicLayer : uint8_t
{
	Aux                            = 0,
	Bass                           = 1,
	Chord                          = 2,
	Melody                         = 3,
	Perc_Kick                      = 4,
	Perc_Large                     = 5,
	Perc_Small                     = 6,
	MAX                            = 7
};


// Enum OakGame.EOakMusicPart
enum class EOakMusicPart : uint8_t
{
	Part_None                      = 0,
	Part                           = 1,
	Part01                         = 2,
	Part02                         = 3,
	Part03                         = 4,
	Part04                         = 5,
	Part05                         = 6,
	Part06                         = 7,
	Part07                         = 8,
	Part08                         = 9,
	Part09                         = 10,
	Part10                         = 11,
	Part11                         = 12,
	Part12                         = 13,
	Part13                         = 14,
	Part14                         = 15,
	Part15                         = 16,
	Part16                         = 17,
	Part17                         = 18,
	Part18                         = 19,
	Part19                         = 20,
	Part_SparseAmbiance            = 21,
	Part_MAX                       = 22
};


// Enum OakGame.EOakMusicSection
enum class EOakMusicSection : uint8_t
{
	Section_None                   = 0,
	Section                        = 1,
	Section01                      = 2,
	Section02                      = 3,
	Section03                      = 4,
	Section04                      = 5,
	Section05                      = 6,
	Section06                      = 7,
	Section07                      = 8,
	Section08                      = 9,
	Section09                      = 10,
	Section_MAX                    = 11
};


// Enum OakGame.EDrivingOverridePriority
enum class EDrivingOverridePriority : uint8_t
{
	AINode                         = 0,
	Aspect                         = 1,
	Scripted                       = 2,
	Count                          = 3,
	Invalid                        = 4,
	EDrivingOverridePriority_MAX   = 5
};


// Enum OakGame.ESpeedModifierOverridePriority
enum class ESpeedModifierOverridePriority : uint8_t
{
	AINode                         = 0,
	Aspect                         = 1,
	Scripted                       = 2,
	Escort                         = 3,
	UserEdge                       = 4,
	Count                          = 5,
	Invalid                        = 6,
	ESpeedModifierOverridePriority_MAX = 7
};


// Enum OakGame.EOakOnlineLobbyTalkingState
enum class EOakOnlineLobbyTalkingState : uint8_t
{
	NotTalking                     = 0,
	Talking                        = 1,
	Muted                          = 2,
	EOakOnlineLobbyTalkingState_MAX = 3
};


// Enum OakGame.EOakOnlineLobbyPlayerPlateState
enum class EOakOnlineLobbyPlayerPlateState : uint8_t
{
	Offline                        = 0,
	WaitingForPlayers              = 1,
	Invite                         = 2,
	SplitPlayerToJoin              = 3,
	PlayerListed                   = 4,
	EOakOnlineLobbyPlayerPlateState_MAX = 5
};


// Enum OakGame.EOakOnlineLobbyConnectivityState
enum class EOakOnlineLobbyConnectivityState : uint8_t
{
	Unknown                        = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	None                           = 4,
	EOakOnlineLobbyConnectivityState_MAX = 5
};


// Enum OakGame.EOakPassiveAbilityHUDIconActivationType
enum class EOakPassiveAbilityHUDIconActivationType : uint8_t
{
	TriggeredEffect                = 0,
	StatusEffect                   = 1,
	AbilityTimer                   = 2,
	Manual                         = 3,
	ActiveState                    = 4,
	EOakPassiveAbilityHUDIconActivationType_MAX = 5
};


// Enum OakGame.EAdditionalTriggeredEffectTargets
enum class EAdditionalTriggeredEffectTargets : uint8_t
{
	None                           = 0,
	MyCompanions                   = 1,
	MyAllies                       = 2,
	EAdditionalTriggeredEffectTargets_MAX = 3
};


// Enum OakGame.EOakPassiveAbilitySirenArmDurationType
enum class EOakPassiveAbilitySirenArmDurationType : uint8_t
{
	None                           = 0,
	AbilityState                   = 1,
	AbilityTimer                   = 2,
	StatusEffect                   = 3,
	EOakPassiveAbilitySirenArmDurationType_MAX = 4
};


// Enum OakGame.ESkillItemRealType
enum class ESkillItemRealType : uint8_t
{
	None                           = 0,
	PlayerAbility                  = 1,
	Augment                        = 2,
	AugmentSlot                    = 3,
	CharacterAugment               = 4,
	ESkillItemRealType_MAX         = 5
};


// Enum OakGame.ESkillItemDisplayType
enum class ESkillItemDisplayType : uint8_t
{
	None                           = 0,
	ActionSkill                    = 1,
	ModPrimary                     = 2,
	ModSecondary                   = 3,
	Passive                        = 4,
	ClassAbility                   = 5,
	ESkillItemDisplayType_MAX      = 6
};


// Enum OakGame.ESkillItemLayoutInfo
enum class ESkillItemLayoutInfo : uint8_t
{
	Left                           = 0,
	Center                         = 1,
	Right                          = 2,
	LeftWing                       = 3,
	RightWing                      = 4,
	ESkillItemLayoutInfo_MAX       = 5
};


// Enum OakGame.EScreenCalibrationMode
enum class EScreenCalibrationMode : uint8_t
{
	Off                            = 0,
	HDRBrightness                  = 1,
	StandardBrightnessAndBlackLevel = 2,
	EScreenCalibrationMode_MAX     = 3
};


// Enum OakGame.EJoystickScheme
enum class EJoystickScheme : uint8_t
{
	Classic                        = 0,
	SouthPaw                       = 1,
	OldSchool                      = 2,
	OldSchool_Southpaw             = 3,
	Count                          = 4,
	EJoystickScheme_MAX            = 5
};


// Enum OakGame.EDrivingButtonScheme
enum class EDrivingButtonScheme : uint8_t
{
	Classic                        = 0,
	CameraRelative                 = 1,
	VehicleRelative                = 2,
	VehicleRelativeStick           = 3,
	Count                          = 4,
	EDrivingButtonScheme_MAX       = 5
};


// Enum OakGame.EWalkingButtonScheme
enum class EWalkingButtonScheme : uint8_t
{
	Default                        = 0,
	Classic                        = 1,
	Count                          = 2,
	EWalkingButtonScheme_MAX       = 3
};


// Enum OakGame.EGameJoinNotificationState
enum class EGameJoinNotificationState : uint8_t
{
	EGJNS_None                     = 0,
	EGJNS_PlayerStateReplicated    = 1,
	EGJNS_SyncLevelReplicated      = 2,
	EGJNS_PlayerNotified           = 3,
	EGJNS_MAX                      = 4
};


// Enum OakGame.EPresentableStatusEffectValueStrategy
enum class EPresentableStatusEffectValueStrategy : uint8_t
{
	PercentOfMaxHealth             = 0,
	InstanceCount                  = 1,
	EPresentableStatusEffectValueStrategy_MAX = 2
};


// Enum OakGame.ERadiateMovementType
enum class ERadiateMovementType : uint8_t
{
	FollowInitialDirection         = 0,
	SimpleMoveOnGround             = 1,
	ERadiateMovementType_MAX       = 2
};


// Enum OakGame.ERadiateMethod
enum class ERadiateMethod : uint8_t
{
	Velocity                       = 0,
	MinMaxDistance                 = 1,
	ERadiateMethod_MAX             = 2
};


// Enum OakGame.EClassRepNodeMapping
enum class EClassRepNodeMapping : uint8_t
{
	NotRouted                      = 0,
	RelevantForConnections         = 1,
	Spatialize_Static              = 2,
	Spatialize_Dynamic             = 3,
	Spatialize_Dormancy            = 4,
	EClassRepNodeMapping_MAX       = 5
};


// Enum OakGame.EEventTriggerType
enum class EEventTriggerType : uint8_t
{
	StreamingEvent_DirectorTriggered = 0,
	StreamingEvent_WorldTriggered  = 1,
	StreamingEvent_ViewerTriggered = 2,
	StreamingEvent_MAX             = 3
};


// Enum OakGame.EStreamingInteractionEventState
enum class EStreamingInteractionEventState : uint8_t
{
	StreamingEvent_Disabled        = 0,
	StreamingEvent_Preliminary     = 1,
	StreamingEvent_Standby         = 2,
	StreamingEvent_Active          = 3,
	StreamingEvent_MAX             = 4
};


// Enum OakGame.ECharacterProfileUpdateStep
enum class ECharacterProfileUpdateStep : uint8_t
{
	Step_MainCharacterInfo         = 0,
	Step_MainCharacterInfo2        = 1,
	Step_Inventory                 = 2,
	Step_MAX                       = 3
};


// Enum OakGame.EStreamingManagerState
enum class EStreamingManagerState : uint8_t
{
	StreamingManager_Off           = 0,
	StreamingManager_Initialized   = 1,
	StreamingManager_Active        = 2,
	StreamingManager_Paused        = 3,
	StreamingManager_MAX           = 4
};


// Enum OakGame.EEndEventReasons
enum class EEndEventReasons : uint8_t
{
	Unknown                        = 0,
	Success                        = 1,
	NoParticipants                 = 2,
	Timeout                        = 3,
	Error                          = 4,
	Win                            = 5,
	Draw                           = 6,
	Lose                           = 7,
	MapExited                      = 8,
	EEndEventReasons_MAX           = 9
};


// Enum OakGame.EOakTriggerComponentEventType
enum class EOakTriggerComponentEventType : uint8_t
{
	Touch                          = 0,
	UnTouch                        = 1,
	EOakTriggerComponentEventType_MAX = 2
};


// Enum OakGame.EOakUIChallengeDataProviderPopulateType
enum class EOakUIChallengeDataProviderPopulateType : uint8_t
{
	UNKNOWN                        = 0,
	Galaxy                         = 1,
	Planet                         = 2,
	Level                          = 3,
	EOakUIChallengeDataProviderPopulateType_MAX = 4
};


// Enum OakGame.EVehicleInputMode
enum class EVehicleInputMode : uint8_t
{
	CameraRelative_Classic         = 0,
	CameraRelative_ThirdPerson     = 1,
	VehicleRelative_LeftSide       = 2,
	VehicleRelative_StickOnly      = 3,
	Count                          = 4,
	EVehicleInputMode_MAX          = 5
};


// Enum OakGame.EVehiclePropertyValueType
enum class EVehiclePropertyValueType : uint8_t
{
	Speed_KPH                      = 0,
	PlanarSpeed_KPH                = 1,
	ForwardSpeed_KPH               = 2,
	Speed_MPH                      = 3,
	PlanarSpeed_MPH                = 4,
	ForwardSpeed_MPH               = 5,
	Mass                           = 6,
	IsPlayerDriven                 = 7,
	IsAIDriven                     = 8,
	EVehiclePropertyValueType_MAX  = 9
};


// Enum OakGame.EVoGDisplayState
enum class EVoGDisplayState : uint8_t
{
	None                           = 0,
	Inactive                       = 1,
	FadingIn                       = 2,
	Displayed                      = 3,
	FadingOut                      = 4,
	EVoGDisplayState_MAX           = 5
};


// Enum OakGame.EOakWeaponPartType
enum class EOakWeaponPartType : uint8_t
{
	Grip                           = 0,
	Foregrip                       = 1,
	Mag                            = 2,
	Mode                           = 3,
	ModeSwitch                     = 4,
	Barrel                         = 5,
	Scope                          = 6,
	Reload                         = 7,
	Melee                          = 8,
	Bolt                           = 9,
	Trigger                        = 10,
	Hammer                         = 11,
	CustomA                        = 12,
	CustomB                        = 13,
	EOakWeaponPartType_MAX         = 14
};


// Enum OakGame.VehicleWeapons
enum class EVehicleWeapons : uint8_t
{
	Technical_BarrelLauncher       = 0,
	Technical_StickyBombs          = 1,
	Technical_TireBombs            = 2,
	Outrunner_HeavyMissile         = 3,
	Outrunner_SwarmerMissile       = 4,
	Outrunner_ShotgunMissile       = 5,
	Emperor_Entropy                = 6,
	Emperor_Hellfire               = 7,
	Outrunner_FlameThrower         = 8,
	Outrunner_TeslaCoil            = 9,
	Technical_MachineGun           = 10,
	Technical_FlakCannon           = 11,
	Revolver_SpikeLauncher         = 12,
	Revolver_SawBladeLauncher      = 13,
	Revolver_GrenadeLauncher       = 14,
	Emperor_PulseRifle             = 15,
	Emperor_BouncingLaser          = 16,
	VehicleWeapons_MAX             = 17
};


// Enum OakGame.EWeaponAudioBodyLoopState
enum class EWeaponAudioBodyLoopState : uint8_t
{
	Active                         = 0,
	Equipping                      = 1,
	Reloading                      = 2,
	Invalid                        = 3,
	EWeaponAudioBodyLoopState_MAX  = 4
};


// Enum OakGame.EWeaponAudioBodyLoopType
enum class EWeaponAudioBodyLoopType : uint8_t
{
	PlayerOnly                     = 0,
	BothPlayersAndNPCs             = 1,
	NPCOnly                        = 2,
	EWeaponAudioBodyLoopType_MAX   = 3
};


// Enum OakGame.EOnlineMessageAnimationEnum
enum class EOnlineMessageAnimationEnum : uint8_t
{
	NONE                           = 0,
	EXIT_ANIMATION                 = 1,
	INTRO_ANIMATION                = 2,
	EOnlineMessageAnimationEnum_MAX = 3
};


// Enum OakGame.EOperativeBarrierState
enum class EOperativeBarrierState : uint8_t
{
	Activating                     = 0,
	Carried                        = 1,
	Deployed                       = 2,
	ShuttingDown                   = 3,
	EOperativeBarrierState_MAX     = 4
};


// Enum OakGame.EOptionType
enum class EOptionType : uint8_t
{
	Option_TODO                    = 0,
	Option_Title                   = 1,
	Option_Keybinding              = 2,
	Gameplay_InvertMapPitchControls = 3,
	Gameplay_InvertMapYawControls  = 4,
	Audio_MasterVolume             = 5,
	Audio_MusicVolume              = 6,
	Audio_SoundEffectVolume        = 7,
	Audio_VoiceVolume              = 8,
	Audio_SoundMode                = 9,
	Audio_PlayerCallouts           = 10,
	Audio_MuteAudioOnFocusLost     = 11,
	Audio_ControllerAudio          = 12,
	Audio_PushToTalk               = 13,
	Audio_VoiceChatVolume          = 14,
	Audio_EnableMicrosoftSpatial_Available = 15,
	Audio_EnableMicrosoftSpatial_Unavailable = 16,
	Gameplay_ResetTutorials        = 17,
	Gameplay_IndividualDifficulty  = 18,
	Gameplay_EnableTrainingMessages = 19,
	Gameplay_MPHOrKPH              = 20,
	Gameplay_CenterCrosshair       = 21,
	Gameplay_FixedMinimapRotation  = 22,
	Gameplay_CensorGore            = 23,
	Gameplay_MinimapLegendaries    = 24,
	Network_NetworkConnection      = 25,
	Network_CrossplayState         = 26,
	Network_FriendSync             = 27,
	Network_MatchmakingRegion      = 28,
	Network_HideTextChat           = 29,
	Network_TradeRequest           = 30,
	Network_PlayerToasts           = 31,
	Network_ToastsDuration         = 32,
	Network_StreamingService       = 33,
	Network_IncreasedSubscribersChance = 34,
	Network_RareChestEventEnabled  = 35,
	Network_BadassEventEnabled     = 36,
	Network_BadassEventCooldown    = 37,
	Network_PinataEventEnabled     = 38,
	Network_MoxxisDrinkEventEnabled = 39,
	Network_MoxxisDrinkEventBitsProductId = 40,
	Network_ExtractionEventEnabled = 41,
	Graphics_WindowMode            = 42,
	Graphics_Resolutions           = 43,
	Graphics_VSync                 = 44,
	Graphics_FieldOfView           = 45,
	Graphics_EnableMotionBlur      = 46,
	Graphics_TargetDisplay         = 47,
	Graphics_GraphicsMode          = 48,
	Graphics_CalibrateSafeArea     = 49,
	Graphics_CalibrateDisplay      = 50,
	Graphics_VehicleFieldOfView    = 51,
	Graphics_FramerateLimiter      = 52,
	Graphics_EnableCAS             = 53,
	Graphics_PreferredAPI          = 54,
	Graphics_AspectRatio           = 55,
	Graphics_RefreshRate           = 56,
	Graphics_FramerateLimitCustom  = 57,
	Graphics_ResolutionScale       = 58,
	Graphics_HUDScaleMultiplier    = 59,
	Graphics_SplitScreenConfig     = 60,
	AdvancedGraphics_GraphicsQuality = 61,
	AdvancedGraphics_AntialiasingMode = 62,
	AdvancedGraphics_AnisotropicFiltering = 63,
	AdvancedGraphics_DisplayPerformanceStats = 64,
	AdvancedGraphics_TextureDetail = 65,
	AdvancedGraphics_DrawDistance  = 66,
	AdvancedGraphics_Clutter       = 67,
	AdvancedGraphics_Tessellation  = 68,
	AdvancedGraphics_Foliage       = 69,
	AdvancedGraphics_VolumetricFog = 70,
	AdvancedGraphics_ScreenSpaceReflections = 71,
	AdvancedGraphics_CharacterTextureDetail = 72,
	AdvancedGraphics_CharacterDetail = 73,
	AdvancedGraphics_ShadowQuality = 74,
	AdvancedGraphics_AmbientOcclusionQuality = 75,
	AdvancedGraphics_CameraMotionBlur = 76,
	AdvancedGraphics_ObjectMotionBlur = 77,
	AdvancedGraphics_TextureStreaming = 78,
	AdvancedGraphics_MaterialQuality = 79,
	AdvancedGraphics_SystemInfo    = 80,
	Benchmark_Run                  = 81,
	Benchmark_Type                 = 82,
	Benchmark_DataOutput           = 83,
	Benchmark_Results              = 84,
	Benchmark_Uncapped             = 85,
	Benchmark_ResultPhase          = 86,
	Benchmark_ResultMeasurementType = 87,
	Benchmark_ResultDateTime       = 88,
	Benchmark_ResultFPS            = 89,
	Benchmark_ResultFrameTime      = 90,
	Benchmark_ResultLoadTime       = 91,
	Benchmark_ResultDataOutputPath = 92,
	Benchmark_ResultDetails0       = 93,
	Benchmark_ResultDetails1       = 94,
	Benchmark_ResultDetails2       = 95,
	Benchmark_ResultDetails3       = 96,
	Benchmark_ResultDetails4       = 97,
	Controls_MouseInvertLook       = 98,
	Controls_MouseSmoothing        = 99,
	Controls_LookSensitivity       = 100,
	Controls_MouseWeaponZoomSensitivity = 101,
	Controls_MouseVehicleSpensitivity = 102,
	Controls_GamepadInvertVerticalLook = 103,
	Controls_GamepadInvertHorizontalLook = 104,
	Controls_GamepadLookSensitivity = 105,
	Controls_GamepadWeaponZoomSensitivity = 106,
	Controls_GamepadVehicleSensitivity = 107,
	Controls_Vibration             = 108,
	Controls_TriggerFeedback       = 109,
	Controls_GamepadInvertMapVerticalLook = 110,
	Controls_GamepadInvertMapHorizontalLook = 111,
	Controls_MouseAcceleration     = 112,
	Controls_EnableGamepad         = 113,
	Controls_GamepadAimingInputStyle = 114,
	Controls_InvertIronBearHardpoints = 115,
	Controls_GlyphMode             = 116,
	Controls_AllowWindowsKey       = 117,
	ControlsAdvanced_InvertForwardMovement = 118,
	ControlsAdvanced_InvertStrafeMovement = 119,
	ControlsAdvanced_LeftDeadZoneCenter = 120,
	ControlsAdvanced_LeftDeadZoneOuter = 121,
	ControlsAdvanced_LeftAxialDeadZone = 122,
	ControlsAdvanced_RightDeadZoneCenter = 123,
	ControlsAdvanced_RightDeadZoneOuter = 124,
	ControlsAdvanced_RightAxialDeadZone = 125,
	Bindings_Move                  = 126,
	Bindings_Look                  = 127,
	Bindings_PCMoveForward         = 128,
	Bindings_PCMoveBackward        = 129,
	Bindings_PCStrafeLeft          = 130,
	Bindings_PCStrafeRight         = 131,
	Bindings_Jump                  = 132,
	Bindings_Crouch                = 133,
	Bindings_Sprint                = 134,
	Bindings_Fire                  = 135,
	Bindings_Reload                = 136,
	Bindings_Melee                 = 137,
	Bindings_ActionSkill           = 138,
	Bindings_GrenadeActionSkill2   = 139,
	Bindings_NextWeapon            = 140,
	Bindings_PrevWeapon            = 141,
	Bindings_NextWeaponCycleModeUseAlt = 142,
	Bindings_SelectWeapon1         = 143,
	Bindings_SelectWeapon2         = 144,
	Bindings_SelectWeapon3         = 145,
	Bindings_SelectWeapon4         = 146,
	Bindings_DropWeapon            = 147,
	Bindings_SecondaryUseQuickMenu = 148,
	Bindings_UseGiveUp             = 149,
	Bindings_UseGiveUpReload       = 150,
	Bindings_WeaponToggle          = 151,
	Bindings_Zoom                  = 152,
	Bindings_Emote1                = 153,
	Bindings_Emote2                = 154,
	Bindings_Emote3                = 155,
	Bindings_Emote4                = 156,
	Bindings_UnrebindableButton    = 157,
	Bindings_Vehicle_SteerForward  = 158,
	Bindings_Vehicle_SteerBackward = 159,
	Bindings_Vehicle_WeaponPrimary = 160,
	Bindings_Vehicle               = 161,
	ControlSchemes_Driving         = 162,
	ControlSchemes_DrivingJoystick = 163,
	ControlSchemes_Walking         = 164,
	ControlSchemes_WalkingJoystick = 165,
	Accessibility_CrosshairFriendlyColor = 166,
	Accessibility_CrosshairNeutralColor = 167,
	Accessibility_CrosshairHostileColor = 168,
	Accessibility_Subtitles        = 169,
	Accessibility_ClosedCaptioning = 170,
	Accessibility_CCTextSize       = 171,
	Accessibility_CCBackgroundOpacity = 172,
	Accessibility_AimAssist        = 173,
	Accessibility_GamepadAimAssist = 174,
	Accessibility_ZoomSnap         = 175,
	Accessibility_GamepadZoomSnap  = 176,
	Accessibility_MouseZoomSnap    = 177,
	Accessibility_WeaponZoom       = 178,
	Accessibility_AutoCenter       = 179,
	Accessibility_HeadBobScale     = 180,
	Accessibility_Sprint           = 181,
	Accessibility_Crouch           = 182,
	Accessibility_MantleStyle      = 183,
	Accessibility_MovementRecenters = 184,
	Accessibility_ShowDamageNumberElementalIcons = 185,
	EOptionType_MAX                = 186
};


// Enum OakGame.EOptionItemType
enum class EOptionItemType : uint8_t
{
	Title                          = 0,
	Slider                         = 1,
	Spinner                        = 2,
	BooleanSpinner                 = 3,
	Button                         = 4,
	Controls                       = 5,
	Keybinding_Button              = 6,
	KeyBinding_Axis                = 7,
	TodoItem                       = 8,
	DropDownList                   = 9,
	EOptionItemType_MAX            = 10
};


// Enum OakGame.EEchoPerformanceMode
enum class EEchoPerformanceMode : uint8_t
{
	EchoCommunication              = 0,
	EchoLog                        = 1,
	VoG                            = 2,
	EridianWriting                 = 3,
	EEchoPerformanceMode_MAX       = 4
};


// Enum OakGame.EPhotoModeOptionEffect
enum class EPhotoModeOptionEffect : uint8_t
{
	None                           = 0,
	FieldOfView                    = 1,
	CameraRoll                     = 2,
	Target                         = 3,
	FocusDistance                  = 4,
	FocusRegion                    = 5,
	DOFIntensity                   = 6,
	Contrast                       = 7,
	Saturation                     = 8,
	Gamma                          = 9,
	Gain                           = 10,
	TimeOfDay                      = 11,
	HideCharacters                 = 12,
	FilmGrain                      = 13,
	Filter                         = 14,
	FilterIntensity                = 15,
	VignetteIntensity              = 16,
	VignetteFeathering             = 17,
	HideDamageNumbers              = 18,
	OverrideDOF                    = 19,
	Border                         = 20,
	Tag                            = 21,
	EPhotoModeOptionEffect_MAX     = 22
};


// Enum OakGame.EEchoDeviceFXPositionMode
enum class EEchoDeviceFXPositionMode : uint8_t
{
	None                           = 0,
	UIObject                       = 1,
	ViewportPosition               = 2,
	EEchoDeviceFXPositionMode_MAX  = 3
};


// Enum OakGame.ETransactionType
enum class ETransactionType : uint8_t
{
	Buy                            = 0,
	Sell                           = 1,
	BuyBack                        = 2,
	SellAllJunk                    = 3,
	PurchaseCustomization          = 4,
	ETransactionType_MAX           = 5
};


// Enum OakGame.EPlayerStandInType
enum class EPlayerStandInType : uint8_t
{
	Unspecified                    = 0,
	FrontendLobby                  = 1,
	CharacterSelect                = 2,
	CharacterCreate                = 3,
	SkillScreen                    = 4,
	RnRCharacterSelect             = 5,
	EPlayerStandInType_MAX         = 6
};


// Enum OakGame.EFrontendStandInSpecialAnimType
enum class EFrontendStandInSpecialAnimType : uint8_t
{
	PlayerArrival                  = 0,
	PrimaryPlayerFlourish          = 1,
	CharacterSelectSelection       = 2,
	CharacterSelectSelection_NoActionSkill = 3,
	CharacterCreationSelection     = 4,
	MAX                            = 5
};


// Enum OakGame.EPlayerTradingStance
enum class EPlayerTradingStance : uint8_t
{
	Deciding                       = 0,
	TradeReady                     = 1,
	DuelReady                      = 2,
	Disconnected                   = 3,
	EPlayerTradingStance_MAX       = 4
};


// Enum OakGame.EPlayerTradeManagerStatus
enum class EPlayerTradeManagerStatus : uint8_t
{
	Uninitialized                  = 0,
	Trading                        = 1,
	Dueling                        = 2,
	ResolvingTrade                 = 3,
	ResolvingDuel                  = 4,
	EPlayerTradeManagerStatus_MAX  = 5
};


// Enum OakGame.EPlayThroughType
enum class EPlayThroughType : uint8_t
{
	CurrentPlayThrough             = 0,
	EffectivePlayThrough           = 1,
	EPlayThroughType_MAX           = 2
};


// Enum OakGame.EProjectedMeshShape
enum class EProjectedMeshShape : uint8_t
{
	Circle                         = 0,
	Square                         = 1,
	EProjectedMeshShape_MAX        = 2
};


// Enum OakGame.EShieldState
enum class EShieldState : uint8_t
{
	Uninitialized                  = 0,
	Empty                          = 1,
	PartiallyFilled                = 2,
	Filled                         = 3,
	EShieldState_MAX               = 4
};


// Enum OakGame.EShieldAttributeModificationSource
enum class EShieldAttributeModificationSource : uint8_t
{
	Other                          = 0,
	Equipped                       = 1,
	Filled                         = 2,
	Depleted                       = 3,
	NotDepleted                    = 4,
	EShieldAttributeModificationSource_MAX = 5
};


// Enum OakGame.EStackOperator
enum class EStackOperator : uint8_t
{
	Add                            = 0,
	Multiply                       = 1,
	EStackOperator_MAX             = 2
};


// Enum OakGame.EShieldDamageModifierApplicationTarget
enum class EShieldDamageModifierApplicationTarget : uint8_t
{
	InstigatorCausedDamage         = 0,
	InstigatorReceivedDamage       = 1,
	EShieldDamageModifierApplicationTarget_MAX = 2
};


// Enum OakGame.EAugmentTriggerOn
enum class EAugmentTriggerOn : uint8_t
{
	TriggerOn_Filled               = 0,
	TriggerOn_NotFilled            = 1,
	TriggerOn_Depleted             = 2,
	TriggerOn_NotDepleted          = 3,
	TriggerOn_MAX                  = 4
};


// Enum OakGame.ESirenGhostArmConfigurationType
enum class ESirenGhostArmConfigurationType : uint8_t
{
	None                           = 0,
	FirstPerson                    = 1,
	ThirdPerson                    = 2,
	FirstAndThirdPerson            = 3,
	GhostArmsLocked                = 4,
	ESirenGhostArmConfigurationType_MAX = 5
};


// Enum OakGame.EItemDropOnDeathType
enum class EItemDropOnDeathType : uint8_t
{
	DropOnDeath_All                = 0,
	DropOnDeath_FirstDeath         = 1,
	DropOnDeath_LastDeath          = 2,
	DropOnDeath_RandomDeath        = 3,
	DropOnDeath_MAX                = 4
};


// Enum OakGame.ELootInstancingPolicy
enum class ELootInstancingPolicy : uint8_t
{
	Instance                       = 0,
	DontInstance                   = 1,
	InstanceForPlayer              = 2,
	ELootInstancingPolicy_MAX      = 3
};


// Enum OakGame.ESpawnDroppedPickupLootRequestType
enum class ESpawnDroppedPickupLootRequestType : uint8_t
{
	Drop                           = 0,
	Attach                         = 1,
	ESpawnDroppedPickupLootRequestType_MAX = 2
};


// Enum OakGame.EStandInAutoScaleMode
enum class EStandInAutoScaleMode : uint8_t
{
	None                           = 0,
	ScaleDown                      = 1,
	ScaleUpOrDown                  = 2,
	EStandInAutoScaleMode_MAX      = 3
};


// Enum OakGame.EStandInActorType
enum class EStandInActorType : uint8_t
{
	None                           = 0,
	Player                         = 1,
	PlayerSkillScreen              = 2,
	WeaponSkin                     = 3,
	WeaponTrinket                  = 4,
	CrewQuartersDecoration         = 5,
	CustomActor                    = 6,
	EStandInActorType_MAX          = 7
};


// Enum OakGame.EBehaviorOutput
enum class EBehaviorOutput : uint8_t
{
	Found                          = 0,
	NotFound                       = 1,
	EBehaviorOutput_MAX            = 2
};


// Enum OakGame.ETinkPileUseState
enum class ETinkPileUseState : uint8_t
{
	None                           = 0,
	NotUsed                        = 1,
	InUse                          = 2,
	WasUsed                        = 3,
	Resetting                      = 4,
	ETinkPileUseState_MAX          = 5
};


// Enum OakGame.ETinkPileBuildOption
enum class ETinkPileBuildOption : uint8_t
{
	None                           = 0,
	TurretBasic                    = 1,
	RocketPodBasic                 = 2,
	TurretPlaceholder1             = 3,
	TurretPlaceholder2             = 4,
	TurretPlaceholder3             = 5,
	TurretPlaceholder4             = 6,
	ETinkPileBuildOption_MAX       = 7
};


// Enum OakGame.ETransporterCraneState
enum class ETransporterCraneState : uint8_t
{
	Deactivated                    = 0,
	Stopped                        = 1,
	MoveForward                    = 2,
	MoveBackward                   = 3,
	ETransporterCraneState_MAX     = 4
};


// Enum OakGame.ETrophyCaseViewingState
enum class ETrophyCaseViewingState : uint8_t
{
	ViewingNone                    = 0,
	ViewingSet                     = 1,
	ViewingGroup                   = 2,
	ViewingTrophy                  = 3,
	ETrophyCaseViewingState_MAX    = 4
};


// Enum OakGame.EGroundTurretType
enum class EGroundTurretType : uint8_t
{
	Seated                         = 0,
	Standing                       = 1,
	EGroundTurretType_MAX          = 2
};


// Enum OakGame.EUIManagerState
enum class EUIManagerState : uint8_t
{
	NONE                           = 0,
	PLAYING_ANIMATION              = 1,
	EUIManagerState_MAX            = 2
};


// Enum OakGame.UIManagerMessages
enum class EUIManagerMessages : uint8_t
{
	Critical                       = 0,
	High                           = 1,
	Normal                         = 2,
	Low                            = 3,
	Lowest                         = 4,
	UIManagerMessages_MAX          = 5
};


// Enum OakGame.EChallengeCategoryID
enum class EChallengeCategoryID : uint8_t
{
	GameCompletion                 = 0,
	Enemy                          = 1,
	Weapon                         = 2,
	Crew                           = 3,
	Exploration                    = 4,
	Slaughter                      = 5,
	Raid                           = 6,
	ProvingGround                  = 7,
	Max                            = 8
};


// Enum OakGame.ERevolverOffsetMode
enum class ERevolverOffsetMode : uint8_t
{
	None                           = 0,
	Left                           = 1,
	Right                          = 2,
	ERevolverOffsetMode_MAX        = 3
};


// Enum OakGame.EWheelAudioType
enum class EWheelAudioType : uint8_t
{
	Standard                       = 0,
	MultiPosition2Wheels           = 1,
	MultiPosition1Wheel            = 2,
	SingleWheel                    = 3,
	EWheelAudioType_MAX            = 4
};


// Enum OakGame.EVehiclePlaySingleAnimMode
enum class EVehiclePlaySingleAnimMode : uint8_t
{
	PlayOnStart                    = 0,
	PlayOnStop                     = 1,
	EVehiclePlaySingleAnimMode_MAX = 2
};


// Enum OakGame.EEmitterEnableMode
enum class EEmitterEnableMode : uint8_t
{
	EnableOnStart                  = 0,
	EnableOnStartDisableOnStop     = 1,
	EnableOnStop                   = 2,
	DisableOnStart                 = 3,
	DisableOnStartEnableOnStop     = 4,
	DisableOnStop                  = 5,
	EEmitterEnableMode_MAX         = 6
};


// Enum OakGame.EFollowVehicleRotation
enum class EFollowVehicleRotation : uint8_t
{
	None                           = 0,
	Yaw                            = 1,
	YawAndPitch                    = 2,
	EFollowVehicleRotation_MAX     = 3
};


// Enum OakGame.EVendingMachineType
enum class EVendingMachineType : uint8_t
{
	Guns                           = 0,
	Ammo                           = 1,
	Health                         = 2,
	CrazyEarl                      = 3,
	EVendingMachineType_MAX        = 4
};


// Enum OakGame.VendingMachineDisplayMode
enum class EVendingMachineDisplayMode : uint8_t
{
	EVMDM_Buy                      = 0,
	EVMDM_Sell                     = 1,
	EVMDM_Buyback                  = 2,
	EVMDM_MAX                      = 3
};


// Enum OakGame.EVendingMachineTilesMode
enum class EVendingMachineTilesMode : uint8_t
{
	Purchase                       = 0,
	BuyBack                        = 1,
	Sell                           = 2,
	MAX                            = 3
};


// Enum OakGame.EVendingMachineInteractionMode
enum class EVendingMachineInteractionMode : uint8_t
{
	Purchase                       = 0,
	BuyBack                        = 1,
	Sell                           = 2,
	EVendingMachineInteractionMode_MAX = 3
};


// Enum OakGame.EVendingMachineAnimType
enum class EVendingMachineAnimType : uint8_t
{
	Idle                           = 0,
	Back                           = 1,
	BackTwice                      = 2,
	BackThrice                     = 3,
	BackJiggle                     = 4,
	Forward                        = 5,
	ForwardTwice                   = 6,
	ForwardThrice                  = 7,
	ForwardJiggle                  = 8,
	Purchase                       = 9,
	PurchaseInPlace                = 10,
	TurnOn                         = 11,
	TurnOff                        = 12,
	ErrorJiggle                    = 13,
	SlideInFromTop                 = 14,
	SlideInFromBottom              = 15,
	MAX                            = 16
};


// Enum OakGame.EVendingMachineTrayTileType
enum class EVendingMachineTrayTileType : uint8_t
{
	Regular                        = 0,
	Featured                       = 1,
	GearSoldByFriend               = 2,
	VisibleDummy                   = 3,
	EndOfListDummy                 = 4,
	EVendingMachineTrayTileType_MAX = 5
};


// Enum OakGame.EWeaponShieldActivationTrigger
enum class EWeaponShieldActivationTrigger : uint8_t
{
	Zoom                           = 0,
	Attach                         = 1,
	Custom                         = 2,
	EWeaponShieldActivationTrigger_MAX = 3
};


// Enum OakGame.EWeaponShieldState
enum class EWeaponShieldState : uint8_t
{
	Normal                         = 0,
	Depleted                       = 1,
	EWeaponShieldState_MAX         = 2
};


// Enum OakGame.EWeaponWearValueType
enum class EWeaponWearValueType : uint8_t
{
	Wear                           = 0,
	Rust                           = 1,
	Dirt                           = 2,
	EWeaponWearValueType_MAX       = 3
};


// Enum OakGame.EZoneMapTargetType
enum class EZoneMapTargetType : uint8_t
{
	None                           = 0,
	POI                            = 1,
	Player                         = 2,
	CrewChallenge                  = 3,
	MissionWaypoint                = 4,
	DeployedVehicle                = 5,
	EZoneMapTargetType_MAX         = 6
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct OakGame.SectorFromBP
// 0x0078
struct FSectorFromBP
{
	class USceneComponent*                             SectorRoot;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UStaticMeshComponent*                        FakeEmissiveWholeFloor;                                   // 0x0008(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWwiseAudioComponent*                        PropaneAudioComponent;                                    // 0x0010(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<class UStaticMeshComponent*>                HeatingElements;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor)
	TArray<class UStaticMeshComponent*>                FakeEmissives;                                            // 0x0028(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor)
	TArray<class UStaticMeshComponent*>                DamageZones;                                              // 0x0038(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor)
	TArray<class UParticleSystemComponent*>            Bursts;                                                   // 0x0048(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor)
	TArray<class UParticleSystemComponent*>            HeatHazes;                                                // 0x0058(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor)
	TArray<class UParticleSystemComponent*>            Anticipations;                                            // 0x0068(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor)
};

// ScriptStruct OakGame.Ring
// 0x0070
struct FRing
{
	unsigned char                                      UnknownData00[0x70];                                      // 0x0000(0x0070) MISSED OFFSET
};

// ScriptStruct OakGame.Sector
// 0x0068
struct FSector
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0000(0x0068) MISSED OFFSET
};

// ScriptStruct OakGame.WeaponSlotEntry
// 0x00F8
struct FWeaponSlotEntry
{
	class UWeaponSlotData*                             SlotData;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	class AWeapon*                                     AttachedWeapon;                                           // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	class AWeapon*                                     PendingAttachedWeapon;                                    // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	class AWeapon*                                     ClientPredictedPendingAttachedWeapon;                     // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	class UObject*                                     RestoreSlotData;                                          // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xB8];                                      // 0x0028(0x00B8) MISSED OFFSET
	struct FGameResourcePoolReference                  AccuracyPool;                                             // 0x00E0(0x0018)
};

// ScriptStruct OakGame.WeaponSlotContainer
// 0x05B8
struct FWeaponSlotContainer
{
	TArray<struct FWeaponSlotEntry>                    WeaponSlots;                                              // 0x0000(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x5A8];                                     // 0x0010(0x05A8) MISSED OFFSET
};

// ScriptStruct OakGame.ZoneMapPOIEntry
// 0x0060
struct FZoneMapPOIEntry
{
	class UZoneMapPOITypeData*                         PointOfInterestType;                                      // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      PointOfInterestObjectName;                                // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	struct FTransform                                  PointOfInterestTransform;                                 // 0x0020(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FIntPoint                                   PointOfInterestFODTexelCoords;                            // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	class UObject*                                     CustomPOIData;                                            // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct OakGame.InteractiveObjectTrapEntry
// 0x0010
struct FInteractiveObjectTrapEntry
{
	class AInteractiveObject*                          TrapActor;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	EInteractiveObjectTrapActivationType               ActivationType;                                           // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              InstructionDelay;                                         // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
};

// ScriptStruct OakGame.AIOOrientedParticleTarget
// 0x000C
struct FAIOOrientedParticleTarget
{
	unsigned char                                      UnknownData00[0xC];                                       // 0x0000(0x000C) MISSED OFFSET
};

// ScriptStruct OakGame.AIOOrientedParticleData
// 0x0040
struct FAIOOrientedParticleData
{
	class UParticleSystem*                             ParticleSystem;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       OriginSocket;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       ParticleBeamTargetParameterName;                          // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     DefaultBeamTargetPosition;                                // 0x0018(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	class UParticleSystemComponent*                    ParticleComponent;                                        // 0x0028(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FAIOOrientedParticleTarget                  Target;                                                   // 0x0030(0x000C) (Transient)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.CharacterCorpseState
// 0x00E8
struct FCharacterCorpseState
{
	unsigned char                                      bEnableCorpseCleanup : 1;                                 // 0x0000(0x0001) (Edit)
	unsigned char                                      bShouldTearOff : 1;                                       // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideVisibleCorpseRemovalTime : 1;                    // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              OverrideVisibleCorpseRemovalTime;                         // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ContactWithVehiclesTime;                                  // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xDC];                                      // 0x000C(0x00DC) MISSED OFFSET
};

// ScriptStruct OakGame.HolsteredWeaponData
// 0x0018
struct FHolsteredWeaponData
{
	EWeaponHolsteredSizeType                           WeaponSizeType;                                           // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EPickupLootAttachmentMode                          AttachMode;                                               // 0x0001(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	struct FName                                       SocketName;                                               // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bVisibleInFirstPerson;                                    // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.InventorySlotEntry
// 0x0034 (0x0040 - 0x000C)
struct FInventorySlotEntry : public FFastArraySerializerItem
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class AActor*                                      EquippedInventory;                                        // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               Enabled;                                                  // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               Selected;                                                 // 0x0019(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x001A(0x0006) MISSED OFFSET
	class UInventorySlotData*                          SlotData;                                                 // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	class UWeaponTrinketPartData*                      EquippedTrinket;                                          // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	class AActor*                                      ClientCachedEquippedInventory;                            // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UWeaponTrinketPartData*                      ClientCachedEquippedTrinket;                              // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
};

// ScriptStruct OakGame.InventorySlotContainer
// 0x0038 (0x00E8 - 0x00B0)
struct FInventorySlotContainer : public FFastArraySerializer
{
	TArray<struct FInventorySlotEntry>                 InventorySlots;                                           // 0x00B0(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x28];                                      // 0x00C0(0x0028) MISSED OFFSET
};

// ScriptStruct OakGame.OakGenderData
// 0x0098
struct FOakGenderData
{
	class USkeletalMesh*                               Mesh;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MeshOffset;                                               // 0x0008(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	class UGestaltPartListData*                        GestaltPartList;                                          // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      AnimBlueprint;                                            // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FName>                               AnimSetGenericNames_Enable;                               // 0x0028(0x0010) (Edit, ZeroConstructor)
	TArray<struct FName>                               AnimSetGenericNames_Disable;                              // 0x0038(0x0010) (Edit, ZeroConstructor)
	TArray<class UGbxAnimSet*>                         AnimSets_Enable;                                          // 0x0048(0x0010) (Edit, ZeroConstructor)
	TArray<class UGbxAnimSet*>                         AnimSets_Disable;                                         // 0x0058(0x0010) (Edit, ZeroConstructor)
	TArray<class UMaterialInstance*>                   Materials;                                                // 0x0068(0x0010) (Edit, ZeroConstructor)
	TArray<class UDialogNameTag*>                      DialogNameTags;                                           // 0x0078(0x0010) (Edit, ZeroConstructor)
	class UDestructibleMesh*                           CryoMesh;                                                 // 0x0088(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                GoreSourceMaterialIndex;                                  // 0x0090(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0094(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.ColorRandomizer
// 0x0010
struct FColorRandomizer
{
	float                                              Hue;                                                      // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Saturation;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FNumericRange                               Scale;                                                    // 0x0008(0x0008) (Edit)
};

// ScriptStruct OakGame.OakCharacterCustomization
// 0x0014
struct FOakCharacterCustomization
{
	bool                                               bRandomizeColor;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FColorRandomizer                            ColorRandomizer;                                          // 0x0004(0x0010) (Edit)
};

// ScriptStruct OakGame.OakCharacterColorization
// 0x0078 (0x008C - 0x0014)
struct FOakCharacterColorization : public FOakCharacterCustomization
{
	struct FLinearColor                                Primary1;                                                 // 0x0014(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverridePrimary1;                                        // 0x0024(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	struct FLinearColor                                Primary2;                                                 // 0x0028(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverridePrimary2;                                        // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	struct FLinearColor                                Secondary1;                                               // 0x003C(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideSecondary1;                                      // 0x004C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
	struct FLinearColor                                Secondary2;                                               // 0x0050(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideSecondary2;                                      // 0x0060(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	struct FLinearColor                                Tertiary1;                                                // 0x0064(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideTertiary1;                                       // 0x0074(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0075(0x0003) MISSED OFFSET
	struct FLinearColor                                Tertiary2;                                                // 0x0078(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideTertiary2;                                       // 0x0088(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0089(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.OakCharacterTexturePair
// 0x0010
struct FOakCharacterTexturePair
{
	class UTexture*                                    Comp;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture*                                    Normal;                                                   // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.OakCharacterPattern
// 0x0038
struct FOakCharacterPattern
{
	float                                              Primary;                                                  // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverridePrimary;                                         // 0x0004(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	float                                              Secondary;                                                // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideSecondary;                                       // 0x000C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	float                                              Tertiary;                                                 // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideTertiary;                                        // 0x0014(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	float                                              Skin;                                                     // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideSkin;                                            // 0x001C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRandomizeUse;                                            // 0x001D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x001E(0x0002) MISSED OFFSET
	float                                              Chance;                                                   // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRandomizeTexture;                                        // 0x0024(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	TArray<struct FOakCharacterTexturePair>            Textures;                                                 // 0x0028(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.OakCharacterSkinTone
// 0x0014 (0x0028 - 0x0014)
struct FOakCharacterSkinTone : public FOakCharacterCustomization
{
	struct FLinearColor                                SkinTone;                                                 // 0x0014(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideSkinTone;                                        // 0x0024(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.OakCharacterTattoos
// 0x0014 (0x0028 - 0x0014)
struct FOakCharacterTattoos : public FOakCharacterCustomization
{
	struct FLinearColor                                TattooColor;                                              // 0x0014(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideTattooColor;                                     // 0x0024(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.OakCharacterHair
// 0x003C (0x0050 - 0x0014)
struct FOakCharacterHair : public FOakCharacterCustomization
{
	struct FLinearColor                                InnerColor;                                               // 0x0014(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideInnerColor;                                      // 0x0024(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	struct FLinearColor                                OuterColor;                                               // 0x0028(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideOuterColor;                                      // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	struct FLinearColor                                SSSColor;                                                 // 0x003C(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideSSSColor;                                        // 0x004C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.OakCharacterEyes
// 0x0018
struct FOakCharacterEyes
{
	TArray<struct FColor>                              RandomEyeColors;                                          // 0x0000(0x0010) (Edit, ZeroConstructor)
	bool                                               bOverrideEyeColor;                                        // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.OakCharacterDecal
// 0x005C (0x0070 - 0x0014)
struct FOakCharacterDecal : public FOakCharacterCustomization
{
	float                                              DecalStrength;                                            // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideDecalStrength;                                   // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	struct FLinearColor                                DecalColor;                                               // 0x001C(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideDecalColor;                                      // 0x002C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	struct FLinearColor                                DecalColorHighlight;                                      // 0x0030(0x0010) (Edit, IsPlainOldData)
	bool                                               bOverrideDecalColorHighlight;                             // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
	class UTexture*                                    Texture_Comp;                                             // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture*                                    Texture_Normal;                                           // 0x0050(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture*                                    Texture_BaseColor;                                        // 0x0058(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FOakCharacterTexturePair>            Textures;                                                 // 0x0060(0x0010) (ZeroConstructor)
};

// ScriptStruct OakGame.OakCharacterCustomizationData
// 0x0248
struct FOakCharacterCustomizationData
{
	TArray<struct FOakCharacterColorization>           Customization_Colorizations;                              // 0x0000(0x0010) (Edit, ZeroConstructor)
	bool                                               bApplyCustomization_Colorization;                         // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	struct FOakCharacterPattern                        Customization_Pattern;                                    // 0x0018(0x0038) (Edit)
	bool                                               bApplyCustomization_Pattern;                              // 0x0050(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0051(0x0003) MISSED OFFSET
	struct FOakCharacterSkinTone                       Customization_SkinTone;                                   // 0x0054(0x0028) (Edit)
	bool                                               bApplyCustomization_SkinTone;                             // 0x007C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x007D(0x0003) MISSED OFFSET
	struct FOakCharacterTattoos                        Customization_Tattoos;                                    // 0x0080(0x0028) (Edit)
	bool                                               bApplyCustomization_Tattoos;                              // 0x00A8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x00A9(0x0007) MISSED OFFSET
	TArray<struct FOakCharacterHair>                   Customization_Hairs;                                      // 0x00B0(0x0010) (Edit, ZeroConstructor)
	bool                                               bApplyCustomization_Hair;                                 // 0x00C0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x00C1(0x0007) MISSED OFFSET
	struct FOakCharacterEyes                           Customization_Eyes;                                       // 0x00C8(0x0018) (Edit)
	bool                                               bApplyCustomization_Eyes;                                 // 0x00E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x00E1(0x0007) MISSED OFFSET
	TArray<struct FOakCharacterDecal>                  Customization_Decals;                                     // 0x00E8(0x0010) (Edit, ZeroConstructor)
	bool                                               bApplyCustomization_Decal;                                // 0x00F8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x00F9(0x0003) MISSED OFFSET
	struct FOakCharacterColorization                   Customization_Colorization;                               // 0x00FC(0x008C)
	struct FOakCharacterHair                           Customization_Hair;                                       // 0x0188(0x0050)
	struct FOakCharacterDecal                          Customization_Decal;                                      // 0x01D8(0x0070)
};

// ScriptStruct OakGame.OakCoordinatedEffectSwitchState
// 0x0020
struct FOakCoordinatedEffectSwitchState
{
	class FString                                      DisplayName;                                              // 0x0000(0x0010) (Edit, ZeroConstructor, EditConst)
	struct FName                                       Name;                                                     // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      Effect;                                                   // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.OakCoordinatedEffectSwitch
// 0x0058
struct FOakCoordinatedEffectSwitch
{
	class UEnum*                                       Enum;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FName                                       NativeEnumName;                                           // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	bool                                               bNativeEnum;                                              // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	unsigned char                                      InitialState;                                             // 0x0011(0x0001) (Edit, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0012(0x0006) MISSED OFFSET
	TArray<struct FOakCoordinatedEffectSwitchState>    States;                                                   // 0x0018(0x0010) (Edit, EditFixedSize, ZeroConstructor, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	unsigned char                                      CurrentState;                                             // 0x0028(0x0001) (ZeroConstructor, Transient, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	class AActor*                                      Owner;                                                    // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UGbxActionComponent*                         ActionComp;                                               // 0x0038(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0040(0x0010) MISSED OFFSET
	unsigned char                                      ReplicatedState;                                          // 0x0050(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.HUDInWorldIconTargetInfo
// 0x0058
struct FHUDInWorldIconTargetInfo
{
	class UInWorldIconData*                            IconData;                                                 // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      Actor;                                                    // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USceneComponent*                             LocationComponent;                                        // 0x0010(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FName                                       SocketName;                                               // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocationOffset;                                           // 0x0020(0x000C) (BlueprintVisible, IsPlainOldData)
	float                                              Radius;                                                   // 0x002C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGuid                                       Guid;                                                     // 0x0030(0x0010) (BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0040(0x0018) MISSED OFFSET
};

// ScriptStruct OakGame.FloorSectorRing
// 0x0068
struct FFloorSectorRing
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0000(0x0068) MISSED OFFSET
};

// ScriptStruct OakGame.FloorSector
// 0x0068
struct FFloorSector
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0000(0x0068) MISSED OFFSET
};

// ScriptStruct OakGame.PathSegmentSetting
// 0x0034
struct FPathSegmentSetting
{
	float                                              ReachDistance;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ReachHeight;                                              // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SnapGroundDistance;                                       // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGbxNavGoalModifiers                        GoalModifiers;                                            // 0x000C(0x0028) (Edit)
};

// ScriptStruct OakGame.AIAspectSettings_MovePath
// 0x0040
struct FAIAspectSettings_MovePath
{
	struct FName                                       NodeTag;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowPathSegment;                                        // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FPathSegmentSetting                         IntermediatePath;                                         // 0x000C(0x0034) (Edit)
};

// ScriptStruct OakGame.AIAspectSettings_Revive
// 0x0090
struct FAIAspectSettings_Revive
{
	struct FGbxBlackboardKeySelector                   Target;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible)
	struct FGbxParam                                   ReviveDistance;                                           // 0x0010(0x0080) (Edit)
};

// ScriptStruct OakGame.EscortPathValidation
// 0x0014
struct FEscortPathValidation
{
	float                                              RotateAngleToSearchPath;                                  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ValidatePathAnticipationTime;                             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ValidatePathFowardDistance;                               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ValidatePathIteration;                                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanGoIfValidationFailed;                                 // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.AIAspectSettings_VehicleEscortSpeed
// 0x01A0
struct FAIAspectSettings_VehicleEscortSpeed
{
	struct FGbxParam                                   NearDistance;                                             // 0x0000(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   FarDistance;                                              // 0x0080(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   CatchUpSpeed;                                             // 0x0100(0x0080) (Edit, BlueprintVisible)
	float                                              GoalUpdateDistance;                                       // 0x0180(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AnticipationTime;                                         // 0x0184(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bValidatePath;                                            // 0x0188(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0189(0x0003) MISSED OFFSET
	struct FEscortPathValidation                       EscortPathValidation;                                     // 0x018C(0x0014) (Edit, BlueprintVisible)
};

// ScriptStruct OakGame.AIAspectSettings_DialogCondition
// 0x0088
struct FAIAspectSettings_DialogCondition
{
	struct FGbxParam                                   Condition;                                                // 0x0000(0x0080) (Edit)
	class UDialogEvent*                                DialogEvent;                                              // 0x0080(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.AIAspectSettings_Dialog
// 0x0140
struct FAIAspectSettings_Dialog
{
	TArray<struct FAIAspectSettings_DialogCondition>   ConditionalDialogEvents;                                  // 0x0000(0x0010) (Edit, ZeroConstructor)
	class UDialogEvent*                                DialogEvent;                                              // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FGbxNamedParam>                      DialogParams;                                             // 0x0018(0x0010) (Edit, EditFixedSize, ZeroConstructor, NoClear)
	TArray<class UDialogParameter*>                    DialogParamAssets;                                        // 0x0028(0x0010) (ZeroConstructor)
	struct FGbxParam                                   DialogStartDelay;                                         // 0x0038(0x0080) (Edit)
	struct FGbxParam                                   DialogCooldownTime;                                       // 0x00B8(0x0080) (Edit)
	bool                                               bUseDialogCooldownTime;                                   // 0x0138(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPlayOnStop;                                              // 0x0139(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x013A(0x0006) MISSED OFFSET
};

// ScriptStruct OakGame.AIAspectSettings_VehicleArchetype
// 0x0002
struct FAIAspectSettings_VehicleArchetype
{
	TEnumAsByte<EVehicleAchetypeNative>                VehicleArchetype;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bInverted;                                                // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.AIAspectSettings_VehicleAttitude
// 0x0002
struct FAIAspectSettings_VehicleAttitude
{
	TEnumAsByte<ETeamAttitude>                         Attitude;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Inverted;                                                 // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.AIAspectSettings_VehicleDriverLeaves
// 0x0001
struct FAIAspectSettings_VehicleDriverLeaves
{
	bool                                               bInverted;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.AIAspectSettings_VehicleDriving
// 0x0080
struct FAIAspectSettings_VehicleDriving
{
	struct FGbxParam                                   DisableTurnHandBrake;                                     // 0x0000(0x0080) (Edit, BlueprintVisible)
};

// ScriptStruct OakGame.HornSequenceEntry
// 0x0008
struct FHornSequenceEntry
{
	float                                              StartTime;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Duration;                                                 // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.AIAspectSettings_VehicleHorn
// 0x0018
struct FAIAspectSettings_VehicleHorn
{
	TArray<struct FHornSequenceEntry>                  HornSequence;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bStopWithAction;                                          // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.AIAspectSettings_VehicleParts
// 0x0018
struct FAIAspectSettings_VehicleParts
{
	TArray<TSoftObjectPtr<class UVehiclePartData>>     Parts;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bInverted;                                                // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.RubberbandSpeed
// 0x0218
struct FRubberbandSpeed
{
	struct FGbxBlackboardKeySelector                   RubberbandTargetKey;                                      // 0x0000(0x0010) (Edit)
	struct FGbxParam                                   MinDistance;                                              // 0x0010(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   MaxDistance;                                              // 0x0090(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   MaxSpeed;                                                 // 0x0110(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   MinSpeed;                                                 // 0x0190(0x0080) (Edit, BlueprintVisible)
	bool                                               bBehindOnly;                                              // 0x0210(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0211(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.AIAspectSettings_VehicleSpeed
// 0x06B8
struct FAIAspectSettings_VehicleSpeed
{
	struct FGbxParam                                   WantedSpeed;                                              // 0x0000(0x0080) (Edit, BlueprintVisible)
	bool                                               bUseWantedSpeed;                                          // 0x0080(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0081(0x0007) MISSED OFFSET
	struct FGbxParam                                   WantedSteering;                                           // 0x0088(0x0080) (Edit, BlueprintVisible)
	bool                                               bUseWantedSteering;                                       // 0x0108(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0109(0x0007) MISSED OFFSET
	struct FGbxParam                                   MaxSpeed;                                                 // 0x0110(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   UseBoost;                                                 // 0x0190(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   ForceReverse;                                             // 0x0210(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   GoBackward;                                               // 0x0290(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   ForceHandbrake;                                           // 0x0310(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   SpeedHack;                                                // 0x0390(0x0080) (Edit, BlueprintVisible)
	struct FRubberbandSpeed                            RubberbandSpeed;                                          // 0x0410(0x0218) (Edit, BlueprintVisible)
	bool                                               bUseRubberbandSpeed;                                      // 0x0628(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0629(0x0007) MISSED OFFSET
	struct FGbxParam                                   Duration;                                                 // 0x0630(0x0080) (Edit, BlueprintVisible)
	bool                                               bUseDuration;                                             // 0x06B0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x06B1(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.AIPlayThroughData
// 0x00B0
struct FAIPlayThroughData
{
	unsigned char                                      bOverrideUIDisplayName : 1;                               // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideDisplayName : 1;                                 // 0x0000(0x0001)
	unsigned char                                      bOverrideDropOnDeathItemPools : 1;                        // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideEquippedItems : 1;                               // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideHealthInformation : 1;                           // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UGbxUIName*                                  DisplayUIName;                                            // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0010(0x0028)
	struct FItemPoolCollection                         DropOnDeathItemPools;                                     // 0x0028(0x0020) (Edit)
	struct FItemPoolCollection                         EquippedItemPoolCollection;                               // 0x0048(0x0020) (Deprecated)
	TArray<struct FItemPoolCollection>                 EquippedItemPoolCollections;                              // 0x0068(0x0010) (Edit, ZeroConstructor)
	bool                                               bEquipSingleItemFromCollection;                           // 0x0078(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0079(0x0007) MISSED OFFSET
	TArray<struct FAttributeBaseValueData>             AttributeStartingValues;                                  // 0x0080(0x0010) (Edit, ZeroConstructor)
	struct FDataTableRowHandle                         BalanceTableRow;                                          // 0x0090(0x0010) (Edit)
	TArray<struct FHealthType>                         HealthInformation;                                        // 0x00A0(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.AILootDropOverride
// 0x0018
struct FAILootDropOverride
{
	unsigned char                                      bOverrideDropPattern : 1;                                 // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideSocketName : 1;                                  // 0x0000(0x0001) (Edit)
	unsigned char                                      bDisabledByDefault : 1;                                   // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       SocketName;                                               // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class ULootSpawnPatternData*                       OverrideDropPattern;                                      // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.AnointedEnemyData
// 0x0010
struct FAnointedEnemyData
{
	class UClass*                                      PreFreezeAction;                                          // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FailsafeDestroyDelay;                                     // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bSuppressItemPoolsForFailsafeShatter;                     // 0x000C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.DodgeVOInfo
// 0x0010
struct FDodgeVOInfo
{
	class UDialogEvent*                                DialogEvent;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCharacterSoundTag*                          VocalizationTag;                                          // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.AIOCameraStatePostProcessOverrides
// 0x0020
struct FAIOCameraStatePostProcessOverrides
{
	unsigned char                                      bOverrideFocalDistance : 1;                               // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideFarTransitionRegion : 1;                         // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideNearTransitionRegion : 1;                        // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideFocalRegion : 1;                                 // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideFarBlurSize : 1;                                 // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideNearBlurSize : 1;                                // 0x0000(0x0001) (Edit)
	unsigned char                                      bOverrideVignetteIntensity : 1;                           // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              FocalDistanceOverride;                                    // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FarTransitionRegionOverride;                              // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              NearTransitionRegionOverride;                             // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FocalRegionOverride;                                      // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FarBlurSizeOverride;                                      // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              NearBlurSizeOverride;                                     // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              VignetteIntensityOverride;                                // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.AIOCameraStateInfo
// 0x0098
struct FAIOCameraStateInfo
{
	struct FName                                       StateName;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     TargetLocation;                                           // 0x0008(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     TargetLocationSplitscreen;                                // 0x0014(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     TargetLocationVerticalSplitscreen;                        // 0x0020(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     TargetLocationQuadSplitscreen;                            // 0x002C(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     TargetLookAtLocation;                                     // 0x0038(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     TargetLookAtLocationSplitscreen;                          // 0x0044(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     TargetLookAtLocationVerticalSplitscreen;                  // 0x0050(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     TargetLookAtLocationQuadSplitscreen;                      // 0x005C(0x000C) (Edit, IsPlainOldData)
	struct FGbxEasingFunc                              Easing;                                                   // 0x0068(0x000C) (Edit)
	float                                              TransitionDuration;                                       // 0x0074(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FAIOCameraStatePostProcessOverrides         PostProcessOverrides;                                     // 0x0078(0x0020) (Edit, IsPlainOldData)
};

// ScriptStruct OakGame.AIOCameraEntryTransition
// 0x0030
struct FAIOCameraEntryTransition
{
	struct FName                                       TransitionName;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FNumericRange                               AngleRange;                                               // 0x0008(0x0008) (Edit)
	struct FVector                                     StartLocation;                                            // 0x0010(0x000C) (Edit, IsPlainOldData)
	bool                                               bOverrideLocationDuration;                                // 0x001C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	float                                              LocationDurationOverride;                                 // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideRotationDuration;                                // 0x0024(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	float                                              RotationDurationOverride;                                 // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.ReplicatedStolenProjectileData
// 0x0010
struct FReplicatedStolenProjectileData
{
	struct FName                                       Socket;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	class AActor*                                      Projectile;                                               // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.OakPlayerCharacterSlotItem
// 0x0014 (0x0020 - 0x000C)
struct FOakPlayerCharacterSlotItem : public FFastArraySerializerItem
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UPlayerCharacterComponentSlotData*           SlotData;                                                 // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	class UPlayerCharacterComponentAugmentData*        AugmentData;                                              // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.OakPlayerCharacterSlotItemList
// 0x0018 (0x00C8 - 0x00B0)
struct FOakPlayerCharacterSlotItemList : public FFastArraySerializer
{
	class UPlayerCharacterComponent*                   Owner;                                                    // 0x00B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<struct FOakPlayerCharacterSlotItem>         Items;                                                    // 0x00B8(0x0010) (ZeroConstructor)
};

// ScriptStruct OakGame.BeastmasterPetStencilData
// 0x0014
struct FBeastmasterPetStencilData
{
	struct FLinearColor                                OutlineColor;                                             // 0x0000(0x0010) (Edit, DisableEditOnInstance, IsPlainOldData)
	int                                                OutlineThickness;                                         // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct OakGame.MeleeWeaponAttachmentData
// 0x0040
struct FMeleeWeaponAttachmentData
{
	class UStaticMesh*                                 Mesh;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       Socket;                                                   // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     RelativeLocation;                                         // 0x0010(0x000C) (Edit, IsPlainOldData)
	struct FRotator                                    RelativeRotation;                                         // 0x001C(0x000C) (Edit, IsPlainOldData)
	TArray<class UGbxCustomizationTargetData*>         CustomizationTargets;                                     // 0x0028(0x0010) (Edit, ZeroConstructor)
	class UGbxStaticMeshComponent*                     Component;                                                // 0x0038(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct OakGame.BeastmasterStandInPetData
// 0x0058
struct FBeastmasterStandInPetData
{
	TSoftObjectPtr<class UOakPlayerCharacterAugmentData_Pet> PetAugmentData;                                           // 0x0000(0x0028) (Edit)
	class UClass*                                      PetBlueprint;                                             // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      CustomPetSpawnCE;                                         // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              EnrageScale;                                              // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Translation;                                              // 0x003C(0x000C) (Edit, IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x0048(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.BeastmasterStandInActionSkillData
// 0x00D8
struct FBeastmasterStandInActionSkillData
{
	TSoftObjectPtr<class UClass>                       ActionSkillClass;                                         // 0x0000(0x0028) (Edit)
	class UClass*                                      CustomActor;                                              // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     CustomActorTranslationOffset;                             // 0x0030(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	class UClass*                                      CustomCE;                                                 // 0x0040(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      SkillAnimation;                                           // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      PetAnimation;                                             // 0x0050(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PetAnimationDelay;                                        // 0x0058(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
	struct FRuntimeFloatCurve                          PetScaleCurve;                                            // 0x0060(0x0078) (Edit)
};

// ScriptStruct OakGame.BehindTheScenesItem
// 0x0050
struct FBehindTheScenesItem
{
	class UBehindTheScenesMediaContainer*              Content;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       MediaLabelText;                                           // 0x0008(0x0028) (Edit)
	TSoftObjectPtr<class UTexture>                     ThumbnailTexture;                                         // 0x0020(0x0028) (Edit)
	EBehindTheScenesItemType                           ItemType;                                                 // 0x0048(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.BehindTheScenesCategory
// 0x0028
struct FBehindTheScenesCategory
{
	struct FText                                       CategoryName;                                             // 0x0000(0x0028) (Edit)
	TArray<struct FBehindTheScenesItem>                Items;                                                    // 0x0018(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.BlackJackCardDefinition
// 0x0020
struct FBlackJackCardDefinition
{
	class FString                                      DebugString;                                              // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                CardValue;                                                // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                SuitIndex;                                                // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CardIndex;                                                // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.LadderBehaviorGoalParams
// 0x0068
struct FLadderBehaviorGoalParams
{
	unsigned char                                      bControlPitch : 1;                                        // 0x0000(0x0001) (Edit)
	unsigned char                                      bControlYaw : 1;                                          // 0x0000(0x0001) (Edit)
	unsigned char                                      bInterruptedByInput : 1;                                  // 0x0000(0x0001) (Edit)
	unsigned char                                      bDisableInput : 1;                                        // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FInitialRotationAxisParams                  Pitch;                                                    // 0x0008(0x0030) (Edit)
	struct FInitialRotationAxisParams                  Yaw;                                                      // 0x0038(0x0030) (Edit)
};

// ScriptStruct OakGame.VehicleOverrideData
// 0x0030
struct FVehicleOverrideData
{
	TArray<class FString>                              PartSelections;                                           // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<class FString>                              Property;                                                 // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class UObject*                                     Data;                                                     // 0x0020(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UClass*                                      DataType;                                                 // 0x0028(0x0008) (Edit, ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct OakGame.CameraKeyOffset
// 0x002C
struct FCameraKeyOffset
{
	bool                                               TeleportFromStart;                                        // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     LookAtLocationOffset;                                     // 0x0004(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FVector                                     LocalCameraLocationOffset;                                // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FRotator                                    LocalCameraRotationOffset;                                // 0x001C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	float                                              AddedFOV;                                                 // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.CameraPitchOffset
// 0x0014
struct FCameraPitchOffset
{
	float                                              KeyYawAngle;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ForwardOffset;                                            // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              UpwardOffset;                                             // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DampingBankingRatio;                                      // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CloneSymmetricalKey;                                      // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.CameraIntroBlend
// 0x0098
struct FCameraIntroBlend
{
	float                                              TimeBeforeAllowingMovingCamera;                           // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              StartBlend;                                               // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              EndBlend;                                                 // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bUseACurve;                                               // 0x000C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	struct FRuntimeFloatCurve                          BlendByCurve;                                             // 0x0010(0x0078) (Edit, BlueprintVisible, BlueprintReadOnly)
	float                                              DampingLocation;                                          // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DampingRotation;                                          // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0090(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.CarnivoraFakeTurrets
// 0x0060
struct FCarnivoraFakeTurrets
{
	ECarnivoraFakeTurretShootingStyle                  ShootingStyle;                                            // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              MinDelayBetweenBurstWave;                                 // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinDelayInsideBurstShot;                                  // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                NbBulletPerBurst;                                         // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       SocketName;                                               // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      LightProjectileData;                                      // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ProjectileSpeed;                                          // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxPrediction;                                            // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageType;                                               // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Range;                                                    // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DistanceFromPoint;                                        // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxAngle;                                                 // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DirectHitPct;                                             // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpreadAngle;                                              // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               DrawDebugProjectileLine;                                  // 0x0044(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0045(0x0003) MISSED OFFSET
	class AActor*                                      CurrentTargetActor;                                       // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0050(0x0010) MISSED OFFSET
};

// ScriptStruct OakGame.SplineTriggers
// 0x0058
struct FSplineTriggers
{
	TSoftObjectPtr<class AOakTriggerBox>               Trigger;                                                  // 0x0000(0x0028) (Edit)
	TSoftObjectPtr<class ACarnivoraTrackBuilder>       Spline;                                                   // 0x0028(0x0028) (Edit)
	bool                                               bIsReverse;                                               // 0x0050(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0051(0x0003) MISSED OFFSET
	int                                                NextSplineTriggerId;                                      // 0x0054(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.CarnivoraDamageZoneInfo
// 0x000C
struct FCarnivoraDamageZoneInfo
{
	float                                              FrontDamageMultiplier;                                    // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SideDamageMultiplier;                                     // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BackDamageMultiplier;                                     // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.WheelState
// 0x000C
struct FWheelState
{
	float                                              RelativeSpeed;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0004(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.OakCARMenuVehicleConfig
// 0x0188
struct FOakCARMenuVehicleConfig
{
	class FString                                      LoadoutSaveName;                                          // 0x0000(0x0010) (Edit, ZeroConstructor)
	TSoftObjectPtr<class UOakCARVehicleData>           Body;                                                     // 0x0010(0x0028) (Edit)
	TSoftObjectPtr<class UOakCARVehiclePartData>       Wheel;                                                    // 0x0038(0x0028) (Edit)
	TSoftObjectPtr<class UOakCARVehiclePartData>       Armor;                                                    // 0x0060(0x0028) (Edit)
	TSoftObjectPtr<class UOakCARVehiclePartData>       CoreMod;                                                  // 0x0088(0x0028) (Edit)
	TSoftObjectPtr<class UOakCARVehiclePartData>       GunnerWeapon;                                             // 0x00B0(0x0028) (Edit)
	TSoftObjectPtr<class UOakCARVehiclePartData>       DriverWeapon;                                             // 0x00D8(0x0028) (Edit)
	TSoftObjectPtr<class UOakCARVehiclePartData>       Ornament;                                                 // 0x0100(0x0028) (Edit)
	TSoftObjectPtr<class UOakCARVehiclePartData>       MaterialDecal;                                            // 0x0128(0x0028) (Edit)
	TSoftObjectPtr<class UOakCARVehiclePartData>       Material;                                                 // 0x0150(0x0028) (Edit)
	int                                                ColorIndex1;                                              // 0x0178(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                ColorIndex2;                                              // 0x017C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                ColorIndex3;                                              // 0x0180(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0184(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.CharacterGroundSlamGradeData
// 0x0028
struct FCharacterGroundSlamGradeData
{
	float                                              MinimumHeight;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UClass*                                      ControlledMove;                                           // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      StartAction;                                              // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LandingDistance;                                          // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class UClass*                                      LandingAction;                                            // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.CharacterItemPoolExpansionInfo
// 0x0020
struct FCharacterItemPoolExpansionInfo
{
	TArray<struct FItemPoolInfo>                       DropOnDeathItemPools;                                     // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<TSoftObjectPtr<class UItemPoolExpansionData>> ItemPoolExpansions;                                       // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.ElementalSlideEffect
// 0x0150
struct FElementalSlideEffect
{
	struct FImpactResponseEffect                       DefaultResponse;                                          // 0x0000(0x0140) (Edit)
	TArray<struct FImpactResponseInfo>                 ImpactResponses;                                          // 0x0140(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.CharacterJumpGoalSetting
// 0x000C
struct FCharacterJumpGoalSetting
{
	float                                              InitialZVelocity;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GoalHeight;                                               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bUseInitialZVelocity : 1;                                 // 0x0008(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseGoalHeight : 1;                                       // 0x0008(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.LastCollisionDamageInfo
// 0x0018
struct FLastCollisionDamageInfo
{
	class AActor*                                      HitActor;                                                 // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bOwnerIsCollider;                                         // 0x0008(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FVector                                     RelativeVelocity;                                         // 0x000C(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct OakGame.CommandRingTarget
// 0x0028
struct FCommandRingTarget
{
	class AActor*                                      Actor;                                                    // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class USceneComponent*                             BaseComponent;                                            // 0x0008(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0010(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x001C(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct OakGame.TextElementCondition
// 0x0020
struct FTextElementCondition
{
	class UGbxCondition*                               Condition;                                                // 0x0000(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FText                                       TextToAdd;                                                // 0x0008(0x0028) (Edit)
};

// ScriptStruct OakGame.CorpseRecord
// 0x0010
struct FCorpseRecord
{
	class AActor*                                      Actor;                                                    // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              CorpseStartTime;                                          // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.CosmeticDamageEventDetails
// 0x0038
struct FCosmeticDamageEventDetails
{
	float                                              Damage;                                                   // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     HitLocation;                                              // 0x0004(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FVector                                     HitDirection;                                             // 0x0010(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class AActor*                                      Instigator;                                               // 0x0020(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageType;                                               // 0x0028(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageSource;                                             // 0x0030(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.PlayerItemDisplayInfo
// 0x0018
struct FPlayerItemDisplayInfo
{
	class AOakPlayerController*                        AssociatedPlayer;                                         // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      AssociatedItem;                                           // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      AssociatedDisplayItem;                                    // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct OakGame.CrewQuartersRoomAssignment
// 0x0010
struct FCrewQuartersRoomAssignment
{
	class UPlayerClassIdentifier*                      AssociatedPlayerClass;                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UDynamicRoomBaseData*                        AssociatedRoom;                                           // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.CSBoosterInfo
// 0x0090
struct FCSBoosterInfo
{
	struct FName                                       NameId;                                                   // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      AnimName;                                                 // 0x0008(0x0010) (ZeroConstructor, Deprecated)
	class FString                                      BoosterTextureName;                                       // 0x0018(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FText                                       DisplayName;                                              // 0x0028(0x0028) (Edit, DisableEditOnInstance)
	struct FText                                       Description;                                              // 0x0040(0x0028) (Edit, DisableEditOnInstance)
	struct FText                                       UnlockDescription;                                        // 0x0058(0x0028) (Edit, DisableEditOnInstance)
	int                                                Price;                                                    // 0x0070(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	class UStatusEffectData*                           StatusEffectData;                                         // 0x0078(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              EffectDuration;                                           // 0x0080(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	class UTexture*                                    Icon;                                                     // 0x0088(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct OakGame.DebugMenuCommandItemData
// 0x0048
struct FDebugMenuCommandItemData
{
	struct FName                                       Category;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FText                                       Label;                                                    // 0x0008(0x0028)
	struct FText                                       Description;                                              // 0x0020(0x0028)
	class FString                                      ExecCommand;                                              // 0x0038(0x0010) (ZeroConstructor)
};

// ScriptStruct OakGame.DebugMenuGradebox
// 0x0028
struct FDebugMenuGradebox
{
	class UCanvasPanel*                                Panel;                                                    // 0x0000(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UImage*                                      Image;                                                    // 0x0008(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  Description;                                              // 0x0010(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<class UTextBlock*>                          Atts;                                                     // 0x0018(0x0010) (ExportObject, ZeroConstructor, Transient)
};

// ScriptStruct OakGame.GbxReportTag
// 0x0030
struct FGbxReportTag
{
	bool                                               bShowInMenu;                                              // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class FString                                      Tag;                                                      // 0x0008(0x0010) (ZeroConstructor)
	struct FText                                       Description;                                              // 0x0018(0x0028)
};

// ScriptStruct OakGame.DefaultCrosshairData
// 0x0010
struct FDefaultCrosshairData
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              XSpread;                                                  // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              YSpread;                                                  // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.DiscoveredAreaInfo
// 0x0010
struct FDiscoveredAreaInfo
{
	struct FName                                       DiscoveredAreaName;                                       // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           PlaythroughBits;                                          // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.DiscoveredLevelInfo
// 0x0020
struct FDiscoveredLevelInfo
{
	struct FName                                       DiscoveredLevelName;                                      // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FDiscoveredAreaInfo>                 DiscoveredAreas;                                          // 0x0008(0x0010) (ZeroConstructor)
	uint32_t                                           PlaythroughBits;                                          // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.DiscoveredPlanetInfo
// 0x0030
struct FDiscoveredPlanetInfo
{
	TSoftObjectPtr<class UPlanetData>                  DiscoveredPlanet;                                         // 0x0000(0x0028)
	bool                                               bIsNewPlanet;                                             // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.DlcLevelTravelPair
// 0x0010
struct FDlcLevelTravelPair
{
	class UTravelStationData*                          NonDlcStationData;                                        // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTravelStationData*                          DlcStationData;                                           // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct OakGame.LevelTravelDataListPatch
// 0x0020
struct FLevelTravelDataListPatch
{
	class ULevelTravelStationData*                     LevelTravelData;                                          // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UGbxCondition*                               LevelTravelDataCondition;                                 // 0x0008(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UGbxCondition*                               MissionIconCondition;                                     // 0x0010(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                MovieToPlayDuringTravelMap;                               // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.LevelTravelDataListStationPatch
// 0x0020
struct FLevelTravelDataListStationPatch
{
	class FString                                      AssociatedTravelStationName;                              // 0x0000(0x0010) (Edit, ZeroConstructor, EditConst)
	TArray<struct FLevelTravelDataListPatch>           PatchedTravelData;                                        // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.ChallengeFilterType
// 0x0028
struct FChallengeFilterType
{
	struct FText                                       FilterName;                                               // 0x0000(0x0028) (Edit)
	TArray<class UChallengeCategoryData*>              IncludedCategories;                                       // 0x0018(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.LevelledSaveGameData
// 0x00B0
struct FLevelledSaveGameData
{
	int                                                Level;                                                    // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TSoftObjectPtr<class UTravelStationData>           InitialTravelStation;                                     // 0x0008(0x0028) (Edit)
	TSoftObjectPtr<class UClass>                       ActiveMissionClass;                                       // 0x0030(0x0028) (Edit)
	TSoftObjectPtr<class UMissionObjectiveSet>         ActiveMissionObjectiveSet;                                // 0x0058(0x0028) (Edit)
	uint32_t                                           CreditsAmount;                                            // 0x0080(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           EridiumAmount;                                            // 0x0084(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<TSoftObjectPtr<class UItemPoolData>>        DefaultInventory;                                         // 0x0088(0x0010) (Edit, ZeroConstructor)
	uint32_t                                           RandomRolls;                                              // 0x0098(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
	TArray<TSoftObjectPtr<class UItemPoolData>>        RandomInventory;                                          // 0x00A0(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.PlayerDuelArenaState
// 0x0010
struct FPlayerDuelArenaState
{
	class AOakCharacter_Player*                        Player;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.DuelingNumParticipantsInfo
// 0x000C
struct FDuelingNumParticipantsInfo
{
	int                                                NumPlayers;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              MaxArenaSize;                                             // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DuelLength;                                               // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.DuelModeSettings
// 0x0030
struct FDuelModeSettings
{
	float                                              DuelArenaTimeout;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DuelChallengeTimeout;                                     // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseDuelStartDelay;                                       // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              DuelStartDelay;                                           // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FDuelingNumParticipantsInfo>         NumParticipantsInfo;                                      // 0x0010(0x0010) (Edit, EditFixedSize, ZeroConstructor)
	float                                              DuelTotemSpawnTraceVertOffset;                            // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DuelTotemSpawnInFrontDistance;                            // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DuelTotemSpawnFindGroundDistance;                         // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.DuelTeamGroup
// 0x0010
struct FDuelTeamGroup
{
	TArray<class UTeam*>                               PlayerIndexToTeam;                                        // 0x0000(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.PlayerDueling_SavedInfo
// 0x0008
struct FPlayerDueling_SavedInfo
{
	class UTeam*                                       Team;                                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.PlayerActiveDuelState
// 0x0020
struct FPlayerActiveDuelState
{
	class AOakCharacter_Player*                        PlayerCharacter;                                          // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsMainPlayer;                                            // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	class UTeam*                                       DuelTeam;                                                 // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FPlayerDueling_SavedInfo                    SavedInfo;                                                // 0x0018(0x0008)
};

// ScriptStruct OakGame.TeamActiveDuelState
// 0x0018
struct FTeamActiveDuelState
{
	class UTeam*                                       DuelTeam;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FPlayerActiveDuelState>              Players;                                                  // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct OakGame.DuelLoserState
// 0x0020
struct FDuelLoserState
{
	class AOakCharacter_Player*                        Player;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	EDuelLoseReason                                    LoseReason;                                               // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0009(0x0017) MISSED OFFSET
};

// ScriptStruct OakGame.ActiveDuelState
// 0x0050
struct FActiveDuelState
{
	TArray<struct FTeamActiveDuelState>                ParticipatingTeams;                                       // 0x0000(0x0010) (ZeroConstructor)
	class ADuelArena*                                  DuelArena;                                                // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	class ADuelTotem*                                  DuelTotem;                                                // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	class AOakCharacter_Player*                        DuelInstigator;                                           // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	class UTeam*                                       WinningTeam;                                              // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FDuelLoserState>                     DuelLosers;                                               // 0x0030(0x0010) (ZeroConstructor)
	class APlayerTradeManager*                         TradeManager;                                             // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                ActiveIndex;                                              // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	EDuelClassification                                Classification;                                           // 0x004C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.WeaponConfigurationEvent
// 0x0010
struct FWeaponConfigurationEvent
{
	int                                                Priority;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UWwiseEvent*                                 WwiseEvent;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.WeaponConfigurationRtpc
// 0x0010
struct FWeaponConfigurationRtpc
{
	class UWwiseRtpc*                                  RtpcParam;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Value;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PriorityAveragingSum;                                     // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct OakGame.EchoInfo
// 0x0060
struct FEchoInfo
{
	int                                                DialogPlayingID;                                          // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UGbxDialogComponent*                         Caller;                                                   // 0x0008(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UCharacterEchoData*                          CharacterData;                                            // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UPerformanceEchoData*                        PerformanceData;                                          // 0x0018(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FWwisePlaybackInstance                      AudioInstance;                                            // 0x0020(0x0018) (Transient)
	class FString                                      MoodKeyframeToUse;                                        // 0x0038(0x0010) (ZeroConstructor, Transient)
	class FString                                      VoGMoodKeyToUse;                                          // 0x0048(0x0010) (ZeroConstructor, Transient)
	EVoiceOfGodSpeaker                                 VoGSpeakerID;                                             // 0x0058(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bForceEchoOnly;                                           // 0x0059(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x005A(0x0006) MISSED OFFSET
};

// ScriptStruct OakGame.SupportedElementalInteractionData
// 0x00F8
struct FSupportedElementalInteractionData
{
	class UElementalInteractionData*                   State;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TransitionTimeScale;                                      // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageTriggeredTransitionTimeScale;                       // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OverrideDamageTriggeredSourceDuration;                    // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bOverrideDamageAmount : 1;                                // 0x0014(0x0001) (Edit)
	unsigned char                                      bOverrideBaseStatusEffectChance : 1;                      // 0x0014(0x0001) (Edit)
	unsigned char                                      bOverrideBaseStatusEffectDamage : 1;                      // 0x0014(0x0001) (Edit)
	unsigned char                                      bOverrideBaseStatusEffectDuration : 1;                    // 0x0014(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	struct FAttributeInitializationData                OverrideDamageAmount;                                     // 0x0018(0x0038) (Edit)
	struct FAttributeInitializationData                OverrideBaseStatusEffectChance;                           // 0x0050(0x0038) (Edit)
	struct FAttributeInitializationData                OverrideBaseStatusEffectDamage;                           // 0x0088(0x0038) (Edit)
	struct FAttributeInitializationData                OverrideBaseStatusEffectDuration;                         // 0x00C0(0x0038) (Edit)
};

// ScriptStruct OakGame.ElementalInteractionDamageOverlapData
// 0x0008
struct FElementalInteractionDamageOverlapData
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.ElementalDamageTriggeredInteractionData
// 0x0028
struct FElementalDamageTriggeredInteractionData
{
	class UElementalInteractionData*                   Interaction;                                              // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     HitLocation;                                              // 0x0008(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	class AController*                                 InstigatorController;                                     // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0020(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.ElementalInteractionTransitionData
// 0x0018
struct FElementalInteractionTransitionData
{
	class UElementalInteractionData*                   SourceInteraction;                                        // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UElementalInteractionData*                   TargetInteraction;                                        // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TransitionTime;                                           // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageTriggeredTransitionTime;                            // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.ElementalInteractionManagerPostPhysicsTickFunction
// 0x0008 (0x0058 - 0x0050)
struct FElementalInteractionManagerPostPhysicsTickFunction : public FTickFunction
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0050(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.ElementalInteractionDamageValuesData
// 0x0014
struct FElementalInteractionDamageValuesData
{
	unsigned char                                      UnknownData00[0x14];                                      // 0x0000(0x0014) MISSED OFFSET
};

// ScriptStruct OakGame.ActorElementalInteractionDamageData
// 0x0088
struct FActorElementalInteractionDamageData
{
	TMap<class UElementalInteractionComponent*, struct FElementalInteractionDamageValuesData> DamageMap;                                                // 0x0000(0x0050) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0050(0x0028) MISSED OFFSET
	class AController*                                 InstigatorController;                                     // 0x0078(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0080(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.ActorElementalDamageData
// 0x0058
struct FActorElementalDamageData
{
	TMap<class UClass*, struct FActorElementalInteractionDamageData> DamageInteractions;                                       // 0x0000(0x0050) (ZeroConstructor, Transient)
	int                                                DamageCount;                                              // 0x0050(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.ProjectedMeshOptions
// 0x0048
struct FProjectedMeshOptions
{
	EProjectedMeshShape                                Shape;                                                    // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Size;                                                     // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   Scale2D;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	int                                                Complexity;                                               // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NumRings;                                                 // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bFlipNormals;                                             // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bGenerateUVs;                                             // 0x0019(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     CollisionChannel;                                         // 0x001A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x001B(0x0001) MISSED OFFSET
	float                                              StartTraceDistance;                                       // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              EndTraceDistance;                                         // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PushAwayDistance;                                         // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreActor;                                             // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	TArray<class AActor*>                              AdditionalIgnoredActors;                                  // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0040(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.ElementalPuddleTransitionConfigurationData
// 0x0030
struct FElementalPuddleTransitionConfigurationData
{
	class UMaterialInterface*                          DecalMaterial;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          MeshMaterial;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 AudioLoop;                                                // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UPhysicalMaterial*                           PhysMatOverride;                                          // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FName>                               EmitterNames;                                             // 0x0020(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.OakPlayerAbilityAllyQuerySpec
// 0x0010
struct FOakPlayerAbilityAllyQuerySpec
{
	bool                                               bInfiniteRange;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Range;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIncludeCompanions;                                       // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.LevelBasedExpScale
// 0x000C
struct FLevelBasedExpScale
{
	int                                                LevelDifference;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              HigherLevelEnemyExpScale;                                 // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LowerLevelEnemyExpScale;                                  // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.ExpAwardWeight
// 0x000C
struct FExpAwardWeight
{
	int                                                Players;                                                  // 0x0000(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              KillerExpBonus;                                           // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ExpWeight;                                                // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.PlayerExperienceFormula
// 0x000C
struct FPlayerExperienceFormula
{
	float                                              Multiplier;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Power;                                                    // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Offset;                                                   // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.PlayerGuardianRankFormula
// 0x0014
struct FPlayerGuardianRankFormula
{
	float                                              BaseValue;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BaseMultiplier;                                           // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Multiplier;                                               // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Power;                                                    // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Offset;                                                   // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.PlayerVaultCardLevelFormula
// 0x0014
struct FPlayerVaultCardLevelFormula
{
	float                                              BaseValue;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BaseMultiplier;                                           // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Multiplier;                                               // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Power;                                                    // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Offset;                                                   // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.PaintedTarget
// 0x0060
struct FPaintedTarget
{
	TWeakObjectPtr<class AActor>                       PaintedTarget;                                            // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FHUDInWorldIconTargetInfo                   HUDIconInfo;                                              // 0x0008(0x0058)
};

// ScriptStruct OakGame.ExitDownStateInformation
// 0x0028
struct FExitDownStateInformation
{
	EExitDownStateReason                               ExitReason;                                               // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UHUDNotificationAsset*                       CustomExitNotification;                                   // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FText                                       CustomExitMessageText;                                    // 0x0010(0x0028) (BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct OakGame.DiscoveryIOData
// 0x0060
struct FDiscoveryIOData
{
	class UDownloadableExpansionData*                  DownloadableExpansionData;                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TSoftObjectPtr<class UClass>                       Class;                                                    // 0x0008(0x0028) (Edit)
	struct FTransform                                  Transform;                                                // 0x0030(0x0030) (Edit, IsPlainOldData)
};

// ScriptStruct OakGame.GalaxySkyboxData
// 0x0040
struct FGalaxySkyboxData
{
	TSoftObjectPtr<class UWorld>                       WorldAsset;                                               // 0x0000(0x0028) (Edit)
	unsigned char                                      MapNameEnumIdx;                                           // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ZoneNameEnumIdx;                                          // 0x0029(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
	class UGbxLevelSequence*                           ArriveSequence;                                           // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UGbxLevelSequence*                           ExitSequence;                                             // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.ZoneIdToMapIdMappingData
// 0x0002
struct FZoneIdToMapIdMappingData
{
	unsigned char                                      ZoneNameEnumIdx;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      MapNameEnumIdx;                                           // 0x0001(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.PlanetMapDataToPlanetIdMappingData
// 0x0010
struct FPlanetMapDataToPlanetIdMappingData
{
	class UPlanetData*                                 PlanetData;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      PlanetID;                                                 // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct OakGame.MapIDToPlanetDataMappingData
// 0x0010
struct FMapIDToPlanetDataMappingData
{
	unsigned char                                      MapID;                                                    // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UPlanetData*                                 PlanetData;                                               // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.ZoneIDToMissionEventReferenceData
// 0x0018
struct FZoneIDToMissionEventReferenceData
{
	unsigned char                                      ZoneNameEnumIdx;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FMissionEventReference                      MissionEventReference;                                    // 0x0008(0x0010) (Edit)
};

// ScriptStruct OakGame.AmpedShotSettings
// 0x0018
struct FAmpedShotSettings
{
	class UClass*                                      AmpedShotTracerFX;                                        // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      AmpedShotBeamFX;                                          // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 AmpedShotSound;                                           // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.PickupEvaluationSettings
// 0x0038
struct FPickupEvaluationSettings
{
	float                                              MinEvaluationHeight;                                      // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              EvaluationWidth;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BoxExtentZFactor;                                         // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SelectedWidthBoost;                                       // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SelectedHeightBoost;                                      // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SelectedBoxZFactorBoost;                                  // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SelectedBoxZFactorBoost_Attached;                         // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttachedPickupPreferredBoxMaxHeight;                      // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttachedPickupTracedMeshPriorityBoost;                    // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PickupStickiness;                                         // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinLookAtTolerance;                                       // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SkipVisibilityTraceTestRange;                             // 0x002C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ItemCardBottomPickupOffset;                               // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ItemCardUpperLootBeamHeight;                              // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.OakVehicleManagerSettings
// 0x0020
struct FOakVehicleManagerSettings
{
	float                                              OakVehicleManagerUpdateTime;                              // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TimeBeforeStartDamaging;                                  // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamagePercentBySecond;                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TimeBeforeDigistructOut;                                  // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TimeBeforeExplode;                                        // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DistanceToDigistruct;                                     // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              NavCorrecterSearchRadius;                                 // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              NavCorrecterDestroyDelay;                                 // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.VaultCardActiveChallengeList
// 0x0018
struct FVaultCardActiveChallengeList
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	TArray<uint32_t>                                   VaultCardChallenges;                                      // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct OakGame.GbxGFxDialogBoxChoiceInfo
// 0x0030
struct FGbxGFxDialogBoxChoiceInfo
{
	struct FText                                       LabelText;                                                // 0x0000(0x0028) (Edit)
	struct FName                                       ActionName;                                               // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       InputAction;                                              // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCloseDialogOnSelection;                                  // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPressToHoldChoice;                                       // 0x0029(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
};

// ScriptStruct OakGame.GbxGFxDialogBoxInfo
// 0x00F0
struct FGbxGFxDialogBoxInfo
{
	struct FText                                       HeaderText;                                               // 0x0000(0x0028) (Edit)
	struct FText                                       BodyText;                                                 // 0x0018(0x0028) (Edit)
	TArray<struct FGbxGFxDialogBoxChoiceInfo>          Choices;                                                  // 0x0030(0x0010) (Edit, ZeroConstructor)
	struct FScriptDelegate                             OnChoiceMade;                                             // 0x0040(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0050(0x0010) MISSED OFFSET
	bool                                               bKeybindingAllowGamepadInputs;                            // 0x0060(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bKeybindingAllowMouseKeyboardInputs;                      // 0x0061(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EGbxGFxDialogBoxStyle                              DialogBoxStyle;                                           // 0x0062(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x0063(0x0005) MISSED OFFSET
	struct FText                                       InputText;                                                // 0x0068(0x0028) (Edit)
	bool                                               bCanCloseWhenChoicesArrayIsEmpty;                         // 0x0080(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bInputTextField;                                          // 0x0081(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPasswordTextField;                                       // 0x0082(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAnyUserCanInteract;                                      // 0x0083(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCanCancel;                                               // 0x0084(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bSuppressSpawnSound;                                      // 0x0085(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0086(0x0002) MISSED OFFSET
	struct FName                                       InitialChoice;                                            // 0x0088(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                InitialChoiceIndex;                                       // 0x0090(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	EGbxGFxDialogBoxButtonType                         ButtonType;                                               // 0x0094(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0095(0x0003) MISSED OFFSET
	class AGbxPlayerController*                        TargetPC;                                                 // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bAllowCloseWhenAnotherLocalPlayerLeaves;                  // 0x00A0(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x00A1(0x0007) MISSED OFFSET
	class UGbxGFxDialogBoxData*                        OverrideDefaultTemplate;                                  // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x40];                                      // 0x00B0(0x0040) MISSED OFFSET
};

// ScriptStruct OakGame.ReportReason
// 0x0020
struct FReportReason
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0028) (Edit)
	EShiftReportReason                                 Code;                                                     // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0018(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.DeathCircleStageData
// 0x00A8
struct FDeathCircleStageData
{
	struct FAttributeInitializationData                Radius;                                                   // 0x0000(0x0038) (Edit)
	struct FAttributeInitializationData                StableSeconds;                                            // 0x0038(0x0038) (Edit)
	struct FAttributeInitializationData                TransitionSeconds;                                        // 0x0070(0x0038) (Edit)
};

// ScriptStruct OakGame.BossbarEventData
// 0x0010
struct FBossbarEventData
{
	EBossbarEventType                                  Type;                                                     // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class AOakCharacter*                               Boss;                                                     // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct OakGame.MayhemDebugOverrides
// 0x0010
struct FMayhemDebugOverrides
{
	TArray<int>                                        ModifierIndexOverrides;                                   // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct OakGame.MayhemReplicableSetsData
// 0x0004
struct FMayhemReplicableSetsData
{
	int                                                ActiveSetsBits;                                           // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct OakGame.MayhemModeState
// 0x0028
struct FMayhemModeState
{
	bool                                               bIsActive;                                                // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                MayhemLevel;                                              // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                PendingMayhemLevel;                                       // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                PendingRandomSeed;                                        // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FMayhemDebugOverrides                       CachedOptionalOverrides;                                  // 0x0010(0x0010) (Transient)
	struct FMayhemReplicableSetsData                   ReplicableSets;                                           // 0x0020(0x0004) (Transient)
	int                                                RandomSeed;                                               // 0x0024(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct OakGame.EffectivePlayerCountData
// 0x0008
struct FEffectivePlayerCountData
{
	int                                                EffectiveNumPlayers;                                      // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	EEffectivePlayerCountSetting                       Setting;                                                  // 0x0004(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0004(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
};

// ScriptStruct OakGame.MapIDData
// 0x0002
struct FMapIDData
{
	unsigned char                                      ZoneNameID;                                               // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      MapNameID;                                                // 0x0001(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.GlobalScreenParticleData
// 0x0028
struct FGlobalScreenParticleData
{
	class UParticleSystem*                             StartAndLoopParticle;                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UParticleSystem*                             EndParticle;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ContentDims;                                              // 0x0010(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              ParticleDepth;                                            // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	struct FName                                       Tag;                                                      // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct OakGame.GearUpAirdropData
// 0x0010
struct FGearUpAirdropData
{
	class AOakMissionSpawner*                          Spawner;                                                  // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct OakGame.OakUIInventoryItemDisplayInfo
// 0x0110
struct FOakUIInventoryItemDisplayInfo
{
	struct FText                                       ItemName;                                                 // 0x0000(0x0028) (BlueprintVisible, Transient)
	int                                                ItemLevel;                                                // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	struct FText                                       ItemDescription;                                          // 0x0020(0x0028) (BlueprintVisible, Transient)
	struct FText                                       ManufacturerName;                                         // 0x0038(0x0028) (BlueprintVisible, Transient)
	int                                                ItemScore;                                                // 0x0050(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bNew;                                                     // 0x0054(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bFavorite;                                                // 0x0055(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bTrash;                                                   // 0x0056(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCanEquip;                                                // 0x0057(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsEquipped;                                              // 0x0058(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCellLocked;                                              // 0x0059(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCellUnavailable;                                         // 0x005A(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x005B(0x0001) MISSED OFFSET
	TWeakObjectPtr<class UObject>                      ReferenceObject;                                          // 0x005C(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
	TSoftObjectPtr<class UTexture>                     ReferencePicture;                                         // 0x0068(0x0028) (Transient)
	int                                                PickupOrderIndex;                                         // 0x0090(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0094(0x0004) MISSED OFFSET
	struct FInventoryListEntry                         ListEntry;                                                // 0x0098(0x0040) (BlueprintVisible, Transient)
	struct FInventoryListEntryHandle                   ItemHandle;                                               // 0x00D8(0x0004) (BlueprintVisible, Transient)
	TWeakObjectPtr<class AActor>                       ItemActor;                                                // 0x00DC(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UInventoryRarityData>         RarityData;                                               // 0x00E4(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UManufacturerData>            ManufacturerData;                                         // 0x00EC(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UGbxDamageType>               DamageType;                                               // 0x00F4(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x00FC(0x0004) MISSED OFFSET
	struct FName                                       SpecialSortName;                                          // 0x0100(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	EOakUIInventoryItemUseType                         UseType;                                                  // 0x0108(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0108(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	bool                                               bUseCosmeticLabel;                                        // 0x010C(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x010D(0x0003) MISSED OFFSET
};

// ScriptStruct OakGame.GFxBackpackWidgetConfig
// 0x0118
struct FGFxBackpackWidgetConfig
{
	class FString                                      GridWidgetPath;                                           // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FGbxGFxListConfig                           GridWidgetConfig;                                         // 0x0010(0x0090) (Edit)
	int                                                ItemBackpackSpaceMinIfInfinite;                           // 0x00A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                NumBackpackIconsToKeep;                                   // 0x00A4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                ItemBackpackSpaceMinLocked;                               // 0x00A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MinVisibleCells;                                          // 0x00AC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                NumCellsToPreCreate;                                      // 0x00B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00B4(0x0004) MISSED OFFSET
	class FString                                      BackpackItemScaleformClass;                               // 0x00B8(0x0010) (Edit, ZeroConstructor)
	class FString                                      EmptyBackpackItemScaleformClass;                          // 0x00C8(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      ListItemNativeClass;                                      // 0x00D8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       ButtonHelpText;                                           // 0x00E0(0x0028) (Edit)
	bool                                               bUseTrashButtonStates;                                    // 0x00F8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00F9(0x0003) MISSED OFFSET
	TWeakObjectPtr<class AOakPlayerController>         OakPC;                                                    // 0x00FC(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UGbxGFxMovie>                 OwningMovie;                                              // 0x0104(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UGbxGFxObject>                GridWidgetParent;                                         // 0x010C(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0114(0x0004) MISSED OFFSET
};

// ScriptStruct OakGame.GFxBackpackWidget
// 0x0198
struct FGFxBackpackWidget
{
	struct FScriptMulticastDelegate                    ItemSelectedDelegate;                                     // 0x0000(0x0010) (ZeroConstructor, Transient, InstancedReference)
	struct FScriptMulticastDelegate                    ItemClickedDelegate;                                      // 0x0010(0x0010) (ZeroConstructor, Transient, InstancedReference)
	struct FScriptMulticastDelegate                    ItemPressedDelegate;                                      // 0x0020(0x0010) (ZeroConstructor, Transient, InstancedReference)
	TWeakObjectPtr<class UOakThumbnailManager>         ThumbnailManager;                                         // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bThumbnailMangerIsExternal;                               // 0x0038(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UUIGlobals>                   UIGlobals;                                                // 0x003C(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	struct FGFxBackpackWidgetConfig                    Config;                                                   // 0x0048(0x0118) (Transient)
	TArray<struct FOakUIInventoryItemDisplayInfo>      Items;                                                    // 0x0160(0x0010) (ZeroConstructor, Transient)
	class UGbxGFxGridScrollingList*                    GridWidget;                                               // 0x0170(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
