#pragma once

// Borderlands 3 SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "BL3_GbxWeapon_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GbxWeapon.Weapon
// 0x0480 (0x08D8 - 0x0458)
class AWeapon : public AActor
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0458(0x0018) MISSED OFFSET
	class UWeaponFireComponent*                        CurrentFireComponent;                                     // 0x0470(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWeaponTypeAsset*                            WeaponDisplayData;                                        // 0x0478(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UWeaponTypeData*                             WeaponType;                                               // 0x0480(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          SwitchModeTimeScale;                                      // 0x0488(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	float                                              SwitchModeTime;                                           // 0x0494(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SwitchModeCompletePercent;                                // 0x0498(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x049C(0x0004) MISSED OFFSET
	TScriptInterface<class UGbxWeaponUserInterface>    WeaponUser;                                               // 0x04A0(0x0010) (ZeroConstructor, Transient, IsPlainOldData)
	struct FScriptMulticastDelegate                    BegunPlay;                                                // 0x04B0(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    NotifyGivenTo;                                            // 0x04C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyAttached;                                           // 0x04D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyDetached;                                           // 0x04E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyEquipped;                                           // 0x04F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyPutDown;                                            // 0x0500(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifySwitchedMode;                                       // 0x0510(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyFirstPersonCreated;                                 // 0x0520(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyUseInput;                                           // 0x0530(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyReloadStarted;                                      // 0x0540(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyReloadEnded;                                        // 0x0550(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyTargetLockChanged;                                  // 0x0560(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyHidden;                                             // 0x0570(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              PostSprintDelayUseTime;                                   // 0x0580(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ViewModelFOV;                                             // 0x0584(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DepthOfFieldZoomedForegroundNearRegion;                   // 0x0588(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x058C(0x0004) MISSED OFFSET
	TArray<struct FDamageScaleConditionalData>         DamageScaleConditionals;                                  // 0x0590(0x0010) (Edit, ZeroConstructor, EditConst)
	struct FGbxObjectReplicatorProxy                   ReplicationProxy;                                         // 0x05A0(0x0068) (Net, Transient)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0608(0x0008) MISSED OFFSET
	struct FWeaponAttachState                          PendingAttachState;                                       // 0x0610(0x0018) (Net, Transient)
	struct FWeaponAttachState                          AttachState;                                              // 0x0628(0x0018) (Transient)
	struct FGbxAttributeFloat                          EquipTime;                                                // 0x0640(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      UnknownData04[0x18];                                      // 0x064C(0x0018) MISSED OFFSET
	struct FGbxAttributeFloat                          PutDownTime;                                              // 0x0664(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      UnknownData05[0xA];                                       // 0x0670(0x000A) MISSED OFFSET
	unsigned char                                      PendingUseModeIndex;                                      // 0x067A(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x15];                                      // 0x067B(0x0015) MISSED OFFSET
	unsigned char                                      CurrentUseModeIndex;                                      // 0x0690(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      CurrentSlotIndex;                                         // 0x0691(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      NextSlotIndex;                                            // 0x0692(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x5];                                       // 0x0693(0x0005) MISSED OFFSET
	TArray<struct FWeaponUseModeState>                 UseModeState;                                             // 0x0698(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData08[0x28];                                      // 0x06A8(0x0028) MISSED OFFSET
	class UAimAssistParameters*                        AimAssetParameters;                                       // 0x06D0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsTargetLocked;                                          // 0x06D8(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x06D9(0x0003) MISSED OFFSET
	uint32_t                                           AttributeResolverUseModeBitmask;                          // 0x06DC(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x10];                                      // 0x06E0(0x0010) MISSED OFFSET
	bool                                               bForceUnzoomWhenSwitchingModes;                           // 0x06F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0xF];                                       // 0x06F1(0x000F) MISSED OFFSET
	TArray<class UWeaponAttachmentSlot*>               AttachmentSlots3P;                                        // 0x0700(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor)
	TArray<class UWeaponAttachmentSlot*>               AttachmentSlots1P;                                        // 0x0710(0x0010) (ZeroConstructor, Transient)
	bool                                               bWeaponAttached;                                          // 0x0720(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x7];                                       // 0x0721(0x0007) MISSED OFFSET
	TArray<struct FWeaponRegisterMaterialEffectData>   RegisteredMaterialEffects;                                // 0x0728(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData13[0x58];                                      // 0x0738(0x0058) MISSED OFFSET
	TArray<struct FWeaponRegisterSkeletalControlData>  RegisteredSkeletalControls;                               // 0x0790(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData14[0x8];                                       // 0x07A0(0x0008) MISSED OFFSET
	class UWeaponTriggerFeedbackAsset*                 CachedFireTriggerFeedback;                                // 0x07A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UWeaponTriggerFeedbackAsset*                 CachedZoomTriggerFeedback;                                // 0x07B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bShowCrosshair;                                           // 0x07B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAlwaysTickAttachedMeshes;                                // 0x07B9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0x6];                                       // 0x07BA(0x0006) MISSED OFFSET
	struct FName                                       BodyWeaponHoldName;                                       // 0x07C0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FName>                               AnimSetGenericNames;                                      // 0x07C8(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData16[0x8];                                       // 0x07D8(0x0008) MISSED OFFSET
	class UClass*                                      DamageModifierCompClass;                                  // 0x07E0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData17[0x10];                                      // 0x07E8(0x0010) MISSED OFFSET
	struct FName                                       CurrentState;                                             // 0x07F8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x98];                                      // 0x0800(0x0098) MISSED OFFSET
	TArray<struct FWeaponRegisterAttachmentEffectData> UnregisteredFirstPersonOnlyAttachmentEffects;             // 0x0898(0x0010) (ZeroConstructor, Transient)
	TArray<class UTexture2D*>                          UseModeIcons;                                             // 0x08A8(0x0010) (ZeroConstructor, Transient)
	TArray<class FString>                              UseModeIconFrameNames;                                    // 0x08B8(0x0010) (ZeroConstructor, Transient)
	struct FName                                       MainHandGripSocketName;                                   // 0x08C8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       OffHandGripSocketName;                                    // 0x08D0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxWeapon.Weapon");
		return ptr;
	}


	void Unlock(bool bReplicate);
	void TryAutoReload();
	void ToggleMode(unsigned char InputChannel);
	void SwitchPendingUseMode();
	void SwitchMode(unsigned char InputChannel, unsigned char NextUseModeIndex, bool bForced);
	void StopZooming(bool bSkipTransitions, bool bClearInput);
	void StopWeaponAction(TEnumAsByte<EWeaponActionType> WeaponAction);
	void StopUsing(unsigned char InputChannel, bool bForced);
	void StopReloading();
	void StopModeSwitch();
	void StopEffects(TEnumAsByte<EWeaponEffectType> EffectType, unsigned char UseModeIndex);
	void StopDynamicMaterialEffect(int EffectID);
	void StopAnimation(class UAnimMontage* Anim, bool bFirstPerson);
	void StartZooming();
	void StartUsing(unsigned char InputChannel);
	void StartReloading(bool bAuto);
	void SetTargetLocked(bool bIsLocked);
	void SetPreUseState(unsigned char UseModeIndex, bool bEnabled);
	void SetMaterialVectorParameterValue(const struct FName& ParamName, const struct FLinearColor& ParamValue);
	void SetMaterialScalarParameterValue(const struct FName& ParamName, float ParamValue);
	void SetEffectVectorParameter(const struct FName& ParamName, const struct FVector& ParamValue, const struct FWeaponEffectQueryData& QueryData);
	void SetEffectMaterialParameter(const struct FName& ParamName, class UMaterialInterface* ParamValue, const struct FWeaponEffectQueryData& QueryData);
	void SetEffectFloatParameter(const struct FName& ParamName, float ParamValue, const struct FWeaponEffectQueryData& QueryData);
	void SetEffectEmitterState(const struct FName& EmitterName, bool bEnabled, const struct FWeaponEffectQueryData& QueryData);
	void SetEffectColorParameter(const struct FName& ParamName, const struct FLinearColor& ParamValue, const struct FWeaponEffectQueryData& QueryData);
	void SetBoneVisibility(const struct FName& BoneName, bool bVisible, TEnumAsByte<EWeaponAttachmentVisibilityType> AttachmentType);
	void ServerUnlock();
	void ServerSwitchMode(unsigned char InputChannel, unsigned char NextUseModeIndex, bool bForced);
	void ServerStopUsing(unsigned char InputChannel, bool bForced);
	void ServerStopModeSwitch(unsigned char InputChannel, unsigned char ClientUseModeIndex);
	void ServerStartUsing(unsigned char InputChannel, unsigned char ClientPatternSeed);
	void ServerStartReloading(unsigned char UseModeIndex, bool bAuto);
	void ServerSetZoomState(unsigned char UseModeIndex, const struct FWeaponZoomState& NewState, float ZoomStartOffset);
	void ServerSetPatternSeed(unsigned char ClientPatternSeed);
	void ServerRestartAutoUse();
	void ServerLock(float Duration);
	void ServerInterruptReloadToUse(int ClientLoadedAmmo);
	void ServerEquipInterruptible();
	void RegisterTrinketAttachment(const struct FWeaponRegisterTrinketAttachmentData& Data);
	void RegisterSkeletalControl(const struct FWeaponRegisterSkeletalControlData& Data);
	void RegisterSimpleEffect(TEnumAsByte<EWeaponEffectType> EffectType, class UParticleSystem* Effect, const struct FName& EffectSocket);
	void RegisterMaterialEffect(const struct FWeaponRegisterMaterialEffectData& Data);
	void RegisterEffect(const struct FWeaponRegisterAttachmentEffectData& Data);
	void ReevaluateConditionalEffects();
	void PrevZoomLevel();
	void PlayEffects(TEnumAsByte<EWeaponEffectType> EffectType, unsigned char UseModeIndex, int EffectID);
	int PlayDynamicMaterialEffect(const struct FWeaponMaterialEffectData& Data);
	float PlayAnimation(class UAnimMontage* Anim, bool bFirstPerson, float PlayRate, float Duration);
	void OnZoomedOut();
	void OnUseStarted();
	void OnUseFinished();
	void OnUpdateSkeletalControlsWhenUseFinishes();
	void OnUpdateSkeletalControlsWhenUsed();
	void OnUpdateSkeletalControlsWhenAmmoChanges();
	void OnRep_TargetLockedChanged();
	void OnRep_PendingUseModeIndex();
	void OnRep_PendingAttachState();
	void OnRep_CurrentUseModeIndex(unsigned char PreviousUseModeIndex);
	void OnReloadEnded(bool bCompleted);
	void OnAmmoGivenToEmptyWeapon();
	void NotifySkeletalControl(TEnumAsByte<EWeaponEffectType> ControlType, const struct FName& ControlName, EWeaponSkeletalControlEvent Event, float EventValue);
	void NextZoomLevel();
	void Lock(float Duration, bool bReplicate);
	void K2_StopWeaponActionObj(class UGbxAction* WeaponAction);
	class UGbxAction* K2_PlayWeaponActionEx(TEnumAsByte<EWeaponActionType> WeaponAction, const struct FActionState_Base& ActionParams, bool bCheckForRelevancy);
	class UGbxAction* K2_PlayWeaponAction(TEnumAsByte<EWeaponActionType> WeaponAction, float PlayRate, float Duration, bool bCheckForRelevancy);
	bool IsZoomedIn(bool bIncludeTransitions);
	bool IsZoomed();
	bool IsUsing();
	bool IsTargetLocked();
	bool IsSwitchingModes();
	bool IsReloading();
	bool IsPuttingDown();
	bool IsPendingUse(unsigned char InputChannel);
	bool IsLocked();
	bool IsLocalAuthority();
	bool IsInactive();
	bool IsEquipping();
	bool IsAuthorityUsing();
	bool IsAuthoritySwitchingModes();
	bool IsAuthorityReloading();
	bool IsAuthorityPuttingDown();
	bool IsAuthorityEquipping();
	bool IsActive();
	void GivenTo(class APawn* NewOwner);
	float GetZoomFOVScale();
	float GetZoomEffect();
	float GetZoomDuration();
	class UActorComponent* GetUseModeComponentByClass(class UClass* ComponentClass, unsigned char UseModeIndex);
	float GetMuteADSAlpha();
	float GetMaxZoomFOVScale();
	unsigned char GetLastInputChannel();
	unsigned char GetCurrentReloadPartType();
	class UMeshComponent* GetAttachmentMesh(bool bFirstPerson, unsigned char SlotIndex);
	class UActorComponent* GetAssociatedUseModeComponentByClass(class UClass* ComponentClass, class UActorComponent* ReferenceComponent);
	class UAimAssistParameters* GetAimAssistParameters();
	void EquipInterruptible();
	void Dropped();
	void CycleZoomLevel();
	void ClientUnlock();
	void ClientStopReloading();
	void ClientLock(float Duration);
	unsigned char AddUseMode(class UWeaponUseComponent* UseComponent, TArray<class UActorComponent*> OtherComponents, int InputChannels);
	void Activate(class APawn* WeaponOwner, unsigned char InSlot, EWeaponEquipType InEquipType);
};


// Class GbxWeapon.WeaponPreUseComponent
// 0x0020 (0x0198 - 0x0178)
class UWeaponPreUseComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    NotifyPreUseFinished;                                     // 0x0178(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               bEnabled;                                                 // 0x0188(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0189(0x0007) MISSED OFFSET
	class AWeapon*                                     WeaponPrivate;                                            // 0x0190(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxWeapon.WeaponPreUseComponent");
		return ptr;
	}


	void K2_OnDeactivated();
	void K2_OnActivated();
};


// Class GbxWeapon.WeaponUseComponent
// 0x00A0 (0x0218 - 0x0178)
class UWeaponUseComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0178(0x0008) MISSED OFFSET
	unsigned char                                      UseMode;                                                  // 0x0180(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bAutoSwitchModeWhenOutOfAmmo : 1;                         // 0x0181(0x0001) (Edit)
	unsigned char                                      bClearUseInputWhenSwitchingModes : 1;                     // 0x0181(0x0001) (Edit)
	unsigned char                                      bActivateModeWhenZoomed : 1;                              // 0x0181(0x0001) (Edit)
	unsigned char                                      bUseAnimationSwitchModeTime : 1;                          // 0x0181(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0182(0x0006) MISSED OFFSET
	class UGbxCrosshairDataAsset*                      CrosshairData;                                            // 0x0188(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UGbxCrosshairDataAsset*                      ZoomedCrosshairData;                                      // 0x0190(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  Icon;                                                     // 0x0198(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class FString                                      ModeName;                                                 // 0x01A0(0x0010) (Edit, ZeroConstructor)
	TArray<struct FAttributeEffectData>                InstigatorAttributeEffects;                               // 0x01B0(0x0010) (Edit, ZeroConstructor)
	struct FScriptMulticastDelegate                    NotifyUseStarted;                                         // 0x01C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyUseFinished;                                        // 0x01D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NotifyUsed;                                               // 0x01E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FGbxAttributeModifierHandle>         InstigatorAttributeModifiers;                             // 0x01F0(0x0010) (ZeroConstructor, Transient)
	class UWeaponPreUseComponent*                      PreUseComponent;                                          // 0x0200(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0208(0x0008) MISSED OFFSET
	class AWeapon*                                     WeaponPrivate;                                            // 0x0210(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxWeapon.WeaponUseComponent");
		return ptr;
	}


	bool ToggleMode();
	void SwitchToZoomedMode(unsigned char ZoomLevel);
	void SwitchFromZoomedMode(unsigned char ZoomLevel);
	void OnPreUseFinished(bool bInterrupted);
	void K2_OnDeactivated();
	void K2_OnActivated();
	bool CanActivateMode();
};


// Class GbxWeapon.WeaponFireComponent
// 0x06E8 (0x0900 - 0x0218)
class UWeaponFireComponent : public UWeaponUseComponent
{
public:
	struct FGbxAttributeFloat                          FireRate;                                                 // 0x0218(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeInteger                        AutomaticBurstCount;                                      // 0x0224(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          BurstFireDelay;                                           // 0x0230(0x000C) (Edit, BlueprintVisible, Net)
	bool                                               bAutoBurst;                                               // 0x023C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x023D(0x0003) MISSED OFFSET
	struct FName                                       FireSocket;                                               // 0x0240(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FName>                               FireSockets;                                              // 0x0248(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	bool                                               FullFireSocketCycle;                                      // 0x0258(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     TraceChannel;                                             // 0x0259(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x025A(0x0002) MISSED OFFSET
	float                                              MinFireRateScale;                                         // 0x025C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          FireRateAccelDuration;                                    // 0x0260(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          FireRateDecelDuration;                                    // 0x026C(0x000C) (Edit, BlueprintVisible, Net)
	float                                              MinFireRatePercentToFire;                                 // 0x0278(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x027C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 FireRateCurve;                                            // 0x0280(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bUseShotStrengthFormula;                                  // 0x0288(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0289(0x0007) MISSED OFFSET
	struct FAttributeInitializationData                ShotStrengthFormula;                                      // 0x0290(0x0038) (Edit)
	int                                                FireSequenceLength;                                       // 0x02C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          ResetFireSequenceTime;                                    // 0x02CC(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	float                                              ResetFireSequenceCompletePercent;                         // 0x02D8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAdvanceFireSequenceAtEndOfBurst;                         // 0x02DC(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bTotalShotCostRequiredToFire;                             // 0x02DD(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x02DE(0x0002) MISSED OFFSET
	struct FGbxAttributeInteger                        ShotAmmoCost;                                             // 0x02E0(0x000C) (Edit, BlueprintVisible, Net)
	int                                                MinShotAmmoCost;                                          // 0x02EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          Spread;                                                   // 0x02F0(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          AccuracyImpulse;                                          // 0x02FC(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          BurstAccuracyImpulseScale;                                // 0x0308(0x000C) (Edit, BlueprintVisible)
	float                                              ViewModelShotOffsetScale;                                 // 0x0314(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          Damage;                                                   // 0x0318(0x000C) (BlueprintVisible, BlueprintReadOnly, Net, Transient)
	unsigned char                                      UnknownData05[0x4];                                       // 0x0324(0x0004) MISSED OFFSET
	struct FAttributeInitializationData                DamageFormula;                                            // 0x0328(0x0038) (Edit)
	class UCurveFloat*                                 ShotStrengthDamageCurve;                                  // 0x0360(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          DamageRadius;                                             // 0x0368(0x000C) (BlueprintVisible, BlueprintReadOnly, Transient)
	unsigned char                                      UnknownData06[0x4];                                       // 0x0374(0x0004) MISSED OFFSET
	struct FAttributeInitializationData                DamageRadiusFormula;                                      // 0x0378(0x0038) (Edit)
	class UCurveFloat*                                 ShotStrengthDamageRadiusCurve;                            // 0x03B0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          ImpactForce;                                              // 0x03B8(0x000C) (BlueprintVisible, BlueprintReadOnly, Transient)
	unsigned char                                      UnknownData07[0x4];                                       // 0x03C4(0x0004) MISSED OFFSET
	struct FForceSelection                             ImpactForceSelection;                                     // 0x03C8(0x0020) (Edit)
	class UCurveFloat*                                 ShotStrengthImpactForceCurve;                             // 0x03E8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageType;                                               // 0x03F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageSource;                                             // 0x03F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UImpactData*                                 ImpactData;                                               // 0x0400(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MuzzleFXSequenceLength;                                   // 0x0408(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FSoundPerceptionProperties                  FireSoundPerception;                                      // 0x040C(0x000C) (Edit, IsPlainOldData)
	class UFeedbackData*                               FireFeedback;                                             // 0x0418(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bPlayFeedbackAtLocation : 1;                              // 0x0420(0x0001) (Edit)
	unsigned char                                      bScaleFeedbackWithFireRate : 1;                           // 0x0420(0x0001) (Edit)
	unsigned char                                      UnknownData08[0x7];                                       // 0x0421(0x0007) MISSED OFFSET
	class UFeedbackData*                               ScaledFeedback;                                           // 0x0428(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRuntimeFloatCurve                          FeedbackFireRateScalar;                                   // 0x0430(0x0078) (Edit)
	struct FName                                       FeedbackSocket;                                           // 0x04A8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bSyncAnimationToFireRate;                                 // 0x04B0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x04B1(0x0003) MISSED OFFSET
	float                                              FireAnimationBlendSpace;                                  // 0x04B4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EWeaponEffectType>                     SkeletalControlType;                                      // 0x04B8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x7];                                       // 0x04B9(0x0007) MISSED OFFSET
	struct FName                                       SkeletalControlName;                                      // 0x04C0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SkeletalControlFireInput;                                 // 0x04C8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLockOntoBestTarget;                                      // 0x04CC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x04CD(0x0003) MISSED OFFSET
	float                                              DelayInitializeAttribute;                                 // 0x04D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0xD];                                       // 0x04D4(0x000D) MISSED OFFSET
	unsigned char                                      UnknownData13 : 1;                                        // 0x04E1(0x0001)
	unsigned char                                      bFireRateAccelActive : 1;                                 // 0x04E1(0x0001) (Net, Transient)
	unsigned char                                      UnknownData14[0x2];                                       // 0x04E2(0x0002) MISSED OFFSET
	EWeaponFireRateState                               FireRateState;                                            // 0x04E4(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x04E2(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	int                                                CurrentBurstShotCount;                                    // 0x04E8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      CurrentFireSequenceIndex;                                 // 0x04EC(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x10];                                      // 0x04ED(0x0010) MISSED OFFSET
	unsigned char                                      ClientFireSequenceState;                                  // 0x04FD(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x22];                                      // 0x04FE(0x0022) MISSED OFFSET
	float                                              FireRatePercent;                                          // 0x0520(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x14];                                      // 0x0524(0x0014) MISSED OFFSET
	unsigned char                                      FlashSlot;                                                // 0x0538(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      FlashCount;                                               // 0x0539(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData19[0x6];                                       // 0x053A(0x0006) MISSED OFFSET
	struct FVector_NetQuantize                         ImpactLocation;                                           // 0x0540(0x000C) (Net, Transient)
	float                                              DamageAmount;                                             // 0x054C(0x0004) (ZeroConstructor, Deprecated, IsPlainOldData)
	struct FGbxParam                                   AIBurstCount;                                             // 0x0550(0x0080) (Edit)
	struct FGbxParam                                   AIBurstFireDelay;                                         // 0x05D0(0x0080) (Edit)
	struct FGbxParam                                   AIFireInterval;                                           // 0x0650(0x0080) (Edit)
	struct FGbxParam                                   AIAccuracy;                                               // 0x06D0(0x0080) (Edit)
	struct FGbxParam                                   AIProjectileSpeedScale;                                   // 0x0750(0x0080) (Edit)
	struct FNumericRange                               AIDesiredRange;                                           // 0x07D0(0x0008) (Edit, EditConst)
	struct FGbxParam                                   AIMinDesiredRange;                                        // 0x07D8(0x0080) (Edit)
	struct FGbxParam                                   AIMaxDesiredRange;                                        // 0x0858(0x0080) (Edit)
	struct FGbxForceFeedbackEffect                     ScaledEffect;                                             // 0x08D8(0x0018) (Transient)
	unsigned char                                      UnknownData20[0x10];                                      // 0x08F0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxWeapon.WeaponFireComponent");
		return ptr;
	}


	void ServerResetFireSequence();
	void OnStopFireRateDeceleration();
	void OnStopFireRateAcceleration();
	void OnStartFireRateDeceleration();
	void OnStartFireRateAcceleration();
	void OnRep_ImpactLocation();
	void OnRep_FlashCount();
	void OnRep_FireRateAccelChanged();
	void OnRep_ClientFireSequenceState();
	void OnReloadAmmoGiven();
	void OnLoopingFireActionEnd(EGbxActionEndState EndState);
	void OnGivenTo();
	bool IsFireRateAccelEnabled();
	class AActor* GetLockedTarget();
	float GetFireRatePercent();
	void ClientStopResetFireSequence();
};


// Class GbxWeapon.WeaponFireProjectileComponent
// 0x0058 (0x0958 - 0x0900)
class UWeaponFireProjectileComponent : public UWeaponFireComponent
{
public:
	struct FGbxAttributeInteger                        ProjectilesPerShot;                                       // 0x0900(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          ProjectileSpeedScale;                                     // 0x090C(0x000C) (Edit, BlueprintVisible, Net)
	class UCurveFloat*                                 ShotStrengthProjectileSpeedCurve;                         // 0x0918(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      ProjectileTemplate;                                       // 0x0920(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FAttributeBaseValueData>             ProjectileBaseValues;                                     // 0x0928(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class UClass*                                      LightProjectileData;                                      // 0x0938(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UFiringPattern*                              FiringPatternData;                                        // 0x0940(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Range;                                                    // 0x0948(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x094C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxWeapon.WeaponFireProjectileComponent");
		return ptr;
	}


	class UClass* GetShotProjectileData();
	class UClass* GetShotLightProjectileData();
};


// Class GbxWeapon.Projectile
// 0x0228 (0x0680 - 0x0458)
class AProjectile : public AActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0458(0x0010) MISSED OFFSET
	unsigned char                                      bIgnoreCollisionWithInstigator : 1;                       // 0x0468(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bIgnoreCollisionWithInstigatorTeam : 1;                   // 0x0468(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bStopBlockingPawnsAfterCollidingWithOne : 1;              // 0x0468(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bServerControlsProjectileLifetime : 1;                    // 0x0468(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0469(0x0007) MISSED OFFSET
	struct FDamageInfo                                 DamageInfo;                                               // 0x0470(0x0058) (Edit, BlueprintVisible, Net)
	class UImpactData*                                 DefaultImpact;                                            // 0x04C8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DefaultImpactEffectDelay;                                 // 0x04D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	EWeaponShotModifierType                            SpawnModifierType;                                        // 0x04D4(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x13];                                      // 0x04D5(0x0013) MISSED OFFSET
	float                                              SpawnModifierValue;                                       // 0x04E8(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x04EC(0x0004) MISSED OFFSET
	class UGbxProjectileMovementComponent*             MovementComponent;                                        // 0x04F0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UExplosionComponent*                         ExplosionComponent;                                       // 0x04F8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1];                                       // 0x0500(0x0001) MISSED OFFSET
	bool                                               bClientExplodeAtLeastOnce;                                // 0x0501(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0xA6];                                      // 0x0502(0x00A6) MISSED OFFSET
	bool                                               bExplodeOnHit;                                            // 0x05A8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bExplodeOnHitWorld;                                       // 0x05A9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bExplodeOnHitDamagable;                                   // 0x05AA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bExplodeOnHitEnemy;                                       // 0x05AB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bExplodeAfterLifetime;                                    // 0x05AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDestroyAfterExplode;                                     // 0x05AD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDamageOnExplode;                                         // 0x05AE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x05AF(0x0001) MISSED OFFSET
	class UClass*                                      DamageData;                                               // 0x05B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTeam*                                       ProjectileTeam;                                           // 0x05B8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageSourceOverride;                                     // 0x05C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageTypeOverride;                                       // 0x05C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UExplosionData*                              ExplosionData;                                            // 0x05D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseQuickPopExplosion;                                    // 0x05D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x7];                                       // 0x05D9(0x0007) MISSED OFFSET
	class UExplosionData*                              QuickPopExplosion;                                        // 0x05E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UImpactData*                                 ImpactData;                                               // 0x05E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAttributeInitializationData                DamageOverride;                                           // 0x05F0(0x0038) (Edit, BlueprintVisible)
	float                                              DamageAreaRadius;                                         // 0x0628(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     DamageAreaBoxExtent;                                      // 0x062C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FForceSelection                             ImpactForceOverride;                                      // 0x0638(0x0020) (Edit, BlueprintVisible)
	struct FCriticalHitDamageOverrides                 CriticalHitOverrides;                                     // 0x0658(0x0008) (Edit, BlueprintVisible)
	TArray<class AActor*>                              OverrideIgnoreActors;                                     // 0x0660(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class AWeapon*                                     WeaponFiredFrom;                                          // 0x0670(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              SpawnSpeedScale;                                          // 0x0678(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x067C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxWeapon.Projectile");
		return ptr;
	}


	void StopBlockingPawns();
	void SetProjectileDamageType(class UClass* DamageType);
	void SetProjectileDamageSource(class UClass* DamageSource);
	void SetProjectileDamageRadius(float DamageRadius);
	void SetProjectileDamage(float Damage);
	void ResetCollisionWith(class AActor* ActorToCollide);
	void OnRep_SpawnModifierType();
	void OnLastBounce(const struct FHitResult& ImpactResult);
	void OnHitWorld(const struct FHitResult& Hit);
	void OnHitNeutral(const struct FHitResult& Hit);
	void OnHitFriendly(const struct FHitResult& Hit);
	void OnHitEnemy(const struct FHitResult& Hit);
	void OnHitDamagableObject(const struct FHitResult& Hit);
	void OnExplode();
	void OnComponentDetachedFromParent(class USceneComponent* SceneComponent);
	void OnBounce(const struct FHitResult& Hit, const struct FVector& ImpactVelocity);
	void OnBeginExplode();
	void IgnoreCollisionWith(class AActor* ActorToIgnore);
	void HandleDetachRequest();
	class UGbxProjectileMovementComponent* GetProjectileMovementComponent();
	class UClass* GetProjectileDamageType();
	class UClass* GetProjectileDamageSource();
	float GetProjectileDamageRadius();
	float GetProjectileDamage();
	class UExplosionComponent* GetExplosionComponent();
	void Explode();
	void CheckProjectileAttachment();
	void BounceDelegate(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
};


// Class GbxWeapon.GbxProjectileMovementComponent
// 0x0070 (0x02C8 - 0x0258)
class UGbxProjectileMovementComponent : public UProjectileMovementComponent
{
public:
	struct FScriptMulticastDelegate                    PostLastBounceDelegate;                                   // 0x0258(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              ProjectileAcceleration;                                   // 0x0268(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinSpeedWhenDecelerating;                                 // 0x026C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET
	class AProjectile*                                 OwningProjectile;                                         // 0x0278(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bSmoothedRotationFollowsVelocity;                         // 0x0280(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0281(0x0003) MISSED OFFSET
	float                                              SmoothedRotationSpeed;                                    // 0x0284(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDontStopSimulatingAfterHittingAnotherProjectile;         // 0x0288(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0289(0x0003) MISSED OFFSET
	int                                                MaxNumBounces;                                            // 0x028C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bBounceParallelToHitNormal;                               // 0x0290(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0291(0x0003) MISSED OFFSET
	int                                                CurrentNumBounces;                                        // 0x0294(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bFreezeMovementAfterLastBounce;                           // 0x0298(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0299(0x0003) MISSED OFFSET
	struct FBulletPerceptionProperties                 BulletSensePerception;                                    // 0x029C(0x0008) (Edit, IsPlainOldData)
	struct FSoundPerceptionProperties                  ImpactSoundPerception;                                    // 0x02A4(0x000C) (Edit, IsPlainOldData)
	bool                                               bCanTriggerGrenadeDodges;                                 // 0x02B0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDisablePhysicsWhenAttached;                              // 0x02B1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0xE];                                       // 0x02B2(0x000E) MISSED OFFSET
	float                                              InitialProjectileGravity;                                 // 0x02C0(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x02C4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxWeapon.GbxProjectileMovementComponent");
		return ptr;
	}


	void ScaleVelocity(float InScale);
	void OnRep_InitialProjectileGravity();
	void OnProjectilePostLastBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void OnHit(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnBounce(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
};


// Class GbxWeapon.LightProjectileManager
// 0x0168 (0x05C0 - 0x0458)
class ALightProjectileManager : public AActor
{
public:
	TArray<class ULightProjectile*>                    ActiveProjectiles;                                        // 0x0458(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0468(0x0018) MISSED OFFSET
	TArray<class ULightProjectile*>                    ProjectilesWaitingBatch;                                  // 0x0480(0x0010) (ZeroConstructor, Transient)
	TArray<class ULightProjectile*>                    ProjectilePool;                                           // 0x0490(0x0010) (ZeroConstructor, Transient)
	TArray<class UParticleSystemComponent*>            ActiveParticles;                                          // 0x04A0(0x0010) (ExportObject, ZeroConstructor, Transient)
	TArray<struct FLightProjectileParticlePoolData>    ParticlesPool;                                            // 0x04B0(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0xD4];                                      // 0x04C0(0x00D4) MISSED OFFSET
	float                                              MaxAsyncSpawnTime;                                        // 0x0594(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	unsigned char                                      UnknownData02[0x28];                                      // 0x0598(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxWeapon.LightProjectileManager");
		return ptr;
	}


	void ServerSendDebugProjectileImpact(int ProjSyncID, class AActor* HitActor, const struct FName& BoneName, uint16_t ProjFlags);
	void OnParticleSystemFinished(class UParticleSystemComponent* FinishedComponent);
};


// Class GbxWeapon.LightProjectile
// 0x0448 (0x0470 - 0x0028)
class ULightProjectile : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	int                                                SyncID;                                                   // 0x0030(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x74];                                      // 0x0034(0x0074) MISSED OFFSET
	class ULightProjectileData*                        Data;                                                     // 0x00A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	float                                              Damage;                                                   // 0x00B0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	float                                              DamageRadius;                                             // 0x00B4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UClass*                                      DamageType;                                               // 0x00B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UClass*                                      DamageSource;                                             // 0x00C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	float                                              ImpactForce;                                              // 0x00C8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x00CC(0x0018) MISSED OFFSET
	unsigned char                                      bActive : 1;                                              // 0x00E4(0x0001) (Transient)
	unsigned char                                      UnknownData03[0x23];                                      // 0x00E5(0x0023) MISSED OFFSET
	struct FReplicatedLightProjectileInitializationData InitialClientState;                                       // 0x0108(0x00B8) (Net, Transient)
