#pragma once

// Borderlands 3 SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "BL3_GbxAI_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GbxAI.AIActionBase
// 0x00D0 (0x00F8 - 0x0028)
class UAIActionBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnInitializeInstanceEventBP;                              // 0x0030(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0040(0x0018) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCleanupInstanceEventBP;                                 // 0x0058(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0068(0x0018) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStartedEventBP;                                         // 0x0080(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x18];                                      // 0x0090(0x0018) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStoppedEventBP;                                         // 0x00A8(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0x18];                                      // 0x00B8(0x0018) MISSED OFFSET
	struct FAIActionExecutionSettings                  ExecutionSettings;                                        // 0x00D0(0x0008) (Edit)
	unsigned char                                      UnknownData05[0x10];                                      // 0x00D8(0x0010) MISSED OFFSET
	unsigned char                                      BaseVersion;                                              // 0x00E8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x00E9(0x0003) MISSED OFFSET
	uint32_t                                           Version;                                                  // 0x00EC(0x0004) (ZeroConstructor, IsPlainOldData)
	EAIActionCreationMethod                            CreationMethod;                                           // 0x00F0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x7];                                       // 0x00F1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIActionBase");
		return ptr;
	}


	void STATIC_StopBP(class UAIActionBase* Action, const struct FAIActionBlueprintContext& Context, bool bSucceeded);
	class UObject* CreateSubobjectNoName(class UClass* Class);
};


// Class GbxAI.AIAction
// 0x0050 (0x0148 - 0x00F8)
class UAIAction : public UAIActionBase
{
public:
	class UBlackboardData*                             Blackboard;                                               // 0x00F8(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bWaitForAllAspects;                                       // 0x0100(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0101(0x0007) MISSED OFFSET
	TArray<class UAIAspect*>                           Aspects;                                                  // 0x0108(0x0010) (Edit, ExportObject, ZeroConstructor)
	TArray<class UAIAspect*>                           BuiltInAspects;                                           // 0x0118(0x0010) (ExportObject, ZeroConstructor)
	bool                                               bIsChildAction;                                           // 0x0128(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0129(0x0007) MISSED OFFSET
	TArray<class UAIAction*>                           SubActions;                                               // 0x0130(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData02[0x1];                                       // 0x0140(0x0001) MISSED OFFSET
	unsigned char                                      ActionVersion;                                            // 0x0141(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x0142(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction");
		return ptr;
	}


	class UAIAction* CreateSubAction(class UClass* ActionClass, const struct FName& Name);
};


// Class GbxAI.AIAction_Composite
// 0x0018 (0x0160 - 0x0148)
class UAIAction_Composite : public UAIAction
{
public:
	TArray<class UAIAction_CompositeChild*>            Children;                                                 // 0x0148(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      CompositeVersion;                                         // 0x0158(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0159(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Composite");
		return ptr;
	}


	class UAIAction_CompositeChild* CreateChild(const struct FName& ChildName);
};


// Class GbxAI.AIAction_Selector
// 0x0000 (0x0160 - 0x0160)
class UAIAction_Selector : public UAIAction_Composite
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Selector");
		return ptr;
	}

};


// Class GbxAI.AIAction_Sequence
// 0x0088 (0x01E8 - 0x0160)
class UAIAction_Sequence : public UAIAction_Selector
{
public:
	EAIActionSequenceCanStartCheck                     CanStartChecks;                                           // 0x0160(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0161(0x0007) MISSED OFFSET
	struct FGbxParam                                   CanBeInterrupted;                                         // 0x0168(0x0080) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Sequence");
		return ptr;
	}

};


// Class GbxAI.AIAction_GoToPoint
// 0x0DB8 (0x0FA0 - 0x01E8)
class UAIAction_GoToPoint : public UAIAction_Sequence
{
public:
	struct FAIAspectSettings_Location                  LocationSettings;                                         // 0x01E8(0x01E0)
	struct FGbxBlackboardKeySelector                   GoalKey;                                                  // 0x03C8(0x0010) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x03D8(0x0140) (Edit)
	bool                                               bUseNavSettings;                                          // 0x0518(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0519(0x0007) MISSED OFFSET
	class UAITicketDataAsset*                          MoveTicket;                                               // 0x0520(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGbxParam                                   MoveTicketHoldDuration;                                   // 0x0528(0x0080) (Edit)
	struct FGbxParam                                   MoveFailTimeLimit;                                        // 0x05A8(0x0080) (Edit)
	bool                                               bUseMoveFailTimeLimit;                                    // 0x0628(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0629(0x0007) MISSED OFFSET
	struct FGbxBlackboardKeySelector                   QueryKey;                                                 // 0x0630(0x0010)
	struct FAIAspectSettings_EnvQuery                  QuerySettings;                                            // 0x0640(0x03A0) (Edit)
	bool                                               bUseQuery;                                                // 0x09E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x09E1(0x0003) MISSED OFFSET
	float                                              MinOffsetInFrontOfTarget;                                 // 0x09E4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxOffsetInFrontOfTarget;                                 // 0x09E8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OffsetAngle;                                              // 0x09EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseOffsetInFrontOfTarget;                                // 0x09F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x09F1(0x0003) MISSED OFFSET
	float                                              CirclingDistance;                                         // 0x09F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	ECircleDirection                                   Direction;                                                // 0x09F8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRotateAroundTarget;                                      // 0x09F9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x6];                                       // 0x09FA(0x0006) MISSED OFFSET
	struct FGbxBlackboardKeySelector                   CustomRotationTarget;                                     // 0x0A00(0x0010) (Edit)
	bool                                               bUseCustomRotationTarget;                                 // 0x0A10(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0A11(0x0007) MISSED OFFSET
	struct FAIAspectSettings_Rotation                  RotationSettings;                                         // 0x0A18(0x0550) (Edit)
	bool                                               bUseRotation;                                             // 0x0F68(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bTestDirectPath;                                          // 0x0F69(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDebugTestDirectPath;                                     // 0x0F6A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x5];                                       // 0x0F6B(0x0005) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnArrivedEventBP;                                         // 0x0F70(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData07[0x18];                                      // 0x0F80(0x0018) MISSED OFFSET
	unsigned char                                      GoToPointVersion;                                         // 0x0F98(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x0F99(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_GoToPoint");
		return ptr;
	}

};


// Class GbxAI.AIAction_ActionAtPoint
// 0x0798 (0x1738 - 0x0FA0)
class UAIAction_ActionAtPoint : public UAIAction_GoToPoint
{
public:
	struct FAIAspectSettings_GbxAction                 ActionSettings;                                           // 0x0FA0(0x0238) (Edit)
	bool                                               bCheckLocationDuringAction;                               // 0x11D8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseRotationDuringAction;                                 // 0x11D9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseRotationTargetDuringAction;                           // 0x11DA(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x11DB(0x0005) MISSED OFFSET
	struct FAIAspectSettings_Rotation                  ActionRotationSettings;                                   // 0x11E0(0x0550) (Edit)
	bool                                               bUseActionRotation;                                       // 0x1730(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ActionAtPointVersion;                                     // 0x1731(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x1732(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_ActionAtPoint");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction
// 0x0008 (0x0078 - 0x0070)
class UBTTask_AIAction : public UBTTaskNode
{
public:
	class UBTDecorator_AIAction*                       ActionDecorator;                                          // 0x0070(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_ActionAtPoint
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_ActionAtPoint : public UBTTask_AIAction
{
public:
	class UAIAction_ActionAtPoint*                     Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_ActionAtPoint");
		return ptr;
	}

};


// Class GbxAI.AIAction_Priority
// 0x0010 (0x0170 - 0x0160)
class UAIAction_Priority : public UAIAction_Selector
{
public:
	float                                              TryInterruptPeriod;                                       // 0x0160(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TryInterruptInsignificantPeriod;                          // 0x0164(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bInterruptWhileInsignificant;                             // 0x0168(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0169(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Priority");
		return ptr;
	}

};


// Class GbxAI.AIAction_AITree
// 0x0000 (0x0170 - 0x0170)
class UAIAction_AITree : public UAIAction_Priority
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_AITree");
		return ptr;
	}

};


// Class GbxAI.AIAction_Charge
// 0x0018 (0x0FB8 - 0x0FA0)
class UAIAction_Charge : public UAIAction_GoToPoint
{
public:
	struct FAIAspectSettings_Charge                    ChargeSettings;                                           // 0x0FA0(0x0018) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Charge");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_Charge
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_Charge : public UBTTask_AIAction
{
public:
	class UAIAction_Charge*                            Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_Charge");
		return ptr;
	}

};


// Class GbxAI.AIAction_CompositeChild
// 0x0010 (0x0158 - 0x0148)
class UAIAction_CompositeChild : public UAIAction
{
public:
	class UAIAction*                                   Action;                                                   // 0x0148(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bCanCauseParentToStop;                                    // 0x0150(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0151(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_CompositeChild");
		return ptr;
	}


	class UAIAction* CreateAction(class UClass* ActionClass);
};


// Class GbxAI.AIAction_Decorator
// 0x0000 (0x0148 - 0x0148)
class UAIAction_Decorator : public UAIAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Decorator");
		return ptr;
	}

};


// Class GbxAI.AIAction_MoveNode
// 0x0158 (0x02C8 - 0x0170)
class UAIAction_MoveNode : public UAIAction_Priority
{
public:
	struct FGbxBlackboardKeySelector                   NodeKey;                                                  // 0x0170(0x0010) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x0180(0x0140) (Edit)
	unsigned char                                      MoveNodeVersion;                                          // 0x02C0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x02C1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_MoveNode");
		return ptr;
	}

};


// Class GbxAI.AIAction_Dropship
// 0x0000 (0x02C8 - 0x02C8)
class UAIAction_Dropship : public UAIAction_MoveNode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Dropship");
		return ptr;
	}

};


// Class GbxAI.AIAction_Follow
// 0x01E8 (0x0358 - 0x0170)
class UAIAction_Follow : public UAIAction_Priority
{
public:
	struct FAIAspectSettings_Follow                    Settings;                                                 // 0x0170(0x0038) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x01A8(0x0140) (Edit)
	struct FAIAspectSettings_FindClosestPlayer         FindClosestPlayerSettings;                                // 0x02E8(0x0020) (Edit)
	bool                                               bFindClosestPlayer;                                       // 0x0308(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0309(0x0007) MISSED OFFSET
	struct FGbxBlackboardKeySelector                   TeleportTarget;                                           // 0x0310(0x0010)
	struct FGbxBlackboardKeySelector                   MoveTarget;                                               // 0x0320(0x0010)
	struct FGbxBlackboardKeySelector                   Distance;                                                 // 0x0330(0x0010)
	struct FGbxBlackboardKeySelector                   BodyDirection;                                            // 0x0340(0x0010)
	unsigned char                                      FollowVersion;                                            // 0x0350(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0351(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Follow");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_GoToPoint
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_GoToPoint : public UBTTask_AIAction
{
public:
	class UAIAction_GoToPoint*                         Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_GoToPoint");
		return ptr;
	}

};


// Class GbxAI.AIAction_Land
// 0x0388 (0x0570 - 0x01E8)
class UAIAction_Land : public UAIAction_Sequence
{
public:
	struct FAIAspectSettings_FlyToNavMesh              FlyToNavMeshSettings;                                     // 0x01E8(0x0010) (Edit)
	struct FAIAspectSettings_GbxAction                 AnimSettings;                                             // 0x01F8(0x0238) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x0430(0x0140) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Land");
		return ptr;
	}

};


// Class GbxAI.AIAction_LeadRoute
// 0x01F8 (0x0368 - 0x0170)
class UAIAction_LeadRoute : public UAIAction_Priority
{
public:
	struct FAIAspectSettings_LeadRoute                 LeadSettings;                                             // 0x0170(0x0050) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x01C0(0x0140) (Edit)
	struct FAIAspectSettings_FindClosestPlayer         FindClosestPlayerSettings;                                // 0x0300(0x0020) (Edit)
	struct FGbxBlackboardKeySelector                   MoveTarget;                                               // 0x0320(0x0010)
	struct FGbxBlackboardKeySelector                   Distance;                                                 // 0x0330(0x0010)
	struct FGbxBlackboardKeySelector                   TeleportTarget;                                           // 0x0340(0x0010)
	struct FGbxBlackboardKeySelector                   UnusedKey;                                                // 0x0350(0x0010)
	unsigned char                                      LeadRouteVersion;                                         // 0x0360(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0361(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_LeadRoute");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_LeadRoute
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_LeadRoute : public UBTTask_AIAction
{
public:
	class UAIAction_LeadRoute*                         Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_LeadRoute");
		return ptr;
	}

};


// Class GbxAI.AIAction_Leap
// 0x0058 (0x0FF8 - 0x0FA0)
class UAIAction_Leap : public UAIAction_GoToPoint
{
public:
	struct FAIAspectSettings_Leap                      LeapSettings;                                             // 0x0FA0(0x0058) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Leap");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_Leap
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_Leap : public UBTTask_AIAction
{
public:
	class UAIAction_Leap*                              Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_Leap");
		return ptr;
	}

};


// Class GbxAI.AIAction_LeapDirect
// 0x0400 (0x0548 - 0x0148)
class UAIAction_LeapDirect : public UAIAction
{
public:
	struct FAIAspectSettings_Leap                      LeapSettings;                                             // 0x0148(0x0058) (Edit)
	struct FAIAspectSettings_EnvQuery                  QuerySettings;                                            // 0x01A0(0x03A0) (Edit)
	bool                                               bUseQuery;                                                // 0x0540(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0541(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_LeapDirect");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_LeapDirect
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_LeapDirect : public UBTTask_AIAction
{
public:
	class UAIAction_LeapDirect*                        Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_LeapDirect");
		return ptr;
	}

};


// Class GbxAI.AIAction_LookAroundRandomly
// 0x0020 (0x0168 - 0x0148)
class UAIAction_LookAroundRandomly : public UAIAction
{
public:
	struct FLookAroundRandomlySettings                 Settings;                                                 // 0x0148(0x000C) (Edit)
	unsigned char                                      UnknownData00[0x14];                                      // 0x0154(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_LookAroundRandomly");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_MoveNode
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_MoveNode : public UBTTask_AIAction
{
public:
	class UAIAction_MoveNode*                          Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_MoveNode");
		return ptr;
	}

};


// Class GbxAI.AIAction_MoveSpline
// 0x0190 (0x02D8 - 0x0148)
class UAIAction_MoveSpline : public UAIAction
{
public:
	struct FAIAspectSettings_MoveSpline                MoveSplineSettings;                                       // 0x0148(0x0050) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x0198(0x0140) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_MoveSpline");
		return ptr;
	}


	bool STATIC_SetupMoveSpline(class AActor* TargetActor, class UObject* TargetSpline, float Offset, bool bIsReverse);
	bool STATIC_ChangeSplineOffset(class AActor* TargetActor, float Offset);
};


// Class GbxAI.AIAction_OnAggro
// 0x0478 (0x0660 - 0x01E8)
class UAIAction_OnAggro : public UAIAction_Sequence
{
public:
	bool                                               bRotateBeforeAction;                                      // 0x01E8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRotateDuringAction;                                      // 0x01E9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x01EA(0x0006) MISSED OFFSET
	struct FAIAspectSettings_GbxAction                 ActionWhenFirstNoticer;                                   // 0x01F0(0x0238) (Edit)
	struct FAIAspectSettings_GbxAction                 ActionWhenSecondNoticer;                                  // 0x0428(0x0238) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_OnAggro");
		return ptr;
	}

};


// Class GbxAI.AIAction_Orbit
// 0x08B0 (0x09F8 - 0x0148)
class UAIAction_Orbit : public UAIAction
{
public:
	struct FAIAspectSettings_Orbit                     OrbitSettings;                                            // 0x0148(0x0220) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x0368(0x0140) (Edit)
	struct FAIAspectSettings_Rotation                  RotationSettings;                                         // 0x04A8(0x0550) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Orbit");
		return ptr;
	}

};


// Class GbxAI.AIAction_Parallel
// 0x0008 (0x0168 - 0x0160)
class UAIAction_Parallel : public UAIAction_Composite
{
public:
	bool                                               bWaitForAllChildren;                                      // 0x0160(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0161(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Parallel");
		return ptr;
	}

};


// Class GbxAI.AIAction_ParallelChild
// 0x0008 (0x0160 - 0x0158)
class UAIAction_ParallelChild : public UAIAction_CompositeChild
{
public:
	bool                                               bCanPreventActionFromStarting;                            // 0x0158(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanCauseActionToSucceed;                                 // 0x0159(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanCauseActionToFail;                                    // 0x015A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMustFinish;                                              // 0x015B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x015C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_ParallelChild");
		return ptr;
	}

};


// Class GbxAI.AIAction_Plan
// 0x0020 (0x0208 - 0x01E8)
class UAIAction_Plan : public UAIAction_Sequence
{
public:
	struct FAIActionSettings_Plan                      Settings;                                                 // 0x01E8(0x0020) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Plan");
		return ptr;
	}

};


// Class GbxAI.AIAction_PlayGbxAction
// 0x0238 (0x0380 - 0x0148)
class UAIAction_PlayGbxAction : public UAIAction
{
public:
	struct FAIAspectSettings_GbxAction                 ActionSettings;                                           // 0x0148(0x0238) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_PlayGbxAction");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_PlayGbxAction
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_PlayGbxAction : public UBTTask_AIAction
{
public:
	class UAIAction_PlayGbxAction*                     Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_PlayGbxAction");
		return ptr;
	}

};


// Class GbxAI.AIAction_Random
// 0x0008 (0x0168 - 0x0160)
class UAIAction_Random : public UAIAction_Selector
{
public:
	bool                                               bUseCumulativeInverseWeight;                              // 0x0160(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0161(0x0003) MISSED OFFSET
	float                                              ResetRunCountTime;                                        // 0x0164(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Random");
		return ptr;
	}

};


// Class GbxAI.AIAction_RandomChild
// 0x0010 (0x0168 - 0x0158)
class UAIAction_RandomChild : public UAIAction_CompositeChild
{
public:
	float                                              Weight;                                                   // 0x0158(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MaxRunCount;                                              // 0x015C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseMaxRunCount;                                          // 0x0160(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0161(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_RandomChild");
		return ptr;
	}

};


// Class GbxAI.AIAction_Route
// 0x01E0 (0x03C8 - 0x01E8)
class UAIAction_Route : public UAIAction_Sequence
{
public:
	struct FAIAspectSettings_Route                     RouteSettings;                                            // 0x01E8(0x0028) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x0210(0x0140) (Edit)
	struct FGbxBlackboardKeySelector                   SmartAction;                                              // 0x0350(0x0010)
	struct FGbxBlackboardKeySelector                   MoveTarget;                                               // 0x0360(0x0010)
	struct FGbxBlackboardKeySelector                   Distance;                                                 // 0x0370(0x0010)
	struct FGbxBlackboardKeySelector                   BodyEnable;                                               // 0x0380(0x0010)
	struct FGbxBlackboardKeySelector                   BodyTarget;                                               // 0x0390(0x0010)
	struct FGbxBlackboardKeySelector                   LookEnable;                                               // 0x03A0(0x0010)
	struct FGbxBlackboardKeySelector                   LookTarget;                                               // 0x03B0(0x0010)
	unsigned char                                      RouteVersion;                                             // 0x03C0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x03C1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Route");
		return ptr;
	}

};


// Class GbxAI.BTTask_AIAction_Route
// 0x0008 (0x0080 - 0x0078)
class UBTTask_AIAction_Route : public UBTTask_AIAction
{
public:
	class UAIAction_Route*                             Action;                                                   // 0x0078(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.BTTask_AIAction_Route");
		return ptr;
	}

};


// Class GbxAI.AIAction_UseCover
// 0x0E98 (0x1008 - 0x0170)
class UAIAction_UseCover : public UAIAction_Priority
{
public:
	bool                                               bCanShootWhileMoving;                                     // 0x0170(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UseCoverVersion;                                          // 0x0171(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0172(0x0006) MISSED OFFSET
	struct FAIAspectSettings_UseCover                  CoverSettings;                                            // 0x0178(0x0138) (Edit)
	struct FEnvQueryParams                             CoverQuery;                                               // 0x02B0(0x00B8) (Edit)
	struct FGbxQueryOptions                            CoverQueryOptions;                                        // 0x0368(0x0238) (Edit)
	struct FAIAspectSettings_Weapon                    WeaponSettings;                                           // 0x05A0(0x03D0) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x0970(0x0140) (Edit)
	struct FAIAspectSettings_Rotation                  MovingRotationSettings;                                   // 0x0AB0(0x0550) (Edit)
	bool                                               bRotateDuringMovement;                                    // 0x1000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x1001(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_UseCover");
		return ptr;
	}

};


// Class GbxAI.AIAction_SimpleCover
// 0x01B8 (0x11C0 - 0x1008)
class UAIAction_SimpleCover : public UAIAction_UseCover
{
public:
	bool                                               bTakeRangesFromWeapon;                                    // 0x1008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x1009(0x0007) MISSED OFFSET
	struct FGbxParam                                   MinRange;                                                 // 0x1010(0x0080) (Edit)
	struct FGbxParam                                   IdealRange;                                               // 0x1090(0x0080) (Edit)
	struct FGbxParam                                   MaxRange;                                                 // 0x1110(0x0080) (Edit)
	TArray<class UEnvQueryTestAsset*>                  AdditionalTests;                                          // 0x1190(0x0010) (Edit, ZeroConstructor)
	struct FSoftObjectPath                             DefaultEnvQuery;                                          // 0x11A0(0x0018) (Config, GlobalConfig)
	unsigned char                                      SimpleCoverVersion;                                       // 0x11B8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x11B9(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_SimpleCover");
		return ptr;
	}

};


// Class GbxAI.AIAction_WeaponAtPoint
// 0x0460 (0x1400 - 0x0FA0)
class UAIAction_WeaponAtPoint : public UAIAction_GoToPoint
{
public:
	bool                                               bCanShootWhileMoving;                                     // 0x0FA0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0FA1(0x0007) MISSED OFFSET
	struct FAIAspectSettings_Weapon                    WeaponSettings;                                           // 0x0FA8(0x03D0) (Edit)
	struct FGbxParam                                   HoldDuration;                                             // 0x1378(0x0080) (Edit)
	bool                                               bUseHoldDuration;                                         // 0x13F8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      WeaponAtPointVersion;                                     // 0x13F9(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x13FA(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_WeaponAtPoint");
		return ptr;
	}

};


// Class GbxAI.AIAction_SimpleHide
// 0x05F8 (0x19F8 - 0x1400)
class UAIAction_SimpleHide : public UAIAction_WeaponAtPoint
{
public:
	struct FGbxParam                                   MinRange;                                                 // 0x1400(0x0080) (Edit)
	struct FGbxParam                                   IdealRange;                                               // 0x1480(0x0080) (Edit)
	struct FGbxParam                                   MaxRange;                                                 // 0x1500(0x0080) (Edit)
	struct FGbxParam                                   FaceTarget;                                               // 0x1580(0x0080) (Edit)
	struct FGbxParam                                   CanUseWeaponWhileMoving;                                  // 0x1600(0x0080) (Edit)
	TArray<class UGbxWeaponSlotData*>                  WeaponSlots;                                              // 0x1680(0x0010) (Edit, ZeroConstructor)
	struct FGbxParam                                   WeaponUseModeIndex;                                       // 0x1690(0x0080) (Edit)
	struct FGbxParam                                   HideDuration;                                             // 0x1710(0x0080) (Edit)
	struct FAIAspectSettings_GbxAction                 HideActionSettings;                                       // 0x1790(0x0238) (Edit)
	bool                                               bUseHideAction;                                           // 0x19C8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x19C9(0x0007) MISSED OFFSET
	struct FSoftObjectPath                             DefaultEnvQuery;                                          // 0x19D0(0x0018) (Config, GlobalConfig)
	class UEnvQuery*                                   DefaultEnvQueryAsset;                                     // 0x19E8(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      SimpleHideVersion;                                        // 0x19F0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x19F1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_SimpleHide");
		return ptr;
	}

};


// Class GbxAI.AIAction_SimpleMelee
// 0x04E0 (0x1C18 - 0x1738)
class UAIAction_SimpleMelee : public UAIAction_ActionAtPoint
{
public:
	class UClass*                                      MeleeAction;                                              // 0x1738(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FAIAspectSettings_GbxAction                 MeleeActionSettings;                                      // 0x1740(0x0238) (Edit)
	bool                                               bCanMove;                                                 // 0x1978(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x1979(0x0007) MISSED OFFSET
	struct FGbxParam                                   ReachedHeight;                                            // 0x1980(0x0080) (Edit)
	struct FGbxParam                                   ReachedDistance;                                          // 0x1A00(0x0080) (Edit)
	EMeleeRotationOption                               FacingPolicyDuringAction;                                 // 0x1A80(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x1A81(0x0007) MISSED OFFSET
	struct FGbxParam                                   OverrideAngle;                                            // 0x1A88(0x0080) (Edit)
	bool                                               bUseOverrideAngle;                                        // 0x1B08(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAlignBodyWithTarget;                                     // 0x1B09(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bKeepFacingTargetOnStop;                                  // 0x1B0A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bStopWhenReached;                                         // 0x1B0B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCanStartWhenGoalIsUncertain;                             // 0x1B0C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x1B0D(0x0003) MISSED OFFSET
	struct FGbxParam                                   Count;                                                    // 0x1B10(0x0080) (Edit)
	struct FGbxParam                                   PlayRate;                                                 // 0x1B90(0x0080) (Edit)
	bool                                               bCanBeInterrupted;                                        // 0x1C10(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      MeleeActionVersion;                                       // 0x1C11(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x1C12(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_SimpleMelee");
		return ptr;
	}

};


// Class GbxAI.AIAction_SimpleRangedAttack
// 0x03F0 (0x1B28 - 0x1738)
class UAIAction_SimpleRangedAttack : public UAIAction_ActionAtPoint
{
public:
	struct FGbxParam                                   MinRange;                                                 // 0x1738(0x0080) (Edit)
	struct FGbxParam                                   IdealRange;                                               // 0x17B8(0x0080) (Edit)
	struct FGbxParam                                   MaxRange;                                                 // 0x1838(0x0080) (Edit)
	struct FGbxParam                                   MinRepositionDistance;                                    // 0x18B8(0x0080) (Edit)
	TArray<class UEnvQueryTestAsset*>                  AdditionalTests;                                          // 0x1938(0x0010) (Edit, ZeroConstructor)
	float                                              SphereTraceExtent;                                        // 0x1948(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDoArcTrace;                                              // 0x194C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x194D(0x0003) MISSED OFFSET
	struct FGbxParam                                   ArcSpeed;                                                 // 0x1950(0x0080) (Edit)
	struct FGbxParam                                   ArcAnglePercent;                                          // 0x19D0(0x0080) (Edit)
	struct FGbxParam                                   OverrideAngle;                                            // 0x1A50(0x0080) (Edit)
	bool                                               bUseOverrideAngle;                                        // 0x1AD0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EMeleeRotationOption                               FacingPolicyDuringAction;                                 // 0x1AD1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAlignBodyWithTarget;                                     // 0x1AD2(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bKeepFacingTargetOnStop;                                  // 0x1AD3(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDistanceToTargetTestShouldFilterOnly;                    // 0x1AD4(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x1AD5(0x0003) MISSED OFFSET
	struct FSoftObjectPath                             DefaultEnvQuery;                                          // 0x1AD8(0x0018) (Config, GlobalConfig)
	struct FSoftObjectPath                             DefaultTraceTests;                                        // 0x1AF0(0x0018) (Config, GlobalConfig)
	class UEnvQuery*                                   DefaultEnvQueryAsset;                                     // 0x1B08(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEnvQuery*                                   DefaultTraceTestsAsset;                                   // 0x1B10(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEnvQueryTest_Trace*                         TraceTestInstance;                                        // 0x1B18(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      SimpleRangedAttackVersion;                                // 0x1B20(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x1B21(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_SimpleRangedAttack");
		return ptr;
	}

};


// Class GbxAI.AIAction_SimpleWeapon
// 0x0620 (0x1A20 - 0x1400)
class UAIAction_SimpleWeapon : public UAIAction_WeaponAtPoint
{
public:
	struct FGbxParam                                   CanUseWeaponWhileMoving;                                  // 0x1400(0x0080) (Edit)
	bool                                               bTakeRangesFromWeapon;                                    // 0x1480(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x1481(0x0007) MISSED OFFSET
	struct FGbxParam                                   MinRange;                                                 // 0x1488(0x0080) (Edit)
	struct FGbxParam                                   IdealRange;                                               // 0x1508(0x0080) (Edit)
	struct FGbxParam                                   MaxRange;                                                 // 0x1588(0x0080) (Edit)
	TArray<class UEnvQueryTestAsset*>                  AdditionalTests;                                          // 0x1608(0x0010) (Edit, ZeroConstructor)
	TArray<class UGbxWeaponSlotData*>                  WeaponSlots;                                              // 0x1618(0x0010) (Edit, ZeroConstructor)
	struct FGbxParam                                   WeaponUseModeIndex;                                       // 0x1628(0x0080) (Edit)
	struct FGbxParam                                   BurstCountOverride;                                       // 0x16A8(0x0080) (Edit)
	bool                                               bOverrideBurstCount;                                      // 0x1728(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x1729(0x0007) MISSED OFFSET
	struct FGbxParam                                   BurstDelayOverride;                                       // 0x1730(0x0080) (Edit)
	bool                                               bOverrideBurstDelay;                                      // 0x17B0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x17B1(0x0007) MISSED OFFSET
	struct FGbxParam                                   AccuracyOverride;                                         // 0x17B8(0x0080) (Edit)
	bool                                               bOverrideAccuracy;                                        // 0x1838(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x1839(0x0007) MISSED OFFSET
	struct FGbxParam                                   SuppressingFireTime;                                      // 0x1840(0x0080) (Edit)
	bool                                               bUseSuppressingFireTime;                                  // 0x18C0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseRepositionTicket;                                     // 0x18C1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x6];                                       // 0x18C2(0x0006) MISSED OFFSET
	struct FGbxParam                                   MinRepositionDistance;                                    // 0x18C8(0x0080) (Edit)
	class UAITicketDataAsset*                          RepositionTicket;                                         // 0x1948(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGbxParam                                   TimeToStayAtSpotWhileShooting;                            // 0x1950(0x0080) (Edit)
	bool                                               bDistanceToTargetTestShouldFilterOnly;                    // 0x19D0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x19D1(0x0007) MISSED OFFSET
	struct FSoftObjectPath                             DefaultEnvQuery;                                          // 0x19D8(0x0018) (Config, GlobalConfig)
	struct FSoftObjectPath                             DefaultRepositionTicket;                                  // 0x19F0(0x0018) (Config, GlobalConfig)
	class UEnvQuery*                                   DefaultEnvQueryAsset;                                     // 0x1A08(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAITicketDataAsset*                          DefaultRepositionTicketAsset;                             // 0x1A10(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      SimpleWeaponVersion;                                      // 0x1A18(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x1A19(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_SimpleWeapon");
		return ptr;
	}

};


// Class GbxAI.AIAction_StateMachine
// 0x0000 (0x0160 - 0x0160)
class UAIAction_StateMachine : public UAIAction_Selector
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_StateMachine");
		return ptr;
	}

};


// Class GbxAI.AIAction_StateMachineChild
// 0x0010 (0x0168 - 0x0158)
class UAIAction_StateMachineChild : public UAIAction_CompositeChild
{
public:
	class UAIAction_StateMachineChild*                 OnSuccess;                                                // 0x0158(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAIAction_StateMachineChild*                 OnFailure;                                                // 0x0160(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_StateMachineChild");
		return ptr;
	}


	void GetAvailableStates(TArray<class UAIAction_StateMachineChild*>* Array);
};


// Class GbxAI.AIAction_Sweep
// 0x00A8 (0x0AA0 - 0x09F8)
class UAIAction_Sweep : public UAIAction_Orbit
{
public:
	struct FAIAspectSettings_Sweep                     SweepSettings;                                            // 0x09F8(0x00A8)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Sweep");
		return ptr;
	}

};


// Class GbxAI.AIAction_Swoop
// 0x1468 (0x1650 - 0x01E8)
class UAIAction_Swoop : public UAIAction_Sequence
{
public:
	struct FAIAspectSettings_Swoop                     SwoopSettings;                                            // 0x01E8(0x0320) (Edit)
	struct FAIAspectSettings_Navigation                NavSettings;                                              // 0x0508(0x0140) (Edit)
	struct FAIAspectSettings_Rotation                  MoveFarRotationSettings;                                  // 0x0648(0x0550) (Edit)
	bool                                               bUseFarRotation;                                          // 0x0B98(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0B99(0x0007) MISSED OFFSET
	struct FAIAspectSettings_Rotation                  MoveNearRotationSettings;                                 // 0x0BA0(0x0550) (Edit)
	bool                                               bUseNearRotation;                                         // 0x10F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x10F1(0x0007) MISSED OFFSET
	struct FAIAspectSettings_Rotation                  MovePassRotationSettings;                                 // 0x10F8(0x0550) (Edit)
	bool                                               bUsePassRotation;                                         // 0x1648(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x1649(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxAI.AIAction_Swoop");
		return ptr;
	}

};


// Class GbxAI.AIAction_TargetSequence
// 0x0198 (0x0380 - 0x01E8)
class UAIAction_TargetSequence : public UAIAction_Sequence
{
public:
	struct FGbxParam                                   TargetCountMin;                                           // 0x01E8(0x0080) (Edit)
	bool                                               bUseTargetCountMin;                                       // 0x0268(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
