#pragma once

// Borderlands 3 SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "BL3_Basic.hpp"
#include "BL3_CoreUObject_classes.hpp"
#include "BL3_Engine_classes.hpp"
#include "BL3_GbxGameSystemCore_classes.hpp"
#include "BL3_GbxNav_classes.hpp"
#include "BL3_GameplayTasks_classes.hpp"
#include "BL3_AIModule_classes.hpp"
#include "BL3_GameplayTags_classes.hpp"
#include "BL3_GbxRuntime_classes.hpp"
#include "BL3_GbxSpawn_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum GbxAI.EAIActionResult
enum class EAIActionResult : uint8_t
{
	None                           = 0,
	Succeeded                      = 1,
	Failed                         = 2,
	Interrupted                    = 3,
	Aborted                        = 4,
	Count                          = 5,
	EAIActionResult_MAX            = 6
};


// Enum GbxAI.ECoverUserAnimState
enum class ECoverUserAnimState : uint8_t
{
	None                           = 0,
	Idle                           = 1,
	Exit                           = 2,
	FireIdle                       = 3,
	FireEnter                      = 4,
	FireExit                       = 5,
	FireToIdle                     = 6,
	Transition                     = 7,
	ViewSwitch                     = 8,
	ECoverUserAnimState_MAX        = 9
};


// Enum GbxAI.EScriptedActionRule
enum class EScriptedActionRule : uint8_t
{
	Any                            = 0,
	All                            = 1,
	EScriptedActionRule_MAX        = 2
};


// Enum GbxAI.ESmartActionResult
enum class ESmartActionResult : uint8_t
{
	Success                        = 0,
	Interrupt                      = 1,
	Unreserve                      = 2,
	ESmartActionResult_MAX         = 3
};


// Enum GbxAI.EMeleeRotationOption
enum class EMeleeRotationOption : uint8_t
{
	HoldStill                      = 0,
	AlignToTarget                  = 1,
	FollowTarget                   = 2,
	EMeleeRotationOption_MAX       = 3
};


// Enum GbxAI.EAIActionSequenceCanStartCheck
enum class EAIActionSequenceCanStartCheck : uint8_t
{
	FirstChild                     = 0,
	EachChild                      = 1,
	EAIActionSequenceCanStartCheck_MAX = 2
};


// Enum GbxAI.EAIActionCreationMethod
enum class EAIActionCreationMethod : uint8_t
{
	Unknown                        = 0,
	Composition                    = 1,
	PropertyPanel                  = 2,
	Graph                          = 3,
	EAIActionCreationMethod_MAX    = 4
};


// Enum GbxAI.EAIActionResultTransition
enum class EAIActionResultTransition : uint8_t
{
	Stop                           = 0,
	Continue                       = 1,
	Restart                        = 2,
	EAIActionResultTransition_MAX  = 3
};


// Enum GbxAI.EAIActionResultDirective
enum class EAIActionResultDirective : uint8_t
{
	Continue                       = 0,
	Succeed                        = 1,
	Fail                           = 2,
	EAIActionResultDirective_MAX   = 3
};


// Enum GbxAI.EAIActionExecutionStage
enum class EAIActionExecutionStage : uint8_t
{
	Starting                       = 0,
	Running                        = 1,
	Stopping                       = 2,
	Stopped                        = 3,
	CleaningUp                     = 4,
	EAIActionExecutionStage_MAX    = 5
};


// Enum GbxAI.EAIActionState
enum class EAIActionState : uint8_t
{
	Idle                           = 0,
	Starting                       = 1,
	Running                        = 2,
	Stopped                        = 3,
	EAIActionState_MAX             = 4
};


// Enum GbxAI.EAIActionLayer
enum class EAIActionLayer : uint8_t
{
	Default                        = 0,
	Script                         = 1,
	Count                          = 2,
	EAIActionLayer_MAX             = 3
};


// Enum GbxAI.EAIGroupConditionType
enum class EAIGroupConditionType : uint8_t
{
	AllFalse                       = 0,
	AllTrue                        = 1,
	SomeFalse                      = 2,
	SomeTrue                       = 3,
	EAIGroupConditionType_MAX      = 4
};


// Enum GbxAI.ECircleDirection
enum class ECircleDirection : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	Random                         = 2,
	ECircleDirection_MAX           = 3
};


// Enum GbxAI.EGbxQueryPreset
enum class EGbxQueryPreset : uint8_t
{
	UseBestLocation                = 0,
	TryCurrentLocation             = 1,
	OnlyCurrentLocation            = 2,
	QueryFrequencyLow              = 3,
	QueryOnStart                   = 4,
	EGbxQueryPreset_MAX            = 5
};


// Enum GbxAI.ECompareMethod
enum class ECompareMethod : uint8_t
{
	Equals                         = 0,
	NotEquals                      = 1,
	Smaller                        = 2,
	SmallerOrEqual                 = 3,
	Greater                        = 4,
	GreaterOrEqual                 = 5,
	ECompareMethod_MAX             = 6
};


// Enum GbxAI.EIsInRangeAspectDistanceTest
enum class EIsInRangeAspectDistanceTest : uint8_t
{
	Direct                         = 0,
	Horizontal                     = 1,
	Vertical                       = 2,
	VerticalOffset                 = 3,
	Count                          = 4,
	EIsInRangeAspectDistanceTest_MAX = 5
};


// Enum GbxAI.EOrbitDirection
enum class EOrbitDirection : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	Random                         = 2,
	EOrbitDirection_MAX            = 3
};


// Enum GbxAI.EAIAspectSettingsDefaults_Rotation
enum class EAIAspectSettingsDefaults_Rotation : uint8_t
{
	Custom                         = 0,
	None                           = 1,
	NoBodyRotationAllowed          = 2,
	FullBody                       = 3,
	AimOffsetsOnly                 = 4,
	FullBodyWithAim                = 5,
	EAIAspectSettingsDefaults_MAX  = 6
};


// Enum GbxAI.EAIAspectSettingsDefaults_Rotation_BodyHeadingOffset
enum class EAIAspectSettingsDefaults_Rotation_BodyHeadingOffset : uint8_t
{
	Front                          = 0,
	Back                           = 1,
	Left                           = 2,
	Right                          = 3,
	Custom                         = 4,
	EAIAspectSettingsDefaults_Rotation_MAX = 5
};


// Enum GbxAI.ESweepDirection
enum class ESweepDirection : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	Random                         = 2,
	ESweepDirection_MAX            = 3
};


// Enum GbxAI.ECloakAction
enum class ECloakAction : uint8_t
{
	OnStart                        = 0,
	OnStop                         = 1,
	ECloakAction_MAX               = 2
};


// Enum GbxAI.EPlanMemberReplacement
enum class EPlanMemberReplacement : uint8_t
{
	AbandonPlanIfKilled            = 0,
	ReplaceMemberIfKilled          = 1,
	DoNotReplaceAndKeepGoing       = 2,
	EPlanMemberReplacement_MAX     = 3
};


// Enum GbxAI.EPlanValidityCode
enum class EPlanValidityCode : uint8_t
{
	Unknown                        = 0,
	PlanIsValid                    = 1,
	NoPlanData                     = 2,
	NotEnoughRoleSlots             = 3,
	MissingRoleTag                 = 4,
	BadPlanInstanceNumber          = 5,
	BadMinMaxRoleInstanceNumbers   = 6,
	BadDistanceValues              = 7,
	InsufficientCandidates         = 8,
	EPlanValidityCode_MAX          = 9
};


// Enum GbxAI.EPlanStage
enum class EPlanStage : uint8_t
{
	NeedLeader                     = 0,
	NeedFollowers                  = 1,
	HasMinimumRoster               = 2,
	HasFullRoster                  = 3,
	EveryoneCheckedIn              = 4,
	ShuttingDown                   = 5,
	EPlanStage_MAX                 = 6
};


// Enum GbxAI.ESmartObjectLookAtRule
enum class ESmartObjectLookAtRule : uint8_t
{
	None                           = 0,
	ActorCenter                    = 1,
	ActorEyes                      = 2,
	ActorSocket                    = 3,
	ESmartObjectLookAtRule_MAX     = 4
};


// Enum GbxAI.ESlotAlignRule
enum class ESlotAlignRule : uint8_t
{
	None                           = 0,
	Center                         = 1,
	Align                          = 2,
	ESlotAlignRule_MAX             = 3
};


// Enum GbxAI.ESmartObjectNotify
enum class ESmartObjectNotify : uint8_t
{
	LerpToSlot                     = 0,
	LerpToGround                   = 1,
	ESmartObjectNotify_MAX         = 2
};


// Enum GbxAI.ECoverFaceDirection
enum class ECoverFaceDirection : uint8_t
{
	Toward                         = 0,
	Away                           = 1,
	ECoverFaceDirection_MAX        = 2
};


// Enum GbxAI.ECoverAdjustFailReason
enum class ECoverAdjustFailReason : uint8_t
{
	None                           = 0,
	NoRoom                         = 1,
	NoView                         = 2,
	Invalid                        = 3,
	ECoverAdjustFailReason_MAX     = 4
};


// Enum GbxAI.ECoverSlotHeight
enum class ECoverSlotHeight : uint8_t
{
	Low                            = 0,
	High                           = 1,
	ECoverSlotHeight_MAX           = 2
};


// Enum GbxAI.ECoverStyleAnimType
enum class ECoverStyleAnimType : uint8_t
{
	TimedMoveOut                   = 0,
	TimedStayIn                    = 1,
	SingleAnim                     = 2,
	ECoverStyleAnimType_MAX        = 3
};


// Enum GbxAI.ECoverUserState
enum class ECoverUserState : uint8_t
{
	NotInCover                     = 0,
	Idling                         = 1,
	Firing                         = 2,
	ECoverUserState_MAX            = 3
};


// Enum GbxAI.ETerritoryMovementType
enum class ETerritoryMovementType : uint8_t
{
	Ground                         = 0,
	Flight                         = 1,
	Dynamic                        = 2,
	ETerritoryMovementType_MAX     = 3
};


// Enum GbxAI.EUberTraceMultiTraceRequirement
enum class EUberTraceMultiTraceRequirement : uint8_t
{
	AtLeastOneMustPassTest         = 0,
	AllMustPassTest                = 1,
	EUberTraceMultiTraceRequirement_MAX = 2
};


// Enum GbxAI.ENavJumpStage
enum class ENavJumpStage : uint8_t
{
	None                           = 0,
	Enter                          = 1,
	Idle                           = 2,
	Exit                           = 3,
	End                            = 4,
	ENavJumpStage_MAX              = 5
};


// Enum GbxAI.ENavJumpRotation
enum class ENavJumpRotation : uint8_t
{
	None                           = 0,
	FaceJumpOrigin                 = 1,
	FaceJumpTarget                 = 2,
	FaceJumpTargetFaceDir          = 3,
	ENavJumpRotation_MAX           = 4
};


// Enum GbxAI.ELookAtPointType
enum class ELookAtPointType : uint8_t
{
	Interrupt                      = 0,
	Persist                        = 1,
	Any                            = 2,
	ELookAtPointType_MAX           = 3
};


// Enum GbxAI.ESmartObjectTaskState
enum class ESmartObjectTaskState : uint8_t
{
	Uninitialized                  = 0,
	Movement                       = 1,
	Alignment                      = 2,
	Usage                          = 3,
	Complete                       = 4,
	ESmartObjectTaskState_MAX      = 5
};


// Enum GbxAI.ESmartObjectTaskResult
enum class ESmartObjectTaskResult : uint8_t
{
	Aborted                        = 0,
	Failed                         = 1,
	Succeeded                      = 2,
	ESmartObjectTaskResult_MAX     = 3
};


// Enum GbxAI.ESmartObjectUseResult
enum class ESmartObjectUseResult : uint8_t
{
	Failure                        = 0,
	Running                        = 1,
	Blocking                       = 2,
	Success                        = 3,
	ESmartObjectUseResult_MAX      = 4
};


// Enum GbxAI.EInitialPathAction
enum class EInitialPathAction : uint8_t
{
	None                           = 0,
	PatrolPath                     = 1,
	ScriptedPath                   = 2,
	ScriptedRoute                  = 3,
	ScriptedWait                   = 4,
	EInitialPathAction_MAX         = 5
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct GbxAI.AIActionExecutionSettings
// 0x0008
struct FAIActionExecutionSettings
{
	bool                                               bEnabled;                                                 // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EAIActionResultTransition                          SuccessTransition;                                        // 0x0001(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EAIActionResultTransition                          FailureTransition;                                        // 0x0002(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAlwaysReportSuccess;                                     // 0x0003(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CheckCanStartPeriod;                                      // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxAI.AIActionBlueprintContext
// 0x0018
struct FAIActionBlueprintContext
{
	class AGbxAIController*                            Controller;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Move
// 0x0008
struct FAIAspectSettings_Move
{
	float                                              PathUpdateThreshold;                                      // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bStopWhenInPosition;                                      // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowStrafe;                                             // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowPartialPath;                                        // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRequireDirectPath;                                       // 0x0007(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxAI.AIAspectSettings_Location
// 0x01E0
struct FAIAspectSettings_Location
{
	struct FGbxBlackboardKeySelector                   Target;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible)
	EAIActionResultTransition                          TargetChangeTransition;                                   // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	struct FGbxParam                                   Distance;                                                 // 0x0018(0x0080) (Edit, BlueprintVisible)
	struct FEnvQueryParams                             TargetQuery;                                              // 0x0098(0x00B8) (Edit, BlueprintVisible)
	struct FGbxParam                                   TargetQueryPeriod;                                        // 0x0150(0x0080) (Edit, BlueprintVisible)
	bool                                               bUseTargetQuery;                                          // 0x01D0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x01D1(0x0003) MISSED OFFSET
	struct FAIAspectSettings_Move                      MoveSettings;                                             // 0x01D4(0x0008) (Edit, BlueprintVisible)
	bool                                               bCanMove;                                                 // 0x01DC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x01DD(0x0003) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_NavigationAdvanced
// 0x0038
struct FAIAspectSettings_NavigationAdvanced
{
	bool                                               bCanMove;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bReachedRequiresDirect;                                   // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EGbxStrafeType                                     StrafeType;                                               // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EGbxPathType                                       PathType;                                                 // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bStopWhenReached;                                         // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanRunWhenAtGoal;                                        // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUpdateGoalWhileRunning;                                  // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0007(0x0001) MISSED OFFSET
	EGbxNavGoalCheats                                  Cheats;                                                   // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0007(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FGbxNavGoalModifiers                        GoalModifiers;                                            // 0x000C(0x0028) (Edit, BlueprintVisible)
	bool                                               bCanStartWhenGoalIsUncertain;                             // 0x0034(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bMoveEvenIfUnreachable;                                   // 0x0035(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0036(0x0002) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Navigation
// 0x0140
struct FAIAspectSettings_Navigation
{
	struct FGbxParam                                   ReachedHeight;                                            // 0x0000(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   ReachedDistance;                                          // 0x0080(0x0080) (Edit, BlueprintVisible)
	struct FAIAspectSettings_NavigationAdvanced        Advanced;                                                 // 0x0100(0x0038) (Edit, BlueprintVisible)
	bool                                               bCanMove;                                                 // 0x0138(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bReachedRequiresDirect;                                   // 0x0139(0x0001) (ZeroConstructor, IsPlainOldData)
	EGbxStrafeType                                     StrafeType;                                               // 0x013A(0x0001) (ZeroConstructor, IsPlainOldData)
	EGbxPathType                                       PathType;                                                 // 0x013B(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bStopWhenReached;                                         // 0x013C(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bCanRunWhenAtGoal;                                        // 0x013D(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUpdateGoalWhileRunning;                                  // 0x013E(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x013F(0x0001) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_EnvQuery
// 0x03A0
struct FAIAspectSettings_EnvQuery
{
	struct FEnvQueryParams                             Query;                                                    // 0x0000(0x00B8) (Edit)
	struct FGbxBlackboardKeySelector                   QueryBlackboardKey;                                       // 0x00B8(0x0010) (Edit)
	bool                                               bRefreshAITreeOnQuerySuccess;                             // 0x00C8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bForceRequeryOnSuccess;                                   // 0x00C9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bClearQueryOnSuccess;                                     // 0x00CA(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x00CB(0x0005) MISSED OFFSET
	struct FGbxQueryOptions                            Options;                                                  // 0x00D0(0x0238) (Edit)
	TEnumAsByte<EGbxQueryPreset>                       Preset;                                                   // 0x0308(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUsePreset;                                               // 0x0309(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x030A(0x0006) MISSED OFFSET
	struct FGbxParam                                   QueryPeriod;                                              // 0x0310(0x0080)
	bool                                               bQueryContinuously;                                       // 0x0390(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUpdateValueWhileRunning;                                 // 0x0391(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bKeepValidValues;                                         // 0x0392(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bCanUseSelf;                                              // 0x0393(0x0001) (ZeroConstructor, IsPlainOldData)
	float                                              UseSelfDistance;                                          // 0x0394(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bSucceedIfHasValue;                                       // 0x0398(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bMigrated;                                                // 0x0399(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x039A(0x0006) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_RotationChannel
// 0x01B8
struct FAIAspectSettings_RotationChannel
{
	struct FGbxBlackboardKeySelector                   Target;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible)
	struct FVector                                     TargetOffset;                                             // 0x0010(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	struct FGbxParam                                   Angle;                                                    // 0x0020(0x0080) (Edit, BlueprintVisible)
	bool                                               bUseAngle;                                                // 0x00A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00A1(0x0007) MISSED OFFSET
	struct FGbxParam                                   MaxRotateAngle;                                           // 0x00A8(0x0080) (Edit, BlueprintVisible)
	bool                                               bUseMaxRotateAngle;                                       // 0x0128(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0129(0x0007) MISSED OFFSET
	struct FGbxParam                                   ConditionalEnable;                                        // 0x0130(0x0080) (Edit, BlueprintVisible)
	bool                                               bUseConditionalEnable;                                    // 0x01B0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x01B1(0x0007) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Rotation
// 0x0550
struct FAIAspectSettings_Rotation
{
	bool                                               bCanRotate;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bTrackTargetOverTime;                                     // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EAIAspectSettingsDefaults_Rotation_BodyHeadingOffset BodyHeadingOffsetPresets;                                 // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0003(0x0001) MISSED OFFSET
	float                                              BodyHeadingOffset;                                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EAIAspectSettingsDefaults_Rotation                 PremadeSettings;                                          // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FAIAspectSettings_RotationChannel           Body;                                                     // 0x0010(0x01B8) (Edit, BlueprintVisible)
	bool                                               bUseBody;                                                 // 0x01C8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x01C9(0x0007) MISSED OFFSET
	struct FAIAspectSettings_RotationChannel           Aim;                                                      // 0x01D0(0x01B8) (Edit, BlueprintVisible)
	bool                                               bUseAim;                                                  // 0x0388(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0389(0x0007) MISSED OFFSET
	struct FAIAspectSettings_RotationChannel           Look;                                                     // 0x0390(0x01B8) (Edit, BlueprintVisible)
	bool                                               bUseLook;                                                 // 0x0548(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bKeepFacingTargetOnStop;                                  // 0x0549(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x6];                                       // 0x054A(0x0006) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_GbxAction
// 0x0238
struct FAIAspectSettings_GbxAction
{
	class UClass*                                      ActionType;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseActionType;                                           // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FGameplayTag                                ActionKey;                                                // 0x0010(0x0008) (Edit, BlueprintVisible)
	bool                                               bUseActionKey;                                            // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FGbxBlackboardKeySelector                   ActionBlackboardKey;                                      // 0x0020(0x0010) (Edit, BlueprintVisible)
	bool                                               bUseActionBlackboardKey;                                  // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	struct FGbxParam                                   Count;                                                    // 0x0038(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   CanBeInterrupted;                                         // 0x00B8(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   CanBeInterruptedOnFailure;                                // 0x0138(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   PlayRate;                                                 // 0x01B8(0x0080) (Edit, BlueprintVisible)
};

// ScriptStruct GbxAI.AIAspectSettings_Charge
// 0x0018
struct FAIAspectSettings_Charge
{
	class UAIChargeData*                               ChargeData;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGbxBlackboardKeySelector                   Target;                                                   // 0x0008(0x0010) (Edit, BlueprintVisible, EditConst)
};

// ScriptStruct GbxAI.AIAspectSettings_Follow
// 0x0038
struct FAIAspectSettings_Follow
{
	struct FGbxBlackboardKeySelector                   FollowActorKey;                                           // 0x0000(0x0010) (Edit)
	struct FNumericRange                               TargetDistance;                                           // 0x0010(0x0008) (Edit)
	float                                              MaxSpeedScale;                                            // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinSpeedScale;                                            // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              GoalUpdatePeriod;                                         // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              InvalidWaitPeriod;                                        // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TeleportWaitPeriod;                                       // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowTeleport;                                           // 0x002C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	float                                              TeleportDistance;                                         // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bTeleportWhenFar;                                         // 0x0034(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bContinueWhileClose;                                      // 0x0035(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0036(0x0002) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_FindClosestPlayer
// 0x0020
struct FAIAspectSettings_FindClosestPlayer
{
	struct FGbxBlackboardKeySelector                   BlackboardKey;                                            // 0x0000(0x0010) (Edit, BlueprintVisible)
	bool                                               bOnlyRunIfKeyIsValid;                                     // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bClearKeyOnStop;                                          // 0x0011(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0012(0x0002) MISSED OFFSET
	float                                              UpdatePeriod;                                             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsInternal;                                              // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_FlyToNavMesh
// 0x0010
struct FAIAspectSettings_FlyToNavMesh
{
	float                                              GroundSearchDistance;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LookAheadDistance;                                        // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FlySearchDistance;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              UpdatePeriod;                                             // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxAI.AIAspectSettings_LeadRoute
// 0x0050
struct FAIAspectSettings_LeadRoute
{
	struct FGbxBlackboardKeySelector                   LeadActorKey;                                             // 0x0000(0x0010) (Edit)
	struct FGbxBlackboardKeySelector                   DestinationNodeKey;                                       // 0x0010(0x0010) (Edit)
	float                                              SegmentDistance;                                          // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxWanderingOffset;                                       // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ArrivalDistance;                                          // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FNumericRange                               TargetRouteDistance;                                      // 0x002C(0x0008) (Edit)
	struct FNumericRange                               SpeedScaleRange;                                          // 0x0034(0x0008) (Edit)
	float                                              RouteOffsetFromTarget;                                    // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TeleportDist;                                             // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowBackwards;                                          // 0x0044(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowTeleport;                                           // 0x0045(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0046(0x0002) MISSED OFFSET
	float                                              FindNavRadius;                                            // 0x0048(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Leap
// 0x0058
struct FAIAspectSettings_Leap
{
	class UClass*                                      Action;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGbxBlackboardKeySelector                   Target;                                                   // 0x0008(0x0010) (Edit, BlueprintVisible)
	struct FVector                                     LocalOffset;                                              // 0x0018(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     TargetOffset;                                             // 0x0024(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FName                                       TargetSocket;                                             // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Speed;                                                    // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AnglePercent;                                             // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxPrediction;                                            // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDoNavigationTest;                                        // 0x0044(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDoCollisionTest;                                         // 0x0045(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAddTargetRadius;                                         // 0x0046(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0047(0x0001) MISSED OFFSET
	float                                              UseExactLocationDistance;                                 // 0x0048(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TestPeriod;                                               // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanStartWhileFalling;                                    // 0x0050(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
};

// ScriptStruct GbxAI.LookAroundRandomlySettings
// 0x000C
struct FLookAroundRandomlySettings
{
	float                                              MinAngleChangeEachIterationDeg;                           // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxAngleChangeEachIterationDeg;                           // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxTimeSpentEachScan;                                     // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxAI.AIAspectSettings_MoveSpline
// 0x0050
struct FAIAspectSettings_MoveSpline
{
	struct FGbxBlackboardKeySelector                   SplineKey;                                                // 0x0000(0x0010) (Edit)
	struct FGbxBlackboardKeySelector                   OffsetKey;                                                // 0x0010(0x0010) (Edit)
	struct FGbxBlackboardKeySelector                   ReverseKey;                                               // 0x0020(0x0010) (Edit)
	float                                              LookDistance;                                             // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MissNavigationStep;                                       // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MissNavigationStepDistance;                               // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AdditionnalLookDistanceSpeedFactor;                       // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SnapToNavigation;                                         // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bSnapToNavigation;                                        // 0x0044(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0045(0x0003) MISSED OFFSET
	float                                              GoalUpdateDistance;                                       // 0x0048(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	EGbxNavGoalReach                                   Reach;                                                    // 0x004C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Orbit
// 0x0220
struct FAIAspectSettings_Orbit
{
	struct FGbxBlackboardKeySelector                   CenterKey;                                                // 0x0000(0x0010) (Edit)
	struct FGbxParam                                   HeightOffset;                                             // 0x0010(0x0080) (Edit)
	struct FGbxParam                                   OrbitRadius;                                              // 0x0090(0x0080) (Edit)
	struct FGbxParam                                   OrbitAngle;                                               // 0x0110(0x0080) (Edit)
	struct FGbxParam                                   OrbitAngleInterval;                                       // 0x0190(0x0080) (Edit)
	EOrbitDirection                                    Direction;                                                // 0x0210(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0211(0x0003) MISSED OFFSET
	float                                              SearchRadius;                                             // 0x0214(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRespectCombatTerritory;                                  // 0x0218(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0219(0x0007) MISSED OFFSET
};

// ScriptStruct GbxAI.AIActionSettings_Plan
// 0x0020
struct FAIActionSettings_Plan
{
	TArray<class UAIPlanData*>                         PlansAlwaysAvailableToMe;                                 // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<struct FGameplayTag>                        RoleTags;                                                 // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct GbxAI.AIAspectSettings_Route
// 0x0028
struct FAIAspectSettings_Route
{
	struct FGbxBlackboardKeySelector                   NodeKey;                                                  // 0x0000(0x0010) (Edit)
	float                                              SegmentDistance;                                          // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxWanderingOffset;                                       // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ArrivalDistance;                                          // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              PerchCooldown;                                            // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPassiveAction;                                           // 0x0020(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCombatAction;                                            // 0x0021(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0022(0x0006) MISSED OFFSET
};

// ScriptStruct GbxAI.CoverUseParams
// 0x0118
struct FCoverUseParams
{
	bool                                               bMustHaveViewToTarget;                                    // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bMustBeHiddenFromThreats;                                 // 0x0001(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	float                                              InCoverExposurePercent;                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideIdleTime;                                        // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FGbxParam                                   IdleTimeOverride;                                         // 0x0010(0x0080) (Edit)
	bool                                               bOverrideFireTime;                                        // 0x0090(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0091(0x0007) MISSED OFFSET
	struct FGbxParam                                   FireTimeOverride;                                         // 0x0098(0x0080) (Edit)
};

// ScriptStruct GbxAI.AIAspectSettings_UseCover
// 0x0138
struct FAIAspectSettings_UseCover
{
	struct FGbxBlackboardKeySelector                   Target;                                                   // 0x0000(0x0010) (Edit)
	struct FGbxBlackboardKeySelector                   Cover;                                                    // 0x0010(0x0010) (Edit)
	struct FCoverUseParams                             UseParams;                                                // 0x0020(0x0118) (Edit)
};

// ScriptStruct GbxAI.AIWeaponUseSettings
// 0x0238
struct FAIWeaponUseSettings
{
	float                                              FireConeAngle;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideFireConeAngle;                                   // 0x0004(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	struct FGbxParam                                   BurstCountOverride;                                       // 0x0008(0x0080) (Edit)
	bool                                               bOverrideBurstCount;                                      // 0x0088(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0089(0x0007) MISSED OFFSET
	struct FGbxParam                                   BurstDelayOverride;                                       // 0x0090(0x0080) (Edit)
	bool                                               bOverrideBurstDelay;                                      // 0x0110(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0111(0x0007) MISSED OFFSET
	struct FGbxParam                                   AccuracyOverride;                                         // 0x0118(0x0080) (Edit)
	bool                                               bOverrideAccuracy;                                        // 0x0198(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0199(0x0007) MISSED OFFSET
	struct FGbxParam                                   SuppressingFireTime;                                      // 0x01A0(0x0080) (Edit)
	bool                                               bUseSuppressingFireTime;                                  // 0x0220(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0221(0x0003) MISSED OFFSET
	struct FNumericRange                               DesiredRangeOverride;                                     // 0x0224(0x0008) (Edit)
	bool                                               bOverrideDesiredRange;                                    // 0x022C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x022D(0x0003) MISSED OFFSET
	float                                              MaxWeaponLeadingDistance;                                 // 0x0230(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x0234(0x0004) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Weapon
// 0x0198 (0x03D0 - 0x0238)
struct FAIAspectSettings_Weapon : public FAIWeaponUseSettings
{
	TArray<class UGbxWeaponSlotData*>                  WeaponSlots;                                              // 0x0238(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FGbxParam                                   WeaponUseModeIndex;                                       // 0x0248(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   CanUseWeapon;                                             // 0x02C8(0x0080) (Edit, BlueprintVisible)
	struct FGbxParam                                   CanUseWeaponWhileMoving;                                  // 0x0348(0x0080) (Edit, BlueprintVisible)
	bool                                               bUseCanUseWeaponWhileMoving;                              // 0x03C8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOnlyShootWhenTargetIsKnown;                              // 0x03C9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x03CA(0x0006) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Sweep
// 0x00A8
struct FAIAspectSettings_Sweep
{
	struct FGbxBlackboardKeySelector                   CenterKey;                                                // 0x0000(0x0010) (Edit)
	struct FGbxParam                                   HeightOffset;                                             // 0x0010(0x0080) (Edit)
	float                                              SweepRadius;                                              // 0x0090(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SweepAngle;                                               // 0x0094(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SweepAngleInterval;                                       // 0x0098(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	ESweepDirection                                    Direction;                                                // 0x009C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	float                                              SearchRadius;                                             // 0x00A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Swoop
// 0x0320
struct FAIAspectSettings_Swoop
{
	struct FGbxBlackboardKeySelector                   CenterKey;                                                // 0x0000(0x0010) (Edit)
	struct FGbxParam                                   FarDistance;                                              // 0x0010(0x0080) (Edit)
	struct FGbxParam                                   FarHeight;                                                // 0x0090(0x0080) (Edit)
	struct FGbxParam                                   NearDistance;                                             // 0x0110(0x0080) (Edit)
	struct FGbxParam                                   NearHeight;                                               // 0x0190(0x0080) (Edit)
	struct FGbxParam                                   PassDistance;                                             // 0x0210(0x0080) (Edit)
	struct FGbxParam                                   PassHeight;                                               // 0x0290(0x0080) (Edit)
	float                                              SearchRadius;                                             // 0x0310(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLimitSearchRadius;                                       // 0x0314(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0315(0x0003) MISSED OFFSET
	float                                              UpdatePeriod;                                             // 0x0318(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x031C(0x0004) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_Teleport
// 0x0138
struct FAIAspectSettings_Teleport
{
	struct FGbxBlackboardKeySelector                   GoalKey;                                                  // 0x0000(0x0010) (Edit)
	bool                                               bCloak;                                                   // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bTraceToGround;                                           // 0x0011(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bClearVelocity;                                           // 0x0012(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bChangeRotation;                                          // 0x0013(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bClearGoalOnStop;                                         // 0x0014(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	struct FGbxBlackboardKeySelector                   RotationKey;                                              // 0x0018(0x0010) (Edit)
	struct FGbxParam                                   TravelTime;                                               // 0x0028(0x0080) (Edit)
	bool                                               bUseSpeedInsteadOfTime;                                   // 0x00A8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00A9(0x0007) MISSED OFFSET
	struct FGbxParam                                   TravelSpeed;                                              // 0x00B0(0x0080) (Edit)
	bool                                               bUpdateGoal;                                              // 0x0130(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0131(0x0007) MISSED OFFSET
};

// ScriptStruct GbxAI.AIAspectSettings_UseSmartObject
// 0x0478
struct FAIAspectSettings_UseSmartObject
{
	struct FGbxBlackboardKeySelector                   SmartAction;                                              // 0x0000(0x0010) (Edit)
	bool                                               bAbortExisting;                                           // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUntilInterrupted;                                        // 0x0011(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCanBeInterrupted;                                        // 0x0012(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0013(0x0005) MISSED OFFSET
	struct FEnvQueryParams                             SmartObjectQuery;                                         // 0x0018(0x00B8)
	bool                                               bUseQuery;                                                // 0x00D0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00D1(0x0007) MISSED OFFSET
