#pragma once

// Borderlands 3 SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "BL3_GbxGameSystemCore_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GbxGameSystemCore.StanceDataProvider
// 0x0000 (0x0030 - 0x0030)
class UStanceDataProvider : public UGbxDataAsset
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.StanceDataProvider");
		return ptr;
	}

};


// Class GbxGameSystemCore.StanceData
// 0x0078 (0x00A8 - 0x0030)
class UStanceData : public UStanceDataProvider
{
public:
	struct FStanceFloatValue                           MaxSpeed;                                                 // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FStanceFloatValue                           MaxRotation;                                              // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FStanceFloatValue                           MaxAllowedAimOffset;                                      // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bUseMaxAllowedAimOffset;                                  // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0049(0x0003) MISSED OFFSET
	struct FStanceFloatValue                           AimRotationRate;                                          // 0x004C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bUseAimRotationRate;                                      // 0x0054(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	struct FStanceFloatValue                           MaxIdleRotation;                                          // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bUseMaxIdleRotation;                                      // 0x0060(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
	class UStanceData*                                 StanceDataToShowAnimSystem;                               // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideSlowdownSpeed;                                   // 0x0070(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0071(0x0003) MISSED OFFSET
	struct FStanceFloatValue                           SlowdownSpeed;                                            // 0x0074(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bOverrideMaxAcceleration;                                 // 0x007C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x007D(0x0003) MISSED OFFSET
	float                                              MaxAcceleration;                                          // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bLockDodging;                                             // 0x0084(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLockTurns;                                               // 0x0085(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLockFootIK;                                              // 0x0086(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLockHandIK;                                              // 0x0087(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bThisStanceAllowsFidgetAnims;                             // 0x0088(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0089(0x0003) MISSED OFFSET
	float                                              WaitTimeBeforeFirstFidgetAnim;                            // 0x008C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UPhysicalAnimationProfileAsset*              PhysicalAnimation;                                        // 0x0090(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      HitReactionLayer;                                         // 0x0098(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UHitReactionData*                            HitReactionData;                                          // 0x00A0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.StanceData");
		return ptr;
	}

};


// Class GbxGameSystemCore.GbxAnimTable
// 0x0018 (0x0048 - 0x0030)
class UGbxAnimTable : public UGbxDataAsset
{
public:
	struct FGbxTriggerProperty                         TriggerAutofill;                                          // 0x0030(0x0001) (Edit, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	class UDataTable*                                  DataTable;                                                // 0x0038(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bScaleRateByMeshScale;                                    // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0041(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxAnimTable");
		return ptr;
	}


	void Autofill();
};


// Class GbxGameSystemCore.GbxAction
// 0x0038 (0x0060 - 0x0028)
class UGbxAction : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	bool                                               bCanUseCDO;                                               // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x17];                                      // 0x0031(0x0017) MISSED OFFSET
	struct FName                                       ActionSlotName;                                           // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	EGbxActionPriority                                 ActionPriority;                                           // 0x0050(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
	class UScriptStruct*                               InstanceDataType;                                         // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxAction");
		return ptr;
	}


	void OnServerEnd(EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnServerBegin(class AActor* Actor);
	void OnEnd(EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnBegin(class AActor* Actor);
	bool K2_GetVectorRegisterValue(const struct FName& InName, struct FVector* OutVector);
	float K2_GetTimeRemaining();
	bool K2_GetObjectRegisterValue(const struct FName& InName, class UObject** OutObject);
	bool K2_GetNameRegisterValue(const struct FName& InName, struct FName* OutName);
	float K2_GetMaxCurrentTime();
	bool K2_GetIntRegisterValue(const struct FName& InName, int* OutInt);
	bool K2_GetFloatRegisterValue(const struct FName& InName, float* OutFloat);
	float K2_GetCurrentTime();
	float K2_GetCurrentNormalizedTime();
	class AActor* K2_GetActor();
};


// Class GbxGameSystemCore.GbxAction_SimpleAnim
// 0x0058 (0x00B8 - 0x0060)
class UGbxAction_SimpleAnim : public UGbxAction
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0060(0x0008) MISSED OFFSET
	bool                                               bStopAI;                                                  // 0x0068(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAbortAI;                                                 // 0x0069(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bStopMovement;                                            // 0x006A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableHitReactions;                                     // 0x006B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUsePhysNoneWithRootMotion;                               // 0x006C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bStopLook;                                                // 0x006D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bStopAimRotation;                                         // 0x006E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bStopHeadLook;                                            // 0x006F(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLockHeadLook;                                            // 0x0070(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableAvoidance;                                        // 0x0071(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bTickAndRefreshBones;                                     // 0x0072(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableCollision;                                        // 0x0073(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	TArray<TEnumAsByte<ECollisionChannel>>             DisableCollisionChannels;                                 // 0x0078(0x0010) (Edit, ZeroConstructor)
	bool                                               bEnableLoopHelper;                                        // 0x0088(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCanInterruptSameSlotAnims;                               // 0x0089(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bResetDynamicsOnBegin;                                    // 0x008A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUsePhysicalAnimationProfile;                             // 0x008B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x008C(0x0004) MISSED OFFSET
	class UPhysicalAnimationProfileAsset*              PhysicalAnimationProfile;                                 // 0x0090(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRestorePreviousPhysicalAnimationProfileOnEnd;            // 0x0098(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseNewBoneSetFilter;                                     // 0x0099(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x009A(0x0006) MISSED OFFSET
	class UGbxBoneSet*                                 NewBoneSetFilter;                                         // 0x00A0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRestorePreviousBoneSetFilterProfileOnEnd;                // 0x00A8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bResetBoneSetFilter;                                      // 0x00A9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x00AA(0x0002) MISSED OFFSET
	float                                              DefaultInterruptBlendOutTime;                             // 0x00AC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bReleaseResourceFlagsOnAnimEnd;                           // 0x00B0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEndActionOnBlendOut;                                     // 0x00B1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x6];                                       // 0x00B2(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxAction_SimpleAnim");
		return ptr;
	}


	void OnAnimEnd(class AActor* Actor);
	void K2_SetTickAndRefreshBones(bool bLockResource);
	void K2_SetPhysNoneWithRootMotion(bool bEnable);
	void K2_SetMovement(bool bDisable);
	void K2_SetLook(bool bDisable);
	void K2_SetHitReactions(bool bDisable);
	void K2_SetHeadLookLocked(bool bLock);
	void K2_SetHeadLook(bool bDisable);
	void K2_SetCollision(bool bEnable);
	void K2_SetAvoidance(bool bDisable);
	void K2_SetAIThinking(bool bDisable);
	void K2_SetAimRotation(bool bDisable);
};


// Class GbxGameSystemCore.GbxAISystemBase
// 0x0008 (0x0130 - 0x0128)
class UGbxAISystemBase : public UAISystem
{
public:
	class UGbxQueryManager*                            GbxQueryManager;                                          // 0x0128(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxAISystemBase");
		return ptr;
	}

};


// Class GbxGameSystemCore.PreviewComponent
// 0x0100 (0x07F0 - 0x06F0)
class UPreviewComponent : public UPrimitiveComponent
{
public:
	bool                                               bSpawnInPIE;                                              // 0x06F0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPreviewEnabled;                                          // 0x06F1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x06F2(0x0006) MISSED OFFSET
	class UClass*                                      PreviewActor;                                             // 0x06F8(0x0008) (Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData)
	struct FPreviewState                               PreviewState;                                             // 0x0700(0x00D8) (Transient, DuplicateTransient)
	bool                                               bEnabled;                                                 // 0x07D8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x07D9(0x0003) MISSED OFFSET
	TWeakObjectPtr<class USkinnedMeshComponent>        SkinnedMeshComponent;                                     // 0x07DC(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x07E4(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.PreviewComponent");
		return ptr;
	}


	void OnBlueprintCompiled(class UBlueprint* BP);
};


// Class GbxGameSystemCore.GbxAction_Anim
// 0x00F0 (0x01A8 - 0x00B8)
class UGbxAction_Anim : public UGbxAction_SimpleAnim
{
public:
	struct FAnimMeshList                               DefaultAnims;                                             // 0x00B8(0x0078) (Edit)
	EGbxActionEndCondition                             DefaultEndCondition;                                      // 0x0130(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0131(0x0007) MISSED OFFSET
	struct FName                                       AnimationSlot;                                            // 0x0138(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BlendInTime;                                              // 0x0140(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPushBlendInTime;                                         // 0x0144(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0145(0x0003) MISSED OFFSET
	float                                              DefaultBlendOutTime;                                      // 0x0148(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPushBlendOutTime;                                        // 0x014C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x014D(0x0003) MISSED OFFSET
	float                                              PlayRate;                                                 // 0x0150(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bScalePlayrateWithCharacterScale;                         // 0x0154(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0155(0x0003) MISSED OFFSET
	float                                              SourceCameraAlpha;                                        // 0x0158(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MontageCameraAlpha;                                       // 0x015C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableFootIk;                                           // 0x0160(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bBody1stControlsDuration;                                 // 0x0161(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPlay1stPersonAnimationsOnRemotePlayers;                  // 0x0162(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x5];                                       // 0x0163(0x0005) MISSED OFFSET
	struct FName                                       AnimSlot3rd;                                              // 0x0168(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       AnimSlot1st;                                              // 0x0170(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bHasAnimSlot3rdValue;                                     // 0x0178(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bHasAnimSlot1stValue;                                     // 0x0179(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bGodMode;                                                 // 0x017A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDemigodMode;                                             // 0x017B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bBlockCrouching;                                          // 0x017C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bBlockMantling;                                           // 0x017D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableScaledRootMotion;                                  // 0x017E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bMaintainRootVelocity;                                    // 0x017F(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideDuration;                                        // 0x0180(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0181(0x0003) MISSED OFFSET
	float                                              OverrideDuration;                                         // 0x0184(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideCount;                                           // 0x0188(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0189(0x0003) MISSED OFFSET
	int                                                OverrideCount;                                            // 0x018C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOverridePlayRate;                                        // 0x0190(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0191(0x0003) MISSED OFFSET
	float                                              OverridePlayRate;                                         // 0x0194(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       BlendSpaceXRegisterName;                                  // 0x0198(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       BlendSpaceYRegisterName;                                  // 0x01A0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxAction_Anim");
		return ptr;
	}


	void K2_SetMantlingBlocked(bool bBlocked);
	void K2_SetGodMode(bool bEnable);
	void K2_SetFootIK(bool bDisable);
	void K2_SetDemigodMode(bool bEnable);
	void K2_SetCrouchBlocked(bool bBlocked);
	void K2_Resume();
	void K2_RepProceedToNextSection();
	void K2_RepJumpToNextSection();
	void K2_ProceedToNextSection();
	void K2_Pause();
	void K2_JumpToNextSection();
};


// Class GbxGameSystemCore.TeamComponent
// 0x0040 (0x01B8 - 0x0178)
class UTeamComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0178(0x0008) MISSED OFFSET
	class UTeam*                                       Team;                                                     // 0x0180(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	class UTeam*                                       TeamDefault;                                              // 0x0188(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0190(0x0018) MISSED OFFSET
	bool                                               bSetTeamCollision;                                        // 0x01A8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreCollisionWithTeam;                                 // 0x01A9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bInheritSourceTeamFromInstigator;                         // 0x01AA(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x5];                                       // 0x01AB(0x0005) MISSED OFFSET
	class UTeamComponent*                              SourceTeamComponent;                                      // 0x01B0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.TeamComponent");
		return ptr;
	}


	void SetTeamToDefault();
	void SetTeamCollision(bool bOn);
	void SetTeam(class UTeam* NewTeam);
	void SetSourceTeamComponent(class UTeamComponent* NewSourceTeamComponent);
	void SetCollidesWithTeam(bool bCollidesWithTeam);
	void OnRep_Team(class UTeam* OldTeam);
	void OnRep_bIgnoreCollisionWithTeam();
	bool IsNeutral(class AActor* Actor);
	bool IsHostile(class AActor* Actor);
	bool IsFriendly(class AActor* Actor);
	void InitializeTeam(class UTeam* NewTeam);
	ETeamCollisionChannel GetTeamCollisionChannel();
	TEnumAsByte<ETeamAttitude> GetTeamAttitudeTowardsTeam(class UTeam* OtherTeam);
	TEnumAsByte<ETeamAttitude> GetTeamAttitudeTowardsActor(class AActor* Actor);
};


// Class GbxGameSystemCore.GbxCharacter
// 0x04D0 (0x0D80 - 0x08B0)
class AGbxCharacter : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x08B0(0x0050) MISSED OFFSET
	class UGbxCharacterMovementComponent*              GbxCharacterMovement;                                     // 0x0900(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UTargetableComponent*                        TargetableComponent;                                      // 0x0908(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UDamageComponent*                            DamageComponent;                                          // 0x0910(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UDamageCauserComponent*                      DamageCauserComponent;                                    // 0x0918(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UGbxActionComponent*                         GbxAction;                                                // 0x0920(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UGameplayTagContainerComponent*              GameplayTagContainerComponent;                            // 0x0928(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UDynamicPhysicalAnimationComponent*          DynamicPhysicalAnimationComponent;                        // 0x0930(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UTargetingComponent*                         TargetingComponent;                                       // 0x0938(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UGbxPerceptionComponent*                     PerceptionComponent;                                      // 0x0940(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UFirstPersonComponent*                       FirstPersonComponent;                                     // 0x0948(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0950(0x0010) MISSED OFFSET
	class ULandingData*                                LandingData;                                              // 0x0960(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UImpactData*                                 JumpedImpact;                                             // 0x0968(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bPlayJumpAndLandImpactsOnAllFeet;                         // 0x0970(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0971(0x0007) MISSED OFFSET
	class UImpactData*                                 FootstepImpact;                                           // 0x0978(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UImpactData*                                 GenericHandImpact;                                        // 0x0980(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UImpactData*                                 LadderHandImpact;                                         // 0x0988(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FName>                               FootstepSockets;                                          // 0x0990(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               HandAccessoryTags;                                        // 0x09A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FScriptMulticastDelegate                    LandingDataTriggeredDelegate;                             // 0x09B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class AGbxPlayerController*                        OwnerPlayerController;                                    // 0x09C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class AAIController*                               OwnerAIController;                                        // 0x09C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class AGbxCharacter*                               PlayerMaster;                                             // 0x09D0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TArray<class AGbxCharacter*>                       Pets;                                                     // 0x09D8(0x0010) (ZeroConstructor, Transient)
	struct FMassSelection                              CharacterMass;                                            // 0x09E8(0x0018) (Edit)
	struct FSpawnCostSelection                         SpawnCostSelection;                                       // 0x0A00(0x0018) (Edit)
	class UGbxSkeletalMeshComponent*                   GbxMesh;                                                  // 0x0A18(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               bOrientEyeHeight;                                         // 0x0A20(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0A21(0x0007) MISSED OFFSET
	struct FName                                       ViewSocket;                                               // 0x0A28(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USceneComponent*                             ViewSocketComponent;                                      // 0x0A30(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData04[0xB0];                                      // 0x0A38(0x00B0) MISSED OFFSET
	struct FReplicatedPawnAttachState                  ReplicatedPawnAttachState;                                // 0x0AE8(0x0010) (Net, Transient)
	struct FReplicatedPawnAttachState                  PawnAttachState;                                          // 0x0AF8(0x0010) (Transient)
	unsigned char                                      UnknownData05[0xA8];                                      // 0x0B08(0x00A8) MISSED OFFSET
	float                                              BaseAimHeight;                                            // 0x0BB0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseCustomBaseAimHeight;                                  // 0x0BB4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0BB5(0x0003) MISSED OFFSET
	float                                              AimHeightFromGround;                                      // 0x0BB8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              CrouchedAimHeight;                                        // 0x0BBC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseCustomCrouchedAimHeight;                              // 0x0BC0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0BC1(0x0003) MISSED OFFSET
	float                                              AimEyeHeightPct;                                          // 0x0BC4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       AimSocket;                                                // 0x0BC8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USceneComponent*                             AimSocketComponent;                                       // 0x0BD0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData08[0x8];                                       // 0x0BD8(0x0008) MISSED OFFSET
	struct FFacingController                           FacingController;                                         // 0x0BE0(0x0110) (Net, Transient)
	unsigned char                                      ClientTurnDelta;                                          // 0x0CF0(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x7];                                       // 0x0CF1(0x0007) MISSED OFFSET
	class UClass*                                      InputComponentClass;                                      // 0x0CF8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UFoleyAccessoryComponent*                    GestaltFoleyAccessory;                                    // 0x0D00(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UFoleyMainComponent*                         CachedFoleyMainComponent;                                 // 0x0D08(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UGameplayTasksComponent*                     GameplayTasksComponent;                                   // 0x0D10(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class ULevelSequencePlayer*                        LevelSequencePlayerController;                            // 0x0D18(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FSavedCollision                             LevelSequenceCollisionState;                              // 0x0D20(0x0020) (Transient)
	class UGbxBoneSet*                                 AnimGraphBoneSetFilter;                                   // 0x0D40(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FAnimGraphBoneSet>                   ActiveAnimGraphBoneSetFilterList;                         // 0x0D48(0x0010) (ZeroConstructor, Transient)
	class UGbxBoneSet*                                 SmartObjectBoneSetFilter;                                 // 0x0D58(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UGbxBoneSet*                                 DefaultBoneSetFilter;                                     // 0x0D60(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UGbxBoneSet*                                 ActionBoneSetFilter;                                      // 0x0D68(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPauseAIWhileFalling;                                     // 0x0D70(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0xF];                                       // 0x0D71(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxCharacter");
		return ptr;
	}


	void SetTeam(class UTeam* Team);
	void SetPlayerMaster(class AGbxCharacter* NewPlayerMaster);
	void SetCharacterUIName(class UGbxUIName* NewCharacterUIName);
	void SetCharacterNameFromString(const class FString& NewCharacterName);
	void SetCharacterName(const struct FText& NewCharacterName);
	void RotateCharacterTo(const struct FRotator& TargetRotation, float Duration, TEnumAsByte<EEasingFunc> Easing);
	void ReceiveOwnerPlayerControllerChanged(class AGbxPlayerController* NewPlayerControllerOwner);
	void OnRep_ReplicatedPawnAttachState();
	void OnLandingDataTriggered(const struct FLandingInfo& LandingInfo, int Index);
	void NetMulticast_TriggerHitReactionSound(class UCharacterSoundTag* Tag);
	void NetMulticast_PlayLanded(const struct FHitResult& Hit, float ImpactSpeed, bool bLandFromJump, class ULandingData* LandingDataOverride);
	void NetMulticast_PlayJumped();
	bool IsZoomed();
	class UTeamComponent* GetTeamComponent();
	class UTeam* GetTeam();
	class UTargetingComponent* GetTargetingComponent();
	class UTargetableComponent* GetTargetableComponent();
	class UGbxPerceptionComponent* GetPerceptionComponent();
	EPawnAttachStatus GetPawnAttachStatus();
	class UPawnAttachSlotComponent* GetPawnAttachComponent();
	class AActor* GetPawnAttachActor();
	struct FVector GetLookAtLocation(float* OutWeight);
	float GetLookAt(struct FVector* HeadLocation, struct FVector* EyeLocation, float* HeadWeight);
	class USkeletalMeshComponent* GetFirstPersonMesh();
	class UFirstPersonComponent* GetFirstPersonComponent();
	class UBlackboardComponent* GetBlackboardComponent();
	class UBlackboardData* GetBlackboardAsset();
	void GetAvailableSocketNames(TArray<struct FName>* Array);
	struct FVector GetAimVectorStartLocation();
	struct FRotator GetAimOffset();
	class UFirstPersonComponent* FindFirstPersonComponent();
	void DetachCharacter(EDetachmentRule LocationRule);
	void ClientRotateCharacterTo(const struct FRotator& TargetRotation, float Duration, TEnumAsByte<EEasingFunc> Easing);
	void CauseEveryoneToForgetMe();
	void AttachCharacterToComponent(class USceneComponent* Parent, const struct FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void AttachCharacterToActor(class AActor* ParentActor, const struct FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
};


// Class GbxGameSystemCore.BalanceStateComponent
// 0x0060 (0x01D8 - 0x0178)
class UBalanceStateComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0178(0x0008) MISSED OFFSET
	struct FDataTableRowHandle                         BalanceTableRowHandle;                                    // 0x0180(0x0010) (Edit)
	struct FDataTableRowHandle                         InheritedBalanceTableRowHandle;                           // 0x0190(0x0010) (Transient)
	unsigned char                                      UnknownData01[0x4];                                       // 0x01A0(0x0004) MISSED OFFSET
	int                                                GameStage;                                                // 0x01A4(0x0004) (Edit, Net, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ExperienceLevel;                                          // 0x01A8(0x0004) (Edit, Net, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x01AC(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnLevelChanged;                                           // 0x01B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x10];                                      // 0x01C0(0x0010) MISSED OFFSET
	bool                                               bAutoRefreshInheritedBalanceWhenSourceChangesLevel;       // 0x01D0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x01D1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.BalanceStateComponent");
		return ptr;
	}


	void SetGameStage(int NewGameStage);
	void SetExperienceLevel(int NewExperienceLevel);
	void OnRep_ExperienceLevel(int OldExperienceLevel);
	void OnInheritedBalanceSourceLevelChanged(class UBalanceStateComponent* InheritedBalanceStateSource, int OldExperienceLevel, int NewExperienceLevel);
	int GetGameStage();
	int GetExperienceLevel();
	struct FDataTableRowHandle GetBalanceTableRow();
};


// Class GbxGameSystemCore.GbxChildActorComponent
// 0x0020 (0x0320 - 0x0300)
class UGbxChildActorComponent : public UChildActorComponent
{
public:
	unsigned char                                      bAutoSpawnActor : 1;                                      // 0x0300(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAutoDestroyActor : 1;                                    // 0x0300(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDestroyExistingChildActorOnSpawn : 1;                    // 0x0300(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDeferChildActorClassUpdate : 1;                          // 0x0300(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bClearChildActorReferenceToMeWhenChildActorIsDetached : 1;// 0x0300(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0301(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnChildActorSpawned;                                      // 0x0308(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0318(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxChildActorComponent");
		return ptr;
	}


	void SpawnChildActor();
	void DespawnChildActor();
};


// Class GbxGameSystemCore.AnimNotify_PawnAttachSlotTransition
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_PawnAttachSlotTransition : public UAnimNotify
{
public:
	unsigned char                                      bTriggerOnFirstPersonMesh : 1;                            // 0x0038(0x0001) (Edit, BlueprintReadOnly)
	unsigned char                                      bDetach : 1;                                              // 0x0038(0x0001) (Edit, BlueprintReadOnly)
	unsigned char                                      bAttach : 1;                                              // 0x0038(0x0001) (Edit, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.AnimNotify_PawnAttachSlotTransition");
		return ptr;
	}

};


// Class GbxGameSystemCore.AttributeEffectMutatorData
// 0x0000 (0x0030 - 0x0030)
class UAttributeEffectMutatorData : public UGbxDataAsset
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.AttributeEffectMutatorData");
		return ptr;
	}

};


// Class GbxGameSystemCore.GbxAnimInstance
// 0x0100 (0x0540 - 0x0440)
class UGbxAnimInstance : public UAnimInstance
{
public:
	class UGbxSkeletalMeshComponent*                   GbxSkeletalMeshComponent;                                 // 0x0440(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<class UGbxAnimStateMachineDefinition*>      AnimStateMachineDefinitions;                              // 0x0448(0x0010) (Edit, ZeroConstructor)
	TArray<struct FRuntimeStateMachineData>            RuntimeStateMachines;                                     // 0x0458(0x0010) (ZeroConstructor, Transient)
	TMap<class UGbxAnimTable*, struct FGbxAnimTableMapItem> AnimTableMap;                                             // 0x0468(0x0050) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x28];                                      // 0x04B8(0x0028) MISSED OFFSET
	struct FGbxStateManagerRuntime                     ManagerRuntime;                                           // 0x04E0(0x0050)
	bool                                               bEarlyBindBoneSetDelegates;                               // 0x0530(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x0531(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxAnimInstance");
		return ptr;
	}


	class UAnimSequence* GetAnimTableSequence(class UGbxAnimTable* AnimTable);
	bool CanUseAnimTable(class UGbxAnimTable* AnimTable);
};


// Class GbxGameSystemCore.GbxCustomizationData
// 0x0100 (0x0130 - 0x0030)
class UGbxCustomizationData : public UGbxDataAsset
{
public:
	struct FText                                       CustomizationName;                                        // 0x0030(0x0028) (Edit, DisableEditOnInstance)
	struct FText                                       CustomizationDescription;                                 // 0x0048(0x0028) (Edit, DisableEditOnInstance)
	class FString                                      IconFrameName;                                            // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FUIStatPriorityData>                 UIStats;                                                  // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class FString                                      ItemCardTypeFrameName;                                    // 0x0080(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture>                     PreviewImage;                                             // 0x0090(0x0028) (Edit)
	struct FAttributeInitializationData                PurchasePrice;                                            // 0x00B8(0x0038) (Edit, DisableEditOnInstance)
	class UGbxCustomizationTypeData*                   CustomizationType;                                        // 0x00F0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FCustomizationAssetEntry>            CustomizationTargetAssets;                                // 0x00F8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bUnlockedByDefault;                                       // 0x0108(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bEquippedByDefault;                                       // 0x0109(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x010A(0x0006) MISSED OFFSET
	class UGbxCustomizationData*                       DefaultSkin;                                              // 0x0110(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UGbxCustomizationData*                       DependentBody;                                            // 0x0118(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0120(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxCustomizationData");
		return ptr;
	}


	bool RemoveCustomizationFromActor(class AActor* TargetActor);
	void OnCustomizationAssetLoaded();
	class UGbxAction* K2_PlayAction(class AActor* TargetActor, const struct FActionState_Base& ActionData);
	bool IsLoading();
	bool IsLoaded(int OptionalCustomizationId);
	void AsyncLoadCustomizationAssets(const struct FScriptDelegate& LoadedDelegate);
	bool ApplyCustomizationToActor(class AActor* TargetActor, int OptionalCustomizationId);
};


// Class GbxGameSystemCore.ActorPartSelectionData
// 0x0068 (0x0098 - 0x0030)
class UActorPartSelectionData : public UGbxDataAsset
{
public:
	class UActorPartSelectionData*                     BaseSelectionData;                                        // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorPartSetData*                           PartSetData;                                              // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGuid                                       PartSetDataGuid;                                          // 0x0040(0x0010) (IsPlainOldData)
	struct FRuntimeActorPartListData                   RuntimePartList;                                          // 0x0050(0x0028)
	struct FGuid                                       RuntimePartListGuid;                                      // 0x0078(0x0010) (IsPlainOldData)
	struct FGuid                                       InheritedRuntimePartListGuid;                             // 0x0088(0x0010) (IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.ActorPartSelectionData");
		return ptr;
	}

};


// Class GbxGameSystemCore.AttributeValueResolver
// 0x0000 (0x0028 - 0x0028)
class UAttributeValueResolver : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.AttributeValueResolver");
		return ptr;
	}


	bool SetValueForAttribute(class UGbxAttributeData* Attribute, class UObject* Context, float Value);
	float GetValueForAttribute(class UGbxAttributeData* Attribute, class UObject* Context);
};


// Class GbxGameSystemCore.GbxAreaComponent
// 0x0060 (0x0750 - 0x06F0)
class UGbxAreaComponent : public UPrimitiveComponent
{
public:
	TArray<class AVolume*>                             DetectionVolumes;                                         // 0x06F0(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	bool                                               bWorldAreaVolume;                                         // 0x0700(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0701(0x0003) MISSED OFFSET
	float                                              DetectionRadius;                                          // 0x0704(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DetectionHalfHeight;                                      // 0x0708(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bWorldAreaRadius;                                         // 0x070C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bManualTest;                                              // 0x070D(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x070E(0x0002) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerEnteredArea;                                      // 0x0710(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayerExitedArea;                                       // 0x0720(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	EGbxAreaDrawStyle                                  DrawStyle;                                                // 0x0730(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0731(0x0007) MISSED OFFSET
	TArray<TWeakObjectPtr<class APlayerController>>    PlayersDetected;                                          // 0x0738(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0748(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.GbxAreaComponent");
		return ptr;
	}


	void AreaTest();
};


// Class GbxGameSystemCore.EffectCollectionData
// 0x0000 (0x0028 - 0x0028)
class UEffectCollectionData : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxGameSystemCore.EffectCollectionData");
		return ptr;
	}


	class UWwiseEvent* STATIC_StaticGetWwiseEvent(class UClass* Collection, class UObject* ContextObject);
	void STATIC_StaticGetParticleEffectAndWwiseEvent(class UClass* Collection, class UObject* ContextObject, class UParticleSystem** ParticleEffect, class UWwiseEvent** WwiseEvent);
	class UParticleSystem* STATIC_StaticGetParticleEffect(class UClass* Collection, class UObject* ContextObject);
	class UWwiseEvent* GetWwiseEvent(class UObject* ContextObject);
	void GetParticleEffectAndWwiseEvent(class UObject* ContextObject, class UParticleSystem** ParticleEffect, class UWwiseEvent** WwiseEvent);
	class UParticleSystem* GetParticleEffect(class UObject* ContextObject);
};


// Class GbxGameSystemCore.EnvQueryGenerator_TargetableActors
// 0x00B0 (0x0110 - 0x0060)
class UEnvQueryGenerator_TargetableActors : public UEnvQueryGenerator
{
public:
	struct FAIDataProviderFloatValue                   DistanceMax;                                              // 0x0060(0x0030) (Edit)
	class UGbxCondition*                               TargetSkipDistanceCheckCondition;                         // 0x0090(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bAllowNonTargetableActors;                                // 0x0098(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowDeadActors;                                         // 0x0099(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowQuerier;                                            // 0x009A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowHostiles;                                           // 0x009B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowFriendlies;                                         // 0x009C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowNeutrals;                                           // 0x009D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x009E(0x0002) MISSED OFFSET
	class UGbxCondition*                               TargetCondition;                                          // 0x00A0(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FActorTagCompositeQuery                     TagQuery;                                                 // 0x00A8(0x0010) (Edit)
	TArray<TSoftObjectPtr<class UClass>>               AllowedTypes;                                             // 0x00B8(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      bUseAllowedTypes : 1;                                     // 0x00C8(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00C9(0x0007) MISSED OFFSET
	TArray<TSoftObjectPtr<class UClass>>               DisallowedTypes;                                          // 0x00D0(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      bUseDisallowedTypes : 1;                                  // 0x00E0(0x0001) (Edit)
	unsigned char                                      UnknownData02[0x7];                                       // 0x00E1(0x0007) MISSED OFFSET
	TArray<class UClass*>                              AllowedTypesCache;                                        // 0x00E8(0x0010) (ZeroConstructor, Transient)
