#pragma once

// Borderlands 3 SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "BL3_Basic.hpp"
#include "BL3_AnimGraphRuntime_classes.hpp"
#include "BL3_SignificanceManager_classes.hpp"
#include "BL3_GbxRuntime_classes.hpp"
#include "BL3_CoreUObject_classes.hpp"
#include "BL3_GameplayTasks_classes.hpp"
#include "BL3_GameplayTags_classes.hpp"
#include "BL3_AIModule_classes.hpp"
#include "BL3_Engine_classes.hpp"
#include "BL3_GbxAnimRuntimeBase_classes.hpp"
#include "BL3_ImmediatePhysics_classes.hpp"
#include "BL3_InputCore_classes.hpp"
#include "BL3_AnimationCore_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum GbxGameSystemCore.EGbxActionEndState
enum class EGbxActionEndState : uint8_t
{
	NotFinished                    = 0,
	Success                        = 1,
	Interrupted                    = 2,
	Aborted                        = 3,
	Denied                         = 4,
	Error                          = 5,
	EGbxActionEndState_MAX         = 6
};


// Enum GbxGameSystemCore.EStanceStackLayer
enum class EStanceStackLayer : uint8_t
{
	Default                        = 0,
	AITree                         = 1,
	Blueprint                      = 2,
	Scripted                       = 3,
	Count                          = 4,
	EStanceStackLayer_MAX          = 5
};


// Enum GbxGameSystemCore.EFacingChannel
enum class EFacingChannel : uint8_t
{
	Body                           = 0,
	Aim                            = 1,
	Look                           = 2,
	Count                          = 3,
	EFacingChannel_MAX             = 4
};


// Enum GbxGameSystemCore.EFacingInfoType
enum class EFacingInfoType : uint8_t
{
	None                           = 0,
	Actor                          = 1,
	ActorEyes                      = 2,
	Component                      = 3,
	Location                       = 4,
	Direction                      = 5,
	Rotation                       = 6,
	Controller                     = 7,
	ControllerAim                  = 8,
	Path                           = 9,
	Count                          = 10,
	EFacingInfoType_MAX            = 11
};


// Enum GbxGameSystemCore.ENavAnimState
enum class ENavAnimState : uint8_t
{
	None                           = 0,
	Idle                           = 1,
	Hop                            = 2,
	Start                          = 3,
	Move                           = 4,
	Stop                           = 5,
	TurnIdle                       = 6,
	TurnMoving                     = 7,
	TurnBlend                      = 8,
	Max                            = 9
};


// Enum GbxGameSystemCore.EScriptedLadderType
enum class EScriptedLadderType : uint8_t
{
	None                           = 0,
	GettingOnAtBottom              = 1,
	GettingOffAtBottom             = 2,
	GettingOnAtTop                 = 3,
	GettingOffAtTop                = 4,
	EScriptedLadderType_MAX        = 5
};


// Enum GbxGameSystemCore.EUsabilityType
enum class EUsabilityType : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Count                          = 2,
	EUsabilityType_MAX             = 3
};


// Enum GbxGameSystemCore.EAIDodgeType
enum class EAIDodgeType : uint8_t
{
	None                           = 0,
	Bullet                         = 1,
	Grenade                        = 2,
	Random                         = 3,
	Zone                           = 4,
	EAIDodgeType_MAX               = 5
};


// Enum GbxGameSystemCore.EGbxGlyphSetOption
enum class EGbxGlyphSetOption : uint8_t
{
	AutoDetect                     = 0,
	Set1                           = 1,
	Set2                           = 2,
	Set3                           = 3,
	Set4                           = 4,
	Set5                           = 5,
	Set6                           = 6,
	EGbxGlyphSetOption_MAX         = 7
};


// Enum GbxGameSystemCore.EStatusEffectDurationType
enum class EStatusEffectDurationType : uint8_t
{
	Timed                          = 0,
	Infinite                       = 1,
	EStatusEffectDurationType_MAX  = 2
};


// Enum GbxGameSystemCore.EHoldToUseMode
enum class EHoldToUseMode : uint8_t
{
	Disabled                       = 0,
	HoldOnly                       = 1,
	Both                           = 2,
	EHoldToUseMode_MAX             = 3
};


// Enum GbxGameSystemCore.EPawnAttachStatus
enum class EPawnAttachStatus : uint8_t
{
	Unoccupied                     = 0,
	Attaching                      = 1,
	Attached                       = 2,
	Detaching                      = 3,
	EPawnAttachStatus_MAX          = 4
};


// Enum GbxGameSystemCore.ESpawnCostSelection
enum class ESpawnCostSelection : uint8_t
{
	Preset                         = 0,
	Custom                         = 1,
	ESpawnCostSelection_MAX        = 2
};


// Enum GbxGameSystemCore.EMassSelection
enum class EMassSelection : uint8_t
{
	Automatic                      = 0,
	Custom                         = 1,
	Preset                         = 2,
	EMassSelection_MAX             = 3
};


// Enum GbxGameSystemCore.EDamageCausedModificationStrategy
enum class EDamageCausedModificationStrategy : uint8_t
{
	UseSelfModifier                = 0,
	UseInstigatorModifier          = 1,
	EDamageCausedModificationStrategy_MAX = 2
};


// Enum GbxGameSystemCore.ECriticalHitDamageOverride
enum class ECriticalHitDamageOverride : uint8_t
{
	None                           = 0,
	ForceCrit                      = 1,
	ForceNotCrit                   = 2,
	ECriticalHitDamageOverride_MAX = 3
};


// Enum GbxGameSystemCore.ETeamCollisionChannel
enum class ETeamCollisionChannel : uint8_t
{
	One                            = 0,
	Two                            = 1,
	Three                          = 2,
	Four                           = 3,
	ETeamCollisionChannel_MAX      = 4
};


// Enum GbxGameSystemCore.EStanceValueOverrideType
enum class EStanceValueOverrideType : uint8_t
{
	None                           = 0,
	Relative                       = 1,
	Absolute                       = 2,
	EStanceValueOverrideType_MAX   = 3
};


// Enum GbxGameSystemCore.ERecentDamageFlags
enum class ERecentDamageFlags : uint8_t
{
	None                           = 0,
	CriticalHit                    = 1,
	Healing                        = 2,
	Shield                         = 3,
	Armor                          = 4,
	DamageOverTime                 = 5,
	Resist                         = 6,
	ZeroDamage                     = 7,
	Weapon                         = 8,
	ERecentDamageFlags_MAX         = 9
};


// Enum GbxGameSystemCore.EUIStatComparisonResult
enum class EUIStatComparisonResult : uint8_t
{
	None                           = 0,
	Better                         = 1,
	Worse                          = 2,
	Same                           = 3,
	EUIStatComparisonResult_MAX    = 4
};


// Enum GbxGameSystemCore.EActorPartTypeSelectionOverrideMode
enum class EActorPartTypeSelectionOverrideMode : uint8_t
{
	PreferredParts                 = 0,
	OverrideParts                  = 1,
	EActorPartTypeSelectionOverrideMode_MAX = 2
};


// Enum GbxGameSystemCore.EActorPartReplacementMode
enum class EActorPartReplacementMode : uint8_t
{
	Additive                       = 0,
	Selective                      = 1,
	Complete                       = 2,
	EActorPartReplacementMode_MAX  = 3
};


// Enum GbxGameSystemCore.EActorTagQueryMode
enum class EActorTagQueryMode : uint8_t
{
	HasAny                         = 0,
	HasNone                        = 1,
	HasAll                         = 2,
	EActorTagQueryMode_MAX         = 3
};


// Enum GbxGameSystemCore.EChargeCurveType
enum class EChargeCurveType : uint8_t
{
	Relative                       = 0,
	Absolute                       = 1,
	EChargeCurveType_MAX           = 2
};


// Enum GbxGameSystemCore.ERelativeSizeCharge
enum class ERelativeSizeCharge : uint8_t
{
	Everyone                       = 0,
	SameAndBigger                  = 1,
	OnlyBigger                     = 2,
	None                           = 3,
	ERelativeSizeCharge_MAX        = 4
};


// Enum GbxGameSystemCore.EAnimActionDefInput
enum class EAnimActionDefInput : uint8_t
{
	AnimAsset                      = 0,
	AnimAssetName                  = 1,
	EAnimActionDefInput_MAX        = 2
};


// Enum GbxGameSystemCore.EAnimNotifyAlignType
enum class EAnimNotifyAlignType : uint8_t
{
	Self                           = 0,
	Partner                        = 1,
	EAnimNotifyAlignType_MAX       = 2
};


// Enum GbxGameSystemCore.EAttributeInitializerUsageMode
enum class EAttributeInitializerUsageMode : uint8_t
{
	Set                            = 0,
	Add                            = 1,
	Scale                          = 2,
	Offset                         = 3,
	EAttributeInitializerUsageMode_MAX = 4
};


// Enum GbxGameSystemCore.EBalanceValueType
enum class EBalanceValueType : uint8_t
{
	GameStage                      = 0,
	ExperienceLevel                = 1,
	EBalanceValueType_MAX          = 2
};


// Enum GbxGameSystemCore.EChallengeType
enum class EChallengeType : uint8_t
{
	ECT_Stat                       = 0,
	ECT_LevelObject                = 1,
	ECT_DesignerTriggered          = 2,
	ECT_Blueprint                  = 3,
	ECT_MAX                        = 4
};


// Enum GbxGameSystemCore.ECharacterMovementAttributeValueType
enum class ECharacterMovementAttributeValueType : uint8_t
{
	Speed                          = 0,
	Speed2D                        = 1,
	ECharacterMovementAttributeValueType_MAX = 2
};


// Enum GbxGameSystemCore.ECinematicAudioMode
enum class ECinematicAudioMode : uint8_t
{
	NormalWorldAudio               = 0,
	StandardCinematic              = 1,
	ExclusiveMode                  = 2,
	ECinematicAudioMode_MAX        = 3
};


// Enum GbxGameSystemCore.EConditionalAreaDamageFilter
enum class EConditionalAreaDamageFilter : uint8_t
{
	MustNotBeRadiusDamage          = 0,
	MustBeRadiusDamage             = 1,
	EConditionalAreaDamageFilter_MAX = 2
};


// Enum GbxGameSystemCore.EConditionalDamageCriticalFilter
enum class EConditionalDamageCriticalFilter : uint8_t
{
	HitRegionMustBeCritical        = 0,
	HitRegioneMustNotBeCritical    = 1,
	MustBeAnyCritical              = 2,
	MustNotBeAnyCritical           = 3,
	EConditionalDamageCriticalFilter_MAX = 4
};


// Enum GbxGameSystemCore.EDamageFilterExprMode
enum class EDamageFilterExprMode : uint8_t
{
	MustMatch                      = 0,
	MustNotMatch                   = 1,
	EDamageFilterExprMode_MAX      = 2
};


// Enum GbxGameSystemCore.EConditionalDamageTypeBonusMode
enum class EConditionalDamageTypeBonusMode : uint8_t
{
	AddBonusDamage                 = 0,
	AddBonusDamage_BackToAttacker  = 1,
	AddBonusDamage_BackToAttackerInstigator = 2,
	ConvertPartialDamage           = 3,
	ConvertAllDamage               = 4,
	EConditionalDamageTypeBonusMode_MAX = 5
};


// Enum GbxGameSystemCore.EConditionalDamageModifierType
enum class EConditionalDamageModifierType : uint8_t
{
	Scale                          = 0,
	Add                            = 1,
	ScaleSimple                    = 2,
	EConditionalDamageModifierType_MAX = 3
};


// Enum GbxGameSystemCore.ECMInheritVelocityType
enum class ECMInheritVelocityType : uint8_t
{
	Forward                        = 0,
	Backward                       = 1,
	Right                          = 2,
	Left                           = 3,
	Up                             = 4,
	Down                           = 5,
	ECMInheritVelocityType_MAX     = 6
};


// Enum GbxGameSystemCore.ECMTerminalVelocityModificationType
enum class ECMTerminalVelocityModificationType : uint8_t
{
	OverrideTerminalVelocity       = 0,
	ScaleTerminalVelocity          = 1,
	ECMTerminalVelocityModificationType_MAX = 2
};


// Enum GbxGameSystemCore.ECMGravityModificationType
enum class ECMGravityModificationType : uint8_t
{
	ScaleGravity                   = 0,
	ScaleDefaultGravity            = 1,
	OverrideGravity                = 2,
	ECMGravityModificationType_MAX = 3
};


// Enum GbxGameSystemCore.ECMLedgeBehavior
enum class ECMLedgeBehavior : uint8_t
{
	CanWalkOffLedges               = 0,
	CannotWalkOffLedges            = 1,
	StopOnReachedLedge             = 2,
	ECMLedgeBehavior_MAX           = 3
};


// Enum GbxGameSystemCore.ECMTeleportPreferenceType
enum class ECMTeleportPreferenceType : uint8_t
{
	Behind_TargetFacing            = 0,
	Ahead_TargetFacing             = 1,
	Behind_MoveDirection           = 2,
	Ahead_MoveDirection            = 3,
	ECMTeleportPreferenceType_MAX  = 4
};


// Enum GbxGameSystemCore.ECMMoveLRControlType
enum class ECMMoveLRControlType : uint8_t
{
	None                           = 0,
	Yaw                            = 1,
	Speed                          = 2,
	ECMMoveLRControlType_MAX       = 3
};


// Enum GbxGameSystemCore.ECMMoveFBControlType
enum class ECMMoveFBControlType : uint8_t
{
	None                           = 0,
	Pitch                          = 1,
	Speed                          = 2,
	ECMMoveFBControlType_MAX       = 3
};


// Enum GbxGameSystemCore.ECMMovementType
enum class ECMMovementType : uint8_t
{
	Ground                         = 0,
	Flying                         = 1,
	Falling                        = 2,
	MoveNoneRootMotion             = 3,
	ECMMovementType_MAX            = 4
};


// Enum GbxGameSystemCore.EDamageAreaBoxOriginType
enum class EDamageAreaBoxOriginType : uint8_t
{
	Centered                       = 0,
	OffsetByDepth                  = 1,
	EDamageAreaBoxOriginType_MAX   = 2
};


// Enum GbxGameSystemCore.EDamageAreaOverlapFilterType
enum class EDamageAreaOverlapFilterType : uint8_t
{
	AllDynamicObjects              = 0,
	Profile                        = 1,
	Custom                         = 2,
	EDamageAreaOverlapFilterType_MAX = 3
};


// Enum GbxGameSystemCore.EDamageComponentHealthMode
enum class EDamageComponentHealthMode : uint8_t
{
	ResourcePools                  = 0,
	SimpleHealth                   = 1,
	EDamageComponentHealthMode_MAX = 2
};


// Enum GbxGameSystemCore.EAdditionalDamageClassifier
enum class EAdditionalDamageClassifier : uint8_t
{
	None                           = 0,
	BonusDamage                    = 1,
	ReflectedBonusDamage           = 2,
	ConvertedDamage                = 3,
	EAdditionalDamageClassifier_MAX = 4
};


// Enum GbxGameSystemCore.EDebugDisplayVerbosityLevel
enum class EDebugDisplayVerbosityLevel : uint8_t
{
	Normal                         = 0,
	Verbose                        = 1,
	EDebugDisplayVerbosityLevel_MAX = 2
};


// Enum GbxGameSystemCore.EExplosionTinnitusDuration
enum class EExplosionTinnitusDuration : uint8_t
{
	None                           = 0,
	Short                          = 1,
	Medium                         = 2,
	Long                           = 3,
	EExplosionTinnitusDuration_MAX = 4
};


// Enum GbxGameSystemCore.EFeedbackDataFirstPersonImpulseType
enum class EFeedbackDataFirstPersonImpulseType : uint8_t
{
	None                           = 0,
	Custom                         = 1,
	EFeedbackDataFirstPersonImpulseType_MAX = 2
};


// Enum GbxGameSystemCore.EFeedbackType
enum class EFeedbackType : uint8_t
{
	Ranged                         = 0,
	Directional                    = 1,
	RandomRumble                   = 2,
	Continuous                     = 3,
	RandomShake                    = 4,
	EFeedbackType_MAX              = 5
};


// Enum GbxGameSystemCore.EForceSelection
enum class EForceSelection : uint8_t
{
	Custom                         = 0,
	Attribute                      = 1,
	Preset                         = 2,
	EForceSelection_MAX            = 3
};


// Enum GbxGameSystemCore.EContainsTagComponent
enum class EContainsTagComponent : uint8_t
{
	HasTagComponent                = 0,
	NoTagComponent                 = 1,
	EContainsTagComponent_MAX      = 2
};


// Enum GbxGameSystemCore.EGameResourcePoolState
enum class EGameResourcePoolState : uint8_t
{
	RPS_Depleted                   = 0,
	RPS_Depleting                  = 1,
	RPS_Filled                     = 2,
	RPS_Regenerating               = 3,
	RPS_MAX                        = 4
};


// Enum GbxGameSystemCore.GameResourcePoolReplicationType
enum class EGameResourcePoolReplicationType : uint8_t
{
	GRPRT_None                     = 0,
	GRPRT_Basic                    = 1,
	GRPRT_Full                     = 2,
	GRPRT_MAX                      = 3
};


// Enum GbxGameSystemCore.EAIChargeAnim
enum class EAIChargeAnim : uint8_t
{
	None                           = 0,
	Start                          = 1,
	Loop                           = 2,
	Miss                           = 3,
	Strike                         = 4,
	HitWall                        = 5,
	ReachCliff                     = 6,
	StopForFriendly                = 7,
	EAIChargeAnim_MAX              = 8
};


// Enum GbxGameSystemCore.EActionSelectionMethod
enum class EActionSelectionMethod : uint8_t
{
	FIRST                          = 0,
	RANDOM                         = 1,
	EActionSelectionMethod_MAX     = 2
};


// Enum GbxGameSystemCore.ECoordinatedOwnedParticleAction
enum class ECoordinatedOwnedParticleAction : uint8_t
{
	None                           = 0,
	Hide                           = 1,
	Suppress                       = 2,
	ECoordinatedOwnedParticleAction_MAX = 3
};


// Enum GbxGameSystemCore.ECoordinatedParticleScaleMode
enum class ECoordinatedParticleScaleMode : uint8_t
{
	None                           = 0,
	LargestAxis                    = 1,
	SmallestAxis                   = 2,
	HorizontalAxis                 = 3,
	VerticalAxis                   = 4,
	EachAxis                       = 5,
	ECoordinatedParticleScaleMode_MAX = 6
};


// Enum GbxGameSystemCore.ECoordinatedEffectParamScaleMode
enum class ECoordinatedEffectParamScaleMode : uint8_t
{
	None                           = 0,
	XBounds                        = 1,
	YBounds                        = 2,
	ZBounds                        = 3,
	ECoordinatedEffectParamScaleMode_MAX = 4
};


// Enum GbxGameSystemCore.EDirectionPlane
enum class EDirectionPlane : uint8_t
{
	Horizontal                     = 0,
	Vertical                       = 1,
	EDirectionPlane_MAX            = 2
};


// Enum GbxGameSystemCore.EGbxPhysicalActionMovementLockMode
enum class EGbxPhysicalActionMovementLockMode : uint8_t
{
	MLM_None                       = 0,
	MLM_AquireOnBegin              = 1,
	MLM_ReleaseOnEnd               = 2,
	MLM_AquireRelease              = 3,
	MLM_MAX                        = 4
};


// Enum GbxGameSystemCore.EGbxPhysicalActionDynamicBodyState
enum class EGbxPhysicalActionDynamicBodyState : uint8_t
{
	DBS_Upright                    = 0,
	DBS_FaceDown                   = 1,
	DBS_FaceUp                     = 2,
	DBS_Unknown                    = 3,
	DBS_MAX                        = 4
};


// Enum GbxGameSystemCore.EGbxPhysicalActionDynamicBoneActivationMode
enum class EGbxPhysicalActionDynamicBoneActivationMode : uint8_t
{
	DBAM_HitBone                   = 0,
	DBAM_Recursive                 = 1,
	DBAM_FullBody                  = 2,
	DBAM_MAX                       = 3
};


// Enum GbxGameSystemCore.EGbxPhysicalActionEndCondition
enum class EGbxPhysicalActionEndCondition : uint8_t
{
	EndCondition_AnimationMatch    = 0,
	EndCondition_NoFatigue         = 1,
	EndCondition_FullFatigue       = 2,
	EndCondition_AnimationEnd      = 3,
	EndCondition_NotAllFlagsMatch  = 4,
	EndCondition_NotAnyFlagsMatch  = 5,
	EndCondition_Undetermined      = 6,
	EndCondition_MAX               = 7
};


// Enum GbxGameSystemCore.EGbxPhysicalActionBeginCondition
enum class EGbxPhysicalActionBeginCondition : uint8_t
{
	BeginCondition_Immediate       = 0,
	BeginCondition_WaitUntilPoseMatch = 1,
	BeginCondition_NotAllFlagsMatch = 2,
	BeginCondition_NotAnyFlagsMatch = 3,
	BeginCondition_MAX             = 4
};


// Enum GbxGameSystemCore.ERagdollState
enum class ERagdollState : uint8_t
{
	Start                          = 0,
	Anim                           = 1,
	Ragdoll                        = 2,
	IdlePoseDriving                = 3,
	StartBlend                     = 4,
	Blend                          = 5,
	Getup                          = 6,
	Done                           = 7,
	ERagdollState_MAX              = 8
};


// Enum GbxGameSystemCore.EDynamicToKinematicTransition
enum class EDynamicToKinematicTransition : uint8_t
{
	NoTransition                   = 0,
	RagdollLandToStandUp           = 1,
	PredictiveLanding              = 2,
	AttemptPredictiveLanding       = 3,
	EDynamicToKinematicTransition_MAX = 4
};


// Enum GbxGameSystemCore.EGbxActionEndCondition
enum class EGbxActionEndCondition : uint8_t
{
	EndCondition_BlendOut          = 0,
	EndCondition_LastFrame         = 1,
	EndCondition_Loop              = 2,
	EndCondition_MAX               = 3
};


// Enum GbxGameSystemCore.EGbxActionPriority
enum class EGbxActionPriority : uint8_t
{
	Low                            = 0,
	Normal                         = 1,
	High                           = 2,
	Important                      = 3,
	EGbxActionPriority_MAX         = 4
};


// Enum GbxGameSystemCore.EGbxActionNetMode
enum class EGbxActionNetMode : uint8_t
{
	ServerAuth                     = 0,
	AlwaysRep                      = 1,
	LocalOnly                      = 2,
	SkipNetOwner                   = 3,
	EGbxActionNetMode_MAX          = 4
};


// Enum GbxGameSystemCore.EActionRegisterType
enum class EActionRegisterType : uint8_t
{
	NoType                         = 0,
	Float                          = 1,
	Int                            = 2,
	Object                         = 3,
	Name                           = 4,
	Vector                         = 5,
	EActionRegisterType_MAX        = 6
};


// Enum GbxGameSystemCore.EAnimBPProfileImport
enum class EAnimBPProfileImport : uint8_t
{
	All                            = 0,
	FootIK                         = 1,
	LookAt                         = 2,
	ForwardDynamics                = 3,
	EAnimBPProfileImport_MAX       = 4
};


// Enum GbxGameSystemCore.EForwardDynamicsActivation
enum class EForwardDynamicsActivation : uint8_t
{
	PhysicsAssetSimulated          = 0,
	ForwardDynamicsProfileDefinition = 1,
	EForwardDynamicsActivation_MAX = 2
};


// Enum GbxGameSystemCore.EGbxAreaDrawStyle
enum class EGbxAreaDrawStyle : uint8_t
{
	None                           = 0,
	Wire                           = 1,
	Solid                          = 2,
	SolidAndWire                   = 3,
	EGbxAreaDrawStyle_MAX          = 4
};


// Enum GbxGameSystemCore.EGbxAttributeModifierActionExecOutput
enum class EGbxAttributeModifierActionExecOutput : uint8_t
{
	Success                        = 0,
	Failure                        = 1,
	EGbxAttributeModifierActionExecOutput_MAX = 2
};


// Enum GbxGameSystemCore.EGbxBoneModifyProfile_PoseMode
enum class EGbxBoneModifyProfile_PoseMode : uint8_t
{
	Override                       = 0,
	Additive                       = 1,
	EGbxBoneModifyProfile_MAX      = 2
};


// Enum GbxGameSystemCore.EBoneModifyTransition_TransformType
enum class EBoneModifyTransition_TransformType : uint8_t
{
	Translation                    = 0,
	Rotation                       = 1,
	Scale                          = 2,
	EBoneModifyTransition_MAX      = 3
};


// Enum GbxGameSystemCore.EGbxCharacterBlendPoints
enum class EGbxCharacterBlendPoints : uint8_t
{
	SixPoint                       = 0,
	EightPoint                     = 1,
	EGbxCharacterBlendPoints_MAX   = 2
};


// Enum GbxGameSystemCore.EMantleUpCheckState
enum class EMantleUpCheckState : uint8_t
{
	Unknown                        = 0,
	WallCheck_NoWall               = 1,
	WallCheck_TooFlat              = 2,
	WallCheck_InvalidHitComponent  = 3,
	HeadRoomCheck_BlockedAhead     = 4,
	HeadRoomCheck_BlockedAbove     = 5,
	StandingSpotCheck_Initial_Ahead_NoFloor = 6,
	StandingSpotCheck_Initial_Ahead_InitiallyPenetrating = 7,
	StandingSpotCheck_Initial_Ahead_InvalidHitComponent = 8,
	StandingSpotCheck_Final_Ahead_NoFloor = 9,
	StandingSpotCheck_Final_Ahead_InitiallyPenetrating = 10,
	StandingSpotCheck_Final_Ahead_InvalidHitComponent = 11,
	StandingSpotCheck_Final_Ahead_UnwalkableSlope = 12,
	StandingSpotCheck_Final_Ahead_OutsideOfHeightTolerance = 13,
	StandingSpotCheck_Final_Ahead_BlockedAtHead = 14,
	StandingSpotCheck_Initial_Rotated_NoFloor = 15,
	StandingSpotCheck_Initial_Rotated_InitiallyPenetrating = 16,
	StandingSpotCheck_Initial_Rotated_InvalidHitComponent = 17,
	StandingSpotCheck_Final_Rotated_NoFloor = 18,
	StandingSpotCheck_Final_Rotated_InitiallyPenetrating = 19,
	StandingSpotCheck_Final_Rotated_InvalidHitComponent = 20,
	StandingSpotCheck_Final_Rotated_UnwalkableSlope = 21,
	StandingSpotCheck_Final_Rotated_OutsideOfHeightTolerance = 22,
	StandingSpotCheck_Final_Rotated_BlockedAtHead = 23,
	Good                           = 24,
	EMantleUpCheckState_MAX        = 25
};


// Enum GbxGameSystemCore.EGbxMovementMode
enum class EGbxMovementMode : uint8_t
{
	GBXMOVE_Ladder                 = 0,
	GBXMOVE_Mantle                 = 1,
	GBXMOVE_PawnAttached           = 2,
	GBXMOVE_PretendWalk            = 3,
	GBXMOVE_NoneWithRootMotion     = 4,
	GBXMOVE_MAX                    = 5
};


// Enum GbxGameSystemCore.EMassComparison
enum class EMassComparison : uint8_t
{
	LessThanOrEqual                = 0,
	LessThan                       = 1,
	EqualTo                        = 2,
	NotEqualTo                     = 3,
	GreaterThan                    = 4,
	GreaterThanOrEqual             = 5,
	EMassComparison_MAX            = 6
};


// Enum GbxGameSystemCore.EConditionComparisonOperatorType
enum class EConditionComparisonOperatorType : uint8_t
{
	EqualTo                        = 0,
	NotEqualTo                     = 1,
	LessThan                       = 2,
	LessThanOrEqual                = 3,
	GreaterThan                    = 4,
	GreaterThanOrEqual             = 5,
	EConditionComparisonOperatorType_MAX = 6
};


// Enum GbxGameSystemCore.ECompoundConditionOperatorType
enum class ECompoundConditionOperatorType : uint8_t
{
	And                            = 0,
	Or                             = 1,
	Xor                            = 2,
	Not                            = 3,
	ECompoundConditionOperatorType_MAX = 4
};


// Enum GbxGameSystemCore.ELinkedParameterType
enum class ELinkedParameterType : uint8_t
{
	Scalar                         = 0,
	Vector                         = 1,
	Texture                        = 2,
	ELinkedParameterType_MAX       = 3
};


// Enum GbxGameSystemCore.EGbxCustomizationComponentInitSourceType
enum class EGbxCustomizationComponentInitSourceType : uint8_t
{
	None                           = 0,
	CopyFromInstigatorOnSpawn      = 1,
	LinkToInstigatorOnSpawn        = 2,
	EGbxCustomizationComponentInitSourceType_MAX = 3
};


// Enum GbxGameSystemCore.EDamageSurfaceType
enum class EDamageSurfaceType : uint8_t
{
	Default                        = 0,
	Flesh                          = 1,
	Armor                          = 2,
	Shield                         = 3,
	EDamageSurfaceType_MAX         = 4
};


// Enum GbxGameSystemCore.EGbxFeedbackType
enum class EGbxFeedbackType : uint8_t
{
	Ranged                         = 0,
	Directional                    = 1,
	RandomRumble                   = 2,
	Continuous                     = 3,
	RandomShake                    = 4,
	EFeedbackType_MAX              = 5,
	EGbxFeedbackType_MAX           = 6
};


// Enum GbxGameSystemCore.EGbxFlagEval
enum class EGbxFlagEval : uint8_t
{
	IsTrue                         = 0,
	IsFalse                        = 1,
	TrueForXSeconds                = 2,
	FalseForXSeconds               = 3,
	TrueWithinXSeconds             = 4,
	FalseWithinXSeconds            = 5,
	EGbxFlagEval_MAX               = 6
};


// Enum GbxGameSystemCore.EPlayersOverlappingActorOutput
enum class EPlayersOverlappingActorOutput : uint8_t
{
	Overlapping                    = 0,
	NotOverlapping                 = 1,
	EPlayersOverlappingActorOutput_MAX = 2
};


// Enum GbxGameSystemCore.EPlayersInVolumeOutput
enum class EPlayersInVolumeOutput : uint8_t
{
	InVolume                       = 0,
	NotInVolume                    = 1,
	EPlayersInVolumeOutput_MAX     = 2
};


// Enum GbxGameSystemCore.EIsAutonomousOuput
enum class EIsAutonomousOuput : uint8_t
{
	Autonomous                     = 0,
	NotAutonomous                  = 1,
	EIsAutonomousOuput_MAX         = 2
};


// Enum GbxGameSystemCore.EIsPlayerExecOutput
enum class EIsPlayerExecOutput : uint8_t
{
	Player                         = 0,
	NotPlayer                      = 1,
	EIsPlayerExecOutput_MAX        = 2
};


// Enum GbxGameSystemCore.EGbxParamValueFlags
enum class EGbxParamValueFlags : uint8_t
{
	ClampPositive                  = 0,
	AllBBKeyTypes                  = 1,
	EGbxParamValueFlags_MAX        = 2
};


// Enum GbxGameSystemCore.EGbxParamValueType
enum class EGbxParamValueType : uint8_t
{
	Float                          = 0,
	Bool                           = 1,
	Int                            = 2,
	EnvQueryContext                = 3,
	Object                         = 4,
	Count                          = 5,
	EGbxParamValueType_MAX         = 6
};


// Enum GbxGameSystemCore.EGbxParamValueMode
enum class EGbxParamValueMode : uint8_t
{
	Value                          = 0,
	ValueVariance                  = 1,
	MinMax                         = 2,
	Actor                          = 3,
	None                           = 4,
	BlackboardKey                  = 5,
	Condition                      = 6,
	AttributeInitializationData    = 7,
	Count                          = 8,
	EGbxParamValueMode_MAX         = 9
};


// Enum GbxGameSystemCore.EDestructibleDamageThresholdMagnitude
enum class EDestructibleDamageThresholdMagnitude : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Legacy                         = 3,
	EDestructibleDamageThresholdMagnitude_MAX = 4
};


// Enum GbxGameSystemCore.EGraphicsMode
enum class EGraphicsMode : uint8_t
{
	Performance                    = 0,
	Resolution                     = 1,
	EGraphicsMode_MAX              = 2
};


// Enum GbxGameSystemCore.ESpeakerSetup
enum class ESpeakerSetup : uint8_t
{
	SmallSpeaker                   = 0,
	Hifi                           = 1,
	NightTime                      = 2,
	Mono                           = 3,
	Headphones                     = 4,
	Logitech                       = 5,
	ESpeakerSetup_MAX              = 6
};


// Enum GbxGameSystemCore.ETimedUpdateBehavior
enum class ETimedUpdateBehavior : uint8_t
{
	DontDoTimedUpdates             = 0,
	UpdateRegularlyEvenWhenNavigating = 1,
	UpdateRegularlyExceptWhenNavigating = 2,
	ETimedUpdateBehavior_MAX       = 3
};


// Enum GbxGameSystemCore.EQueryOwnerLocationUse
enum class EQueryOwnerLocationUse : uint8_t
{
	Never                          = 0,
	Always                         = 1,
	Only                           = 2,
	EQueryOwnerLocationUse_MAX     = 3
};


// Enum GbxGameSystemCore.ESimpleMotionType
enum class ESimpleMotionType : uint8_t
{
	None                           = 0,
	ScaleByValue                   = 1,
	Interpolate                    = 2,
	Loop                           = 3,
	Alternate                      = 4,
	ESimpleMotionType_MAX          = 5
};


// Enum GbxGameSystemCore.EGlobalBoneModifyProfile_PoseMode
enum class EGlobalBoneModifyProfile_PoseMode : uint8_t
{
	Override                       = 0,
	Multiplicative                 = 1,
	EGlobalBoneModifyProfile_MAX   = 2
};


// Enum GbxGameSystemCore.EHitReactionConditionCombine
enum class EHitReactionConditionCombine : uint8_t
{
	And                            = 0,
	Or                             = 1,
	EHitReactionConditionCombine_MAX = 2
};


// Enum GbxGameSystemCore.EHitReactionConditionContext
enum class EHitReactionConditionContext : uint8_t
{
	ReceiverOwner                  = 0,
	Receiver                       = 1,
	CauserOwner                    = 2,
	Causer                         = 3,
	DamageType                     = 4,
	DamageSource                   = 5,
	HitRegion                      = 6,
	EHitReactionConditionContext_MAX = 7
};


// Enum GbxGameSystemCore.EDamageReactionEventType
enum class EDamageReactionEventType : uint8_t
{
	Health                         = 0,
	HealthPersistent               = 1,
	Damage                         = 2,
	DamageOverTime                 = 3,
	EDamageReactionEventType_MAX   = 4
};


// Enum GbxGameSystemCore.EHitRegionDamageRule
enum class EHitRegionDamageRule : uint8_t
{
	IndependentHealth              = 0,
	OwnerHealth_DamageCap          = 1,
	OwnerHealth_NoDamageCap        = 2,
	EHitRegionDamageRule_MAX       = 3
};


// Enum GbxGameSystemCore.EImpactUsage
enum class EImpactUsage : uint8_t
{
	Default                        = 0,
	Footstep                       = 1,
	EImpactUsage_MAX               = 2
};


// Enum GbxGameSystemCore.EInstigatorAttributeEffectModifierValueContext
enum class EInstigatorAttributeEffectModifierValueContext : uint8_t
{
	Instigator                     = 0,
	ThisInventoryActor             = 1,
	EInstigatorAttributeEffectModifierValueContext_MAX = 2
};


// Enum GbxGameSystemCore.EInstigatorAttributeEffectAttributeToModifyContextSource
enum class EInstigatorAttributeEffectAttributeToModifyContextSource : uint8_t
{
	ThisInventoryActorWithInstigatorFallback = 0,
	InstigatorOnly                 = 1,
	EInstigatorAttributeEffectAttributeToModifyContextSource_MAX = 2
};


// Enum GbxGameSystemCore.EInterpMode
enum class EInterpMode : uint8_t
{
	None                           = 0,
	Linear                         = 1,
	NonLinear                      = 2,
	Count                          = 3,
	EInterpMode_MAX                = 4
};


// Enum GbxGameSystemCore.EMantleType
enum class EMantleType : uint8_t
{
	MantleUp                       = 0,
	WallHop                        = 1,
	EMantleType_MAX                = 2
};


// Enum GbxGameSystemCore.ENavAnimType
enum class ENavAnimType : uint8_t
{
	None                           = 0,
	Direction                      = 1,
	Destination                    = 2,
	Rotation                       = 3,
	ENavAnimType_MAX               = 4
};


// Enum GbxGameSystemCore.EAttachmentTransitionTiming
enum class EAttachmentTransitionTiming : uint8_t
{
	ChangePawnBeforeTransition     = 0,
	ChangePawnAfterTransition      = 1,
	AttachBaseDuringTransition     = 2,
	EAttachmentTransitionTiming_MAX = 3
};


// Enum GbxGameSystemCore.EAttachmentPossessionRule
enum class EAttachmentPossessionRule : uint8_t
{
	PossessBase                    = 0,
	Unchanged                      = 1,
	EAttachmentPossessionRule_MAX  = 2
};


// Enum GbxGameSystemCore.EPhysicalAnimationBlendToKinematicMode
enum class EPhysicalAnimationBlendToKinematicMode : uint8_t
{
	KinematicLerp                  = 0,
	DynamicMatchesAnimation        = 1,
	Immediate                      = 2,
	EPhysicalAnimationBlendToKinematicMode_MAX = 3
};


// Enum GbxGameSystemCore.EPhysicalAnimationRootMotionControl
enum class EPhysicalAnimationRootMotionControl : uint8_t
{
	PARMC_DrivenByAnimated         = 0,
	PARMC_PureDynamic              = 1,
	PARMC_SimulatedPointDrive      = 2,
	PARMC_SimulatedOrientationDrive = 3,
	PARMC_MAX                      = 4
};


// Enum GbxGameSystemCore.EAggregateBoneStatusFlag
enum class EAggregateBoneStatusFlag : uint8_t
{
	ABS_HasDynamic                 = 0,
	ABS_HasMotion                  = 1,
	ABS_HasPoseVariance            = 2,
	ABS_HasFatigue                 = 3,
	ABS_HasPlayingAnimation        = 4,
	ABS_MAX                        = 5
};


// Enum GbxGameSystemCore.EAggregateBoneFatigueStatus
enum class EAggregateBoneFatigueStatus : uint8_t
{
	ABFS_FullyFatigued             = 0,
	ABFS_NoFatigue                 = 1,
	ABFS_FullyDivergedFatigue      = 2,
	ABFS_VariedFatigue             = 3,
	ABFS_MAX                       = 4
};


// Enum GbxGameSystemCore.ECycleDirection
enum class ECycleDirection : uint8_t
{
	Backward                       = 0,
	Forward                        = 1,
	ECycleDirection_MAX            = 2
};


// Enum GbxGameSystemCore.ERelativeDirectionType
enum class ERelativeDirectionType : uint8_t
{
	Default                        = 0,
	ParentOrientation              = 1,
	ParentOrientation2D            = 2,
	InverseParentOrientation       = 3,
	ParentVelocity                 = 4,
	ParentVelocity2D               = 5,
	InverseParentVelocity          = 6,
	InverseParentVelocity2D        = 7,
	Random                         = 8,
	RandomUpwards                  = 9,
	RandomDownwards                = 10,
	RandomOnHorizontalPlane        = 11,
	StraightUp                     = 12,
	StraightDown                   = 13,
	StraightTowardTarget           = 14,
	StraightAwayFromTarget         = 15,
	ParentAimDirection             = 16,
	InverseParentAimDirection      = 17,
	ParentAimDirection2D           = 18,
	InverseParentAimDirection2D    = 19,
	ParentAcceleration2D           = 20,
	InverseParentAimOffset         = 21,
	ERelativeDirectionType_MAX     = 22
};


// Enum GbxGameSystemCore.EScreenParticleScalingMode
enum class EScreenParticleScalingMode : uint8_t
{
	FitToHorizontal                = 0,
	FitToVertical                  = 1,
	FitToExterior                  = 2,
	FitToInterior                  = 3,
	FitToViewport                  = 4,
	DontAdjustScaling              = 5,
	FitToViewportAndKeepContentAspectRatio = 6,
	EScreenParticleScalingMode_MAX = 7
};


// Enum GbxGameSystemCore.ESimpleMathValueResolverOperatorType
enum class ESimpleMathValueResolverOperatorType : uint8_t
{
	Add                            = 0,
	Subtract                       = 1,
	Multiply                       = 2,
	Divide                         = 3,
	ESimpleMathValueResolverOperatorType_MAX = 4
};


// Enum GbxGameSystemCore.ESplitScreenViewportType
enum class ESplitScreenViewportType : uint8_t
{
	Standard                       = 0,
	Horizontal                     = 1,
	Vertical                       = 2,
	Quad                           = 3,
	ESplitScreenViewportType_MAX   = 4
};


// Enum GbxGameSystemCore.EStatusEffectStackingInstanceReplacementCriteria
enum class EStatusEffectStackingInstanceReplacementCriteria : uint8_t
{
	ChooseSpec                     = 0,
	ChooseLowerDPS                 = 1,
	ChooseHigherDPS                = 2,
	ChooseLongerDuration           = 3,
	ChooseShorterDuration          = 4,
	EStatusEffectStackingInstanceReplacementCriteria_MAX = 5
};


// Enum GbxGameSystemCore.EStatusEffectStackingInstanceSelectionCriteria
enum class EStatusEffectStackingInstanceSelectionCriteria : uint8_t
{
	NewestInstance                 = 0,
	OldestInstance                 = 1,
	MostTimeRemaining              = 2,
	LeastTimeRemaining             = 3,
	EStatusEffectStackingInstanceSelectionCriteria_MAX = 4
};


// Enum GbxGameSystemCore.EStretchBonesMarkerMode
enum class EStretchBonesMarkerMode : uint8_t
{
	BeforeMarker                   = 0,
	AttachedMarker                 = 1,
	AfterMarker                    = 2,
	EStretchBonesMarkerMode_MAX    = 3
};


// Enum GbxGameSystemCore.EStretchBonesActorTrackingStyle
enum class EStretchBonesActorTrackingStyle : uint8_t
{
	FirstFrame                     = 0,
	PredictedFirstFrame            = 1,
	Track                          = 2,
	TrackUntilNotify               = 3,
	NavEntry                       = 4,
	NavExit                        = 5,
	NavMidpoint                    = 6,
	EStretchBonesActorTrackingStyle_MAX = 7
};


// Enum GbxGameSystemCore.EAimAssistSnapTargetType
enum class EAimAssistSnapTargetType : uint8_t
{
	Default                        = 0,
	Disabled                       = 1,
	Horizontal                     = 2,
	Center                         = 3,
	EAimAssistSnapTargetType_MAX   = 4
};


// Enum GbxGameSystemCore.EAITargetScoringBoost
enum class EAITargetScoringBoost : uint8_t
{
	ReduceExtreme                  = 0,
	ReduceModerate                 = 1,
	ReduceLight                    = 2,
	NoBoost                        = 3,
	AmplifyLight                   = 4,
	AmplifyModerate                = 5,
	AmplifyExtreme                 = 6,
	MAX                            = 7
};


// Enum GbxGameSystemCore.ETerritoryCombatProxyType
enum class ETerritoryCombatProxyType : uint8_t
{
	Threat                         = 0,
	Patrol                         = 1,
	ETerritoryCombatProxyType_MAX  = 2
};


// Enum GbxGameSystemCore.ETerritoryType
enum class ETerritoryType : uint8_t
{
	Patrol                         = 0,
	Threat                         = 1,
	Combat                         = 2,
	ETerritoryType_MAX             = 3
};


// Enum GbxGameSystemCore.ETerritoryDrawStyle
enum class ETerritoryDrawStyle : uint8_t
{
	None                           = 0,
	Wire                           = 1,
	Solid                          = 2,
	SolidAndWire                   = 3,
	ETerritoryDrawStyle_MAX        = 4
};


// Enum GbxGameSystemCore.EThreatReason
enum class EThreatReason : uint8_t
{
	ThreatReason_None              = 0,
	ThreatReason_TerritoryEverywhereThreat = 1,
	ThreatReason_TerritoryIncursionAuto = 2,
	ThreatReason_TerritoryIncursionSeen = 3,
	ThreatReason_ShotAt            = 4,
	ThreatReason_Damaged           = 5,
	ThreatReason_Proximity         = 6,
	ThreatReason_TeamNotification  = 7,
	ThreatReason_Scripted          = 8,
	ThreatReason_MAX               = 9
};


// Enum GbxGameSystemCore.EUIStatCombinationMethod
enum class EUIStatCombinationMethod : uint8_t
{
	Multiply                       = 0,
	Divide                         = 1,
	Add                            = 2,
	Subtract                       = 3,
	DontCombine                    = 4,
	EUIStatCombinationMethod_MAX   = 5
};


// Enum GbxGameSystemCore.EUIStatValueRoundingMode
enum class EUIStatValueRoundingMode : uint8_t
{
	None                           = 0,
	RoundToInt                     = 1,
	FloorToInt                     = 2,
	CeilToInt                      = 3,
	EUIStatValueRoundingMode_MAX   = 4
};


// Enum GbxGameSystemCore.EUIStatValueSignStyle
enum class EUIStatValueSignStyle : uint8_t
{
	AsIs                           = 0,
	Positive                       = 1,
	Negative                       = 2,
	OppositeSign                   = 3,
	EUIStatValueSignStyle_MAX      = 4
};


// Enum GbxGameSystemCore.EUIStatValueStyle
enum class EUIStatValueStyle : uint8_t
{
	AttributeValue                 = 0,
	AbsoluteModification           = 1,
	ScaleModification              = 2,
	EUIStatValueStyle_MAX          = 3
};


// Enum GbxGameSystemCore.EUsableTypeCostContext
enum class EUsableTypeCostContext : uint8_t
{
	UsableObject                   = 0,
	Player                         = 1,
	EUsableTypeCostContext_MAX     = 2
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct GbxGameSystemCore.StanceFloatValue
// 0x0008
struct FStanceFloatValue
{
	EStanceValueOverrideType                           ValueType;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Value;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxGameSystemCore.PreviewActorManager
// 0x0080
struct FPreviewActorManager
{
	class USceneComponent*                             AttachComponent;                                          // 0x0000(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class AActor*                                      Actor;                                                    // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      ActorClass;                                               // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	class AActor*                                      ActorTemplate;                                            // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x60];                                      // 0x0020(0x0060) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.PreviewState
// 0x00D8
struct FPreviewState
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	bool                                               bEnabled;                                                 // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FPreviewActorManager                        PreviewActorManager;                                      // 0x0010(0x0080)
	class UClass*                                      PreviewClass;                                             // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FBox                                        PreviewBounds;                                            // 0x0098(0x001C) (IsPlainOldData)
	bool                                               bAutoCycle;                                               // 0x00B4(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x00B5(0x0003) MISSED OFFSET
	int                                                PreviewIdx;                                               // 0x00B8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET
	class UClass*                                      PreviewAction;                                            // 0x00C0(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              ElapsedTime;                                              // 0x00C8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Duration;                                                 // 0x00CC(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bPlayingAction;                                           // 0x00D0(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bQueuedAction;                                            // 0x00D1(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bShowAction;                                              // 0x00D2(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bRepeatAction;                                            // 0x00D3(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x00D4(0x0004) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.AnimActionDef
// 0x0018
struct FAnimActionDef
{
	EAnimActionDefInput                                InputType;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UAnimationAsset*                             AnimAsset;                                                // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       AnimAssetName;                                            // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxGameSystemCore.AnimMeshExtra
// 0x0040
struct FAnimMeshExtra
{
	struct FAnimActionDef                              Anim;                                                     // 0x0000(0x0018) (Edit)
	struct FName                                       MeshName;                                                 // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       AnimSlotOverride;                                         // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bHasAnimSlotOverride;                                     // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	float                                              BlendInOverride;                                          // 0x002C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bHasBlendInOverride;                                      // 0x0030(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
	float                                              BlendOutOverride;                                         // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bHasBlendOutOverride;                                     // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.AnimMeshList
// 0x0078
struct FAnimMeshList
{
	struct FAnimActionDef                              Body3rd;                                                  // 0x0000(0x0018) (Edit)
	struct FAnimActionDef                              Body1st;                                                  // 0x0018(0x0018) (Edit)
	struct FAnimActionDef                              Weapon3rd;                                                // 0x0030(0x0018) (Edit)
	struct FAnimActionDef                              Weapon1st;                                                // 0x0048(0x0018) (Edit)
	TArray<struct FAnimMeshExtra>                      Extras;                                                   // 0x0060(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.MassSelection
// 0x0018
struct FMassSelection
{
	EMassSelection                                     Selection;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       Preset;                                                   // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Mass;                                                     // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.SpawnCostSelection
// 0x0018
struct FSpawnCostSelection
{
	ESpawnCostSelection                                Selection;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       Preset;                                                   // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                SpawnCost;                                                // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.ReplicatedPawnAttachState
// 0x0010
struct FReplicatedPawnAttachState
{
	class UPawnAttachSlotComponent*                    Slot;                                                     // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	EPawnAttachStatus                                  Status;                                                   // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0009(0x0001) MISSED OFFSET
	uint16_t                                           StatusFlag;                                               // 0x000A(0x0002) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.RemoteFacingChannel
// 0x0002
struct FRemoteFacingChannel
{
	unsigned char                                      Pitch;                                                    // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      Yaw;                                                      // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxGameSystemCore.FacingController
// 0x0110
struct FFacingController
{
	unsigned char                                      UnknownData00[0x109];                                     // 0x0000(0x0109) MISSED OFFSET
	struct FRemoteFacingChannel                        RemoteChannels[0x3];                                      // 0x0109(0x0002)
	unsigned char                                      UnknownData01[0x1];                                       // 0x010F(0x0001) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.SavedCollisionItem
// 0x0028
struct FSavedCollisionItem
{
	class UPrimitiveComponent*                         Primitive;                                                // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FCollisionResponseContainer                 Responses;                                                // 0x0008(0x0020)
};

// ScriptStruct GbxGameSystemCore.SavedTeamCollision
// 0x0010
struct FSavedTeamCollision
{
	class UTeamComponent*                              TeamComponent;                                            // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bUseTeamCollision;                                        // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bCollideWithTeam;                                         // 0x0009(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.SavedCollision
// 0x0020
struct FSavedCollision
{
	TArray<struct FSavedCollisionItem>                 SavedItems;                                               // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FSavedTeamCollision>                 SavedTeamItems;                                           // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct GbxGameSystemCore.AnimGraphBoneSet
// 0x0010
struct FAnimGraphBoneSet
{
	class UGbxBoneSet*                                 BoneSet;                                                  // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       AnimGraphMachineName;                                     // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct GbxGameSystemCore.LandingInfo
// 0x0028
struct FLandingInfo
{
	bool                                               bNoMinVelIfJumped;                                        // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              LandedMinVel;                                             // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UImpactData*                                 LandedImpact;                                             // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bPlayLandedImpactAtSpecificFeet;                          // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	class UClass*                                      LandedAction;                                             // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCharacterSoundTag*                          VocalizationTag;                                          // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxGameSystemCore.RuntimeStateMachineData
// 0x0018
struct FRuntimeStateMachineData
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.GbxAnimTableMapItem
// 0x0018
struct FGbxAnimTableMapItem
{
	bool                                               bCanUse;                                                  // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	uint64_t                                           LastFrame;                                                // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.UIStatPriorityData
// 0x0010
struct FUIStatPriorityData
{
	class UUIStatData*                                 UIStat;                                                   // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PriorityIncrease;                                         // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct GbxGameSystemCore.DataTableValueHandle
// 0x0018
struct FDataTableValueHandle
{
	class UDataTable*                                  DataTable;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       RowName;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       ValueName;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct GbxGameSystemCore.AttributeInitializationData
// 0x0038
struct FAttributeInitializationData
{
