#pragma once

// Borderlands 3 SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "BL3_GbxUI_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GbxUI.GbxGFxMovie
// 0x02D0 (0x04E0 - 0x0210)
class UGbxGFxMovie : public UGFxMoviePlayer
{
public:
	class USwfMovie*                                   MovieData;                                                // 0x0210(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EGFxScaleMode>                         ScaleModeType;                                            // 0x0218(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EGFxAlign>                             AlignmentType;                                            // 0x0219(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAnchorToViewport;                                        // 0x021A(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x021B(0x0001) MISSED OFFSET
	struct FGbxGFxAnchor                               AnchorData;                                               // 0x021C(0x0018) (Edit, BlueprintReadOnly)
	unsigned char                                      UnknownData01[0xC];                                       // 0x0234(0x000C) MISSED OFFSET
	class UDataTable*                                  AudioDataTable;                                           // 0x0240(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FGbxGFxMovieClipAppendix                    GetChildAppendix;                                         // 0x0248(0x0060) (Edit, BlueprintReadOnly)
	EGbxGFxMovieGetChildStrategy                       GetChildStrategy;                                         // 0x02A8(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x02A9(0x0007) MISSED OFFSET
	class UGbxGFxObject*                               CachedStage;                                              // 0x02B0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxObject*                               GbxRoot;                                                  // 0x02B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxObject*                               GetChildRoot;                                             // 0x02C0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FVector2D                                   CachedGbxRootPosition;                                    // 0x02C8(0x0008) (BlueprintReadOnly, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x18];                                      // 0x02D0(0x0018) MISSED OFFSET
	bool                                               bIsTransitioning;                                         // 0x02E8(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x02E9(0x0003) MISSED OFFSET
	float                                              TransitionTimeout;                                        // 0x02EC(0x0004) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x140];                                     // 0x02F0(0x0140) MISSED OFFSET
	class AGbxPlayerController*                        OwningGPC;                                                // 0x0430(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x68];                                      // 0x0438(0x0068) MISSED OFFSET
	TArray<class UGbxGFxObject*>                       Tickables;                                                // 0x04A0(0x0010) (BlueprintReadOnly, ZeroConstructor, Transient)
	unsigned char                                      UnknownData07[0x11];                                      // 0x04B0(0x0011) MISSED OFFSET
	bool                                               bGbxMovieStarted;                                         // 0x04C1(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x1E];                                      // 0x04C2(0x001E) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxMovie");
		return ptr;
	}


	bool TranslateWorldToLocal(const struct FVector& LocationWorldSpace, bool bPlayerViewportRelative, bool bUseMovieDimensions, struct FVector2D* OutPositionLocal);
	struct FVector2D TranslateToScreen(const struct FVector2D& Point);
	struct FVector2D TranslateScreenToLocal(const struct FVector2D& Point, bool bUseMovieDimensions);
	struct FBox2D TranslateRectToScreen(const struct FBox2D& Rect);
	void SpawnMovie(class AGbxPlayerController* NewGPCOwner, class UTextureRenderTarget2D* RenderTarget);
	class UGbxGFxMovie* STATIC_SpawnGbxGFxMovie(class AGbxPlayerController* GbxPlayerController, class UClass* MovieClass);
	void SetViewportToPlayerScreen(class AGbxPlayerController* pc);
	void SetOffsetDisplayTransform(const struct FTransform& Transform);
	void SetBaseDisplayTransform(const struct FTransform& Transform);
	void SetAudioEnabled(bool bEnabled);
	void SetAnchor(const struct FGbxGFxAnchor& Anchor);
	bool RunUIEventAudio(const struct FName& EventName, const class FString& ProviderHistory);
	struct FVector2D GetViewportOffset();
	struct FVector2D GetViewportDimensions();
	struct FVector2D GetStageDimensions();
	class APawn* GetOwningPlayerPawn();
	class AGbxPlayerController* GetOwningPlayerController();
	struct FTransform GetOffsetDisplayTransform();
	struct FVector2D GetMovieDimensions();
	struct FTransform GetBaseDisplayTransform();
	void extTransitionComplete();
	void extAnimationFinished(const class FString& TargetName);
	void ApplyNewAudioSettings(class UDataTable* NewDataTable, EUIAudioSettingOperation MergeOperation);
};


// Class GbxUI.GbxGFxMenu
// 0x01A0 (0x0680 - 0x04E0)
class UGbxGFxMenu : public UGbxGFxMovie
{
public:
	EGbxFocusableWidgetMouseBehavior                   DefaultMouseFocusBehavior;                                // 0x04E0(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x04E1(0x0007) MISSED OFFSET
	class UGbxGFxMenuData*                             MenuData;                                                 // 0x04E8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class FString                                      ButtonFocusedAudioEventName;                              // 0x04F0(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	class FString                                      ButtonClickedAudioEventName;                              // 0x0500(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	class FString                                      SliderAudioEventName;                                     // 0x0510(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	class FString                                      SpinnerAudioEventName;                                    // 0x0520(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	class FString                                      NavigateBackAudioEventName;                               // 0x0530(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FName                                       OpenMenuAudioEventName;                                   // 0x0540(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       CloseMenuAudioEventName;                                  // 0x0548(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnMenuTransitionOutCompleted;                             // 0x0550(0x0010) (BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnMenuInputChanged;                                       // 0x0560(0x0010) (BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	EGbxGFxListAlignment                               HintBarAlignment;                                         // 0x0570(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCallMenuTickOnlyIfMenuIsStarted;                         // 0x0571(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0572(0x0002) MISSED OFFSET
	float                                              SplitscreenRootOffset;                                    // 0x0574(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UGbxGFxContextualMenu*                       OwnedContextualMenu;                                      // 0x0578(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxMenu*                                 ActiveDialog;                                             // 0x0580(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0588(0x0004) MISSED OFFSET
	TWeakObjectPtr<class AGbxPlayerController>         PCOwner;                                                  // 0x058C(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class AGbxCharacter>                PrimaryCharacterOwner;                                    // 0x0594(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UGbxMenuStack>                MenuStackOwner;                                           // 0x059C(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                DrawPriority;                                             // 0x05A4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxWidgetFocusManager*                      FocusManager;                                             // 0x05A8(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxHintBar*                                 HintBar;                                                  // 0x05B0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxHintBarContainer*                     HintBarContainer;                                         // 0x05B8(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxMouseBlocker*                         MouseBlockerClip;                                         // 0x05C0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bWantsDismiss;                                            // 0x05C8(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x05C9(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UGbxGameInstance>             GameInstanceRef;                                          // 0x05CC(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UGbxUIGlobals>                UIGlobalsRef;                                             // 0x05D4(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x05DC(0x0002) MISSED OFFSET
	bool                                               bCachedLastInputFromMouse;                                // 0x05DE(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bReceiveMouseEvenIfNotActive;                             // 0x05DF(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsInitedFromStash;                                       // 0x05E0(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bMouseHitsAllowedYet;                                     // 0x05E1(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bGotFirstMouseMove;                                       // 0x05E2(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0xD];                                       // 0x05E3(0x000D) MISSED OFFSET
	class UGbxGFxObject*                               MenuContentClip;                                          // 0x05F0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxObject*                               MenuLayoutsClip;                                          // 0x05F8(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxObject*                               MenuLayoutClip;                                           // 0x0600(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsSplitScreenLayout;                                     // 0x0608(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x17];                                      // 0x0609(0x0017) MISSED OFFSET
	bool                                               bBlockPauseMenu;                                          // 0x0620(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bGFxMenuWasStarted;                                       // 0x0621(0x0001) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x6];                                       // 0x0622(0x0006) MISSED OFFSET
	class UGbxGFxButton*                               LastFocusedButton;                                        // 0x0628(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x50];                                      // 0x0630(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxMenu");
		return ptr;
	}


	void SetWidgetAdjacency(const TScriptInterface<class UGbxFocusableWidget>& Widget, const struct FGbxFocusableWidgetAdjacencyInfo& AdjacencyInfo);
	void SetFocusedWidget(const TScriptInterface<class UGbxFocusableWidget>& WidgetToFocus, bool bFromMouse);
	void SetFocusableWidgetAdjancency(const TScriptInterface<class UGbxFocusableWidget>& Widget, class UObject* AdjacentUp, class UObject* AdjacentDown, class UObject* AdjacentLeft, class UObject* AdjacentRight);
	void RegisterFocusableWidgetWithAdjacency(const TScriptInterface<class UGbxFocusableWidget>& Widget, class UObject* AdjacentUp, class UObject* AdjacentDown, class UObject* AdjacentLeft, class UObject* AdjacentRight);
	void RegisterFocusableWidget(const TScriptInterface<class UGbxFocusableWidget>& Widget, const struct FGbxFocusableWidgetAdjacencyInfo& AdjacencyInfo);
	void MenuStack_Clear();
	bool IsWidgetFocused(class UObject* WidgetInQuestion);
	class UObject* GetFocusedWidget();
};


// Class GbxUI.GbxGFxHUDWidget
// 0x0150 (0x0630 - 0x04E0)
class UGbxGFxHUDWidget : public UGbxGFxMovie
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x04E0(0x0060) MISSED OFFSET
	EGFxHUDWidgetAnchorType                            AnchorType;                                               // 0x0540(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0541(0x0007) MISSED OFFSET
	class FString                                      LayoutInstanceStringOverride;                             // 0x0548(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor)
	struct FName                                       AnchorBoneName;                                           // 0x0558(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxContextSensitivePromptTime;                            // 0x0560(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxTimeUntilStopAdvancing;                                // 0x0564(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0568(0x0008) MISSED OFFSET
	class FString                                      ShowFrameName;                                            // 0x0570(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor)
	class FString                                      HideFrameName;                                            // 0x0580(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor)
	class FString                                      OnFrameName;                                              // 0x0590(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor)
	class FString                                      OffFrameName;                                             // 0x05A0(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor)
	class UGbxGFxHintWidget*                           ContextSensitivePrompt;                                   // 0x05B0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class FString                                      InstanceString;                                           // 0x05B8(0x0010) (BlueprintReadOnly, ZeroConstructor, Transient)
	TWeakObjectPtr<class AGbxHUD>                      OwningHUD;                                                // 0x05C8(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UGbxGFxHUDContainer>          OwningHUDContainer;                                       // 0x05D0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class AGbxPlayerController>         OwningPC;                                                 // 0x05D8(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class APawn>                        OwningPawn;                                               // 0x05E0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxObject*                               IconTransitionWrapper;                                    // 0x05E8(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxObject*                               InitializationClip;                                       // 0x05F0(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x14];                                      // 0x05F8(0x0014) MISSED OFFSET
	TWeakObjectPtr<class UGameInstance>                GameInstanceRef;                                          // 0x060C(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UGbxUIGlobals>                UIGlobalsRef;                                             // 0x0614(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x061C(0x0008) MISSED OFFSET
	unsigned char                                      bDynamicallyLoaded : 1;                                   // 0x0624(0x0001) (Edit, BlueprintReadOnly)
	unsigned char                                      UnknownData05[0xB];                                       // 0x0625(0x000B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxHUDWidget");
		return ptr;
	}


	void extInitAnimationFinished();
	void extHideAnimationFinished();
};


// Class GbxUI.GbxUserWidget
// 0x00B0 (0x02B8 - 0x0208)
class UGbxUserWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0208(0x0010) MISSED OFFSET
	class UTextBlock*                                  LabelTextBlock;                                           // 0x0218(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  ValueTextBlock;                                           // 0x0220(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UImage*                                      SelectedImage;                                            // 0x0228(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	bool                                               bRegisterAsFocusableWidget;                               // 0x0230(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	EGbxFocusableWidgetMouseBehavior                   MouseFocusBehavior;                                       // 0x0231(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0232(0x0006) MISSED OFFSET
	class UGbxFocusableWidgetStyleData*                FocusableWidgetStyleData;                                 // 0x0238(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       OnFocusedAudioEventName;                                  // 0x0240(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       OnClickedAudioEventName;                                  // 0x0248(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bNeverCreateMouseFocusButton;                             // 0x0250(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0251(0x0007) MISSED OFFSET
	class UBUTTON*                                     MouseFocusButton;                                         // 0x0258(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptDelegate                             OnWidgetClicked;                                          // 0x0260(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnWidgetFocused;                                          // 0x0270(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FName                                       FocusableWidgetNavUp;                                     // 0x0280(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	struct FName                                       FocusableWidgetNavDown;                                   // 0x0288(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	struct FName                                       FocusableWidgetNavLeft;                                   // 0x0290(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	struct FName                                       FocusableWidgetNavRight;                                  // 0x0298(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bFocusOnMenuCreation;                                     // 0x02A0(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x02A1(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UGbxUmgMenu>                  MenuThatOwnsFocus;                                        // 0x02A4(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x02AC(0x0004) MISSED OFFSET
	class UDataTable*                                  AudioDataTable;                                           // 0x02B0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxUserWidget");
		return ptr;
	}


	void SetLabelText(const struct FText& LabelText);
	void OnFocusableWidgetUnhovered();
	void OnFocusableWidgetReleased();
	void OnFocusableWidgetPressed();
	void OnFocusableWidgetHovered();
	void OnFocusableWidgetClicked();
	bool IsRegisteredAsFocusableWidget();
	bool STATIC_IsFocusableWidgetStateHovered(EGbxFocusableWidgetState State);
	bool STATIC_IsFocusableWidgetStateFocused(EGbxFocusableWidgetState State);
	void HandleFocusableWidgetStateChanged(EGbxFocusableWidgetState NewState, bool bBecameFocused, bool bLostFocus);
	void GotoAndStop(const struct FFrameTime& StopTime, class UWidgetAnimation* InAnimation);
	void GetAllChildWidgetsOfClass(class UClass* TargetClass, TArray<class UWidget*>* OutputArray);
};


// Class GbxUI.GbxUmgMenu
// 0x0038 (0x02F0 - 0x02B8)
class UGbxUmgMenu : public UGbxUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02B8(0x0008) MISSED OFFSET
	class UGbxUmgMenuData*                             MenuData;                                                 // 0x02C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class AGbxPlayerController*                        PCOwner;                                                  // 0x02C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxMenuStack*                               MenuStackOwner;                                           // 0x02D0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UGbxWidgetFocusManager*                      FocusManager;                                             // 0x02D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UGbxHintBar*                                 HintBar;                                                  // 0x02E0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x02E8(0x0005) MISSED OFFSET
	EGbxFocusableWidgetMouseBehavior                   DefaultMouseFocusBehavior;                                // 0x02ED(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x02EE(0x0002) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxUmgMenu");
		return ptr;
	}


	void SetWidgetAdjacency(class UObject* Widget, const struct FGbxFocusableWidgetAdjacencyInfo& AdjacencyInfo);
	void SetSlateFocusedWidget(class UWidget* Widget);
	void SetHintBarContainer(const TScriptInterface<class UGbxHintBarWidgetContainer>& InContainer);
	void SetFocusedWidget(class UObject* Widget, bool bFromMouse);
	void SetFocusableWidgetAdjancency(class UObject* Widget, class UObject* AdjacentUp, class UObject* AdjacentDown, class UObject* AdjacentLeft, class UObject* AdjacentRight);
	void RegisterStagePlacedHint(const TScriptInterface<class UGbxHintWidget>& InHintWidget, const struct FName& InInputAction);
	void RegisterFocusableWidgetWithAdjacency(class UObject* Widget, class UObject* AdjacentUp, class UObject* AdjacentDown, class UObject* AdjacentLeft, class UObject* AdjacentRight);
	void RegisterFocusableWidget(class UObject* Widget, const struct FGbxFocusableWidgetAdjacencyInfo& AdjacencyInfo);
	void PopulateHintBar();
	void NavigateBack();
	class UObject* MenuStack_SwitchTo(class UGbxMenuData* MenuDataIn);
	class UObject* MenuStack_Push(class UGbxMenuData* MenuDataIn);
	class UObject* MenuStack_PopToSwitchTo(class UObject* Menu, class UGbxMenuData* MenuDataIn);
	void MenuStack_PopTo(class UObject* Menu);
	void MenuStack_Pop();
	void MenuStack_Clear();
	bool IsWidgetFocused(class UObject* WidgetInQuestion);
	bool IsActiveMenuOnStack();
	void HandleMenuInputDeviceChanged(EGbxMenuInputDevice NewInputDevice);
	void HandleMenuInputAction(const struct FName& InputAction, int ControllerId);
	void HandleMenuInit();
	void HandleMenuDeinit();
	void HandleMenuDeactivate();
	void HandleMenuAspectRatioChanged(float NewAspectRatio);
	void HandleMenuActivate();
	class UGbxListItemFactory* GetListItemFactory();
	class UObject* GetFocusedWidget();
	EGbxMenuInputDevice GetCurrentInputDevice();
};


// Class GbxUI.GbxMenuSwitcherSubmenu
// 0x0008 (0x02F8 - 0x02F0)
class UGbxMenuSwitcherSubmenu : public UGbxUmgMenu
{
public:
	TWeakObjectPtr<class UGbxMenuSwitcher>             OwnerMenuSwitcher;                                        // 0x02F0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxMenuSwitcherSubmenu");
		return ptr;
	}

};


// Class GbxUI.GbxDebugMenuSubmenu
// 0x0000 (0x02F8 - 0x02F8)
class UGbxDebugMenuSubmenu : public UGbxMenuSwitcherSubmenu
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxDebugMenuSubmenu");
		return ptr;
	}

};


// Class GbxUI.GbxMenuData
// 0x0018 (0x0048 - 0x0030)
class UGbxMenuData : public UGbxDataAsset
{
public:
	bool                                               bHideMenusBeneath;                                        // 0x0030(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShowsMouse;                                              // 0x0031(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EGbxMenuInputMode                                  InputMode;                                                // 0x0032(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EGbxMenuParentType                                 ParentType;                                               // 0x0033(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAutoAttemptPop;                                          // 0x0034(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseMenuStashing;                                         // 0x0035(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bActivateIfPoppedTo;                                      // 0x0036(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0037(0x0001) MISSED OFFSET
	class UDialogEvent*                                IdleDialogEvent;                                          // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UDialogParameter*                            IdleDialogTargetParamater;                                // 0x0040(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxMenuData");
		return ptr;
	}

};


// Class GbxUI.GbxGFxMenuData
// 0x0078 (0x00C0 - 0x0048)
class UGbxGFxMenuData : public UGbxMenuData
{
public:
	TSoftObjectPtr<class UClass>                       MovieClass;                                               // 0x0048(0x0028) (Edit)
	class FString                                      TransitionMovieClipTarget;                                // 0x0070(0x0010) (Edit, ZeroConstructor)
	class FString                                      TransitionOutAnimation;                                   // 0x0080(0x0010) (Edit, ZeroConstructor)
	float                                              TransitionOutTimeout;                                     // 0x0090(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0094(0x0004) MISSED OFFSET
	class UGbxHUDStateData*                            OverrideHUDState;                                         // 0x0098(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00A0(0x0008) MISSED OFFSET
	int                                                GFxMenuDrawPriorityBoost;                                 // 0x00A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00AC(0x0004) MISSED OFFSET
	TArray<class UObject*>                             CreatedMenus;                                             // 0x00B0(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxMenuData");
		return ptr;
	}

};


// Class GbxUI.GbxGFxObject
// 0x0138 (0x0170 - 0x0038)
class UGbxGFxObject : public UGFxObject
{
public:
	class UGbxGFxMovie*                                OwningMovie;                                              // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x130];                                     // 0x0040(0x0130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxObject");
		return ptr;
	}


	void SetOffsetDisplayTransform(const struct FTransform& Transform);
	void SetBaseDisplayTransform(const struct FTransform& Transform);
	void RotateAboutPoint(float Degrees, const struct FVector2D& Point);
	struct FTransform GetOffsetDisplayTransform();
	struct FTransform GetBaseDisplayTransform();
};


// Class GbxUI.GbxGFxButton
// 0x0160 (0x02D0 - 0x0170)
class UGbxGFxButton : public UGbxGFxObject
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0170(0x0028) MISSED OFFSET
	EGbxFocusableWidgetMouseBehavior                   MouseFocusBehavior;                                       // 0x0198(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0199(0x0007) MISSED OFFSET
	struct FName                                       OnFocusedAudioEventName;                                  // 0x01A0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       OnClickedAudioEventName;                                  // 0x01A8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             OnClicked;                                                // 0x01B0(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnSecondaryClicked;                                       // 0x01C0(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnFocused;                                                // 0x01D0(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnUnfocused;                                              // 0x01E0(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnPressed;                                                // 0x01F0(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnReleased;                                               // 0x0200(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnHovered;                                                // 0x0210(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnUnhovered;                                              // 0x0220(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnHeld;                                                   // 0x0230(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	TWeakObjectPtr<class UGbxGFxMenu>                  OwningMenu;                                               // 0x0240(0x0008) (ZeroConstructor, IsPlainOldData)
	class UGbxTextField*                               Label;                                                    // 0x0248(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0250(0x0018) MISSED OFFSET
	class UGbxGFxObject*                               AppearanceFrameClip;                                      // 0x0268(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              TimeButtonHeld;                                           // 0x0270(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bHasSentHeldEvent;                                        // 0x0274(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bWantsHeld;                                               // 0x0275(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIgnoreNextClick;                                         // 0x0276(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bNewIndicatorUsesLabels;                                  // 0x0277(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x58];                                      // 0x0278(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxButton");
		return ptr;
	}


	void SetLockedState(EGbxGFxButtonLockedState InLockedState, bool bShouldRefresh);
	void SetLabelText(const struct FText& Text, bool bForceUpdate);
	void SetCheckedState(EGbxGFxButtonCheckedState InCheckedState, bool bShouldRefresh);
	void SetButtonType(EGbxGFxButtonType InButtonType);
	void RefreshView(EGbxFocusableWidgetState PrevState);
	void K2_HandleFocusableWidgetStateChanged(EGbxFocusableWidgetState NewState, bool bBecameFocused, bool bLostFocus);
	bool IsRegisteredAsFocusableWidget();
	bool IsLocked();
	bool STATIC_IsFocusableWidgetStateUp(EGbxFocusableWidgetState State);
	bool STATIC_IsFocusableWidgetStateHovered(EGbxFocusableWidgetState State);
	bool STATIC_IsFocusableWidgetStateFocused(EGbxFocusableWidgetState State);
	bool STATIC_IsFocusableWidgetStateDown(EGbxFocusableWidgetState State);
	bool STATIC_IsFocusableWidgetStateDisabled(EGbxFocusableWidgetState State);
	bool IsChecked();
	EGbxGFxButtonLockedState GetLockedState();
	EGbxGFxButtonCheckedState GetCheckedState();
	EGbxGFxButtonType GetButtonType();
	void GbxGFxButtonEvent__DelegateSignature(class UGbxGFxButton* BUTTON, const struct FGbxMenuInputEvent& InputInfo);
};


// Class GbxUI.GbxGFxListCell
// 0x0040 (0x0310 - 0x02D0)
class UGbxGFxListCell : public UGbxGFxButton
{
public:
	class UGbxGFxObject*                               CellBounds;                                               // 0x02D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                ListIndex;                                                // 0x02D8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector2D                                   PositionInContainer;                                      // 0x02DC(0x0008) (Transient, IsPlainOldData)
	float                                              TopOffsetPosition;                                        // 0x02E4(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              BottomOffsetPosition;                                     // 0x02E8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              LeftOffsetPosition;                                       // 0x02EC(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              RightOffsetPosition;                                      // 0x02F0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsReadjustingFocus;                                      // 0x02F4(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1B];                                      // 0x02F5(0x001B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxListCell");
		return ptr;
	}

};


// Class GbxUI.GbxGFxListCellWithData
// 0x0010 (0x0320 - 0x0310)
class UGbxGFxListCellWithData : public UGbxGFxListCell
{
public:
	class UDataAsset*                                  DataAsset;                                                // 0x0310(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0318(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxListCellWithData");
		return ptr;
	}

};


// Class GbxUI.GbxGFxListItemSpinner
// 0x0040 (0x0360 - 0x0320)
class UGbxGFxListItemSpinner : public UGbxGFxListCellWithData
{
public:
	class UGbxSpinner*                                 SpinnerItem;                                              // 0x0320(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x38];                                      // 0x0328(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxListItemSpinner");
		return ptr;
	}


	void OnSpinnerValueUpdated();
};


// Class GbxUI.GbxGFxMenuSwitcherSubmenu
// 0x0010 (0x0690 - 0x0680)
class UGbxGFxMenuSwitcherSubmenu : public UGbxGFxMenu
{
public:
	TWeakObjectPtr<class UGbxGFxMenuSwitcher>          OwnerMenuSwitcher;                                        // 0x0680(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0688(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxMenuSwitcherSubmenu");
		return ptr;
	}

};


// Class GbxUI.GbxGFxMenuSwitcher
// 0x0020 (0x06A0 - 0x0680)
class UGbxGFxMenuSwitcher : public UGbxGFxMenu
{
public:
	TWeakObjectPtr<class UGbxGFxMenuSwitcherSubmenu>   CurrentSubmenu;                                           // 0x0680(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       CurrentSubmenuId;                                         // 0x0688(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       PreviousSubmenuId;                                        // 0x0690(0x0008) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                NumSubMenus;                                              // 0x0698(0x0004) (BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x069C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxMenuSwitcher");
		return ptr;
	}

};


// Class GbxUI.GbxGFxMovieLoader
// 0x0030 (0x01A0 - 0x0170)
class UGbxGFxMovieLoader : public UGbxGFxObject
{
public:
	struct FScriptMulticastDelegate                    OnMovieLoadCompleteDelegate;                              // 0x0170(0x0010) (ZeroConstructor, Transient, InstancedReference)
	class UGbxGFxObject*                               LoadedMovie;                                              // 0x0180(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class USwfMovie*                                   QueuedLoadMovie;                                          // 0x0188(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class USwfMovie*                                   CurrentMovie;                                             // 0x0190(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0198(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxMovieLoader");
		return ptr;
	}

};


// Class GbxUI.GbxGFxProgressBar
// 0x01B0 (0x0320 - 0x0170)
class UGbxGFxProgressBar : public UGbxGFxObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0170(0x0008) MISSED OFFSET
	float                                              Percent;                                                  // 0x0178(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                NumFillFrames;                                            // 0x017C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                NumDeltaBarFrames;                                        // 0x0180(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                NumBackgroundBarFrames;                                   // 0x0184(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FGbxProgressBarInterpolator                 DefaultInterpolator;                                      // 0x0188(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FGbxProgressBarRange>                Ranges;                                                   // 0x01B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class FString                                      EdgeFlashID;                                              // 0x01C0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class FString                                      EdgeFlashInnerID;                                         // 0x01D0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class FString                                      FillBarId;                                                // 0x01E0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class FString                                      DeltaBarId;                                               // 0x01F0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class FString                                      BackgroundBarId;                                          // 0x0200(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class FString                                      CurrentValueLabelId;                                      // 0x0210(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class FString                                      MaxValueLabelId;                                          // 0x0220(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      UnknownData01[0x88];                                      // 0x0230(0x0088) MISSED OFFSET
	struct FScriptDelegate                             OnInterpolationComplete;                                  // 0x02B8(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnEnterRange;                                             // 0x02C8(0x0014) (BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FGbxProgressBarInterpolator                 Interpolator;                                             // 0x02D8(0x0028) (Transient)
	unsigned char                                      UnknownData02[0x20];                                      // 0x0300(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxProgressBar");
		return ptr;
	}


	void SetPercent(float InPercent);
	void SetMaxValueText(const struct FText& Text);
	void SetFillColorAndOpacity(const struct FLinearColor& InColor);
	void SetCurrentValueText(const struct FText& Text);
	bool STATIC_PassedPercentThreshold(float Threshold, float OldValue, float CurrentValue, bool bIncreasing, bool bDecreasing);
	void InterpolateToPercentWithInterpolator(float InPercent, const struct FGbxProgressBarInterpolator& Interpolator);
	void InterpolateToPercent(float InPercent);
	void HandlePercentChanged(float OldValue, float CurrentValue, bool bIsInterpolating, const struct FGbxProgressBarInterpolator& ActiveInterpolator);
	void HandleEnterPercentRange(const struct FName& RangeName);
	float GetPercent();
	bool STATIC_EnteredPercentRange(float RangeMin, float RangeMax, float OldValue, float CurrentValue, bool bIncreasing, bool bDecreasing);
};


// Class GbxUI.GbxGFxGridScrollingList
// 0x01B0 (0x0320 - 0x0170)
class UGbxGFxGridScrollingList : public UGbxGFxObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0170(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    SelectionChangedDelegate;                                 // 0x0180(0x0010) (ZeroConstructor, Transient, InstancedReference)
	struct FScriptMulticastDelegate                    ItemPressedDelegate;                                      // 0x0190(0x0010) (ZeroConstructor, Transient, InstancedReference)
	unsigned char                                      UnknownData01[0x8];                                       // 0x01A0(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    ItemClickedDelegate;                                      // 0x01A8(0x0010) (ZeroConstructor, Transient, InstancedReference)
	struct FScriptMulticastDelegate                    ItemSecondaryClickedDelegate;                             // 0x01B8(0x0010) (ZeroConstructor, Transient, InstancedReference)
	unsigned char                                      UnknownData02[0x18];                                      // 0x01C8(0x0018) MISSED OFFSET
	struct FGbxGFxListConfig                           Config;                                                   // 0x01E0(0x0090) (Transient)
	int                                                SelectedIndex;                                            // 0x0270(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                SelectedIndexWhenFocusWasLost;                            // 0x0274(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FGbxScrollingListCellInfo>           AllCells;                                                 // 0x0278(0x0010) (ZeroConstructor, Transient)
	TArray<struct FGbxScrollingListCellInfo>           UnusedCellPool;                                           // 0x0288(0x0010) (ZeroConstructor, Transient)
	class UGbxGFxObject*                               GridArea;                                                 // 0x0298(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UGbxGFxObject*                               GridMask;                                                 // 0x02A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector2D                                   PositionOfFirstItem;                                      // 0x02A8(0x0008) (Transient, IsPlainOldData)
	int                                                NextUniqueId;                                             // 0x02B0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              ViewWindowSize;                                           // 0x02B4(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FGbxUIScroller                              UiScroller;                                               // 0x02B8(0x0034) (Transient)
	bool                                               bIsContentDirty;                                          // 0x02EC(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x02ED(0x0003) MISSED OFFSET
	struct FVector2D                                   AverageItemDims;                                          // 0x02F0(0x0008) (Transient, IsPlainOldData)
	class UGbxGFxSlider*                               ScrollBar;                                                // 0x02F8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bScrollbarIsChildOfThis;                                  // 0x0300(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1F];                                      // 0x0301(0x001F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxGridScrollingList");
		return ptr;
	}


	void OnScrollBarPositionUpdated(float SliderPercentage);
};


// Class GbxUI.GbxGFxPooledGridList
// 0x00A0 (0x03C0 - 0x0320)
class UGbxGFxPooledGridList : public UGbxGFxGridScrollingList
{
public:
	struct FScriptDelegate                             CellChangedDelegate;                                      // 0x0320(0x0014) (ZeroConstructor, Transient, InstancedReference)
	struct FScriptDelegate                             CellFocusedDelegate;                                      // 0x0330(0x0014) (ZeroConstructor, Transient, InstancedReference)
	struct FScriptDelegate                             CellClickedDelegate;                                      // 0x0340(0x0014) (ZeroConstructor, Transient, InstancedReference)
	struct FGbxGFxPooledGridListConfig                 PooledConfig;                                             // 0x0350(0x0030) (Edit)
	float                                              HelperDataDirDim;                                         // 0x0380(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                HelperDataItemsInDir;                                     // 0x0384(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                HelperDataItemsPerDir;                                    // 0x0388(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                HelperDataFirstItemIndex;                                 // 0x038C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                HelperDataNumVisibleItems;                                // 0x0390(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              HelperDataScrollOffset;                                   // 0x0394(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FGbxGFxPooledGridPoolInfo>           MasterCellPool;                                           // 0x0398(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x18];                                      // 0x03A8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxPooledGridList");
		return ptr;
	}

};


// Class GbxUI.GbxGFxRadioButtonList
// 0x0000 (0x0320 - 0x0320)
class UGbxGFxRadioButtonList : public UGbxGFxGridScrollingList
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxRadioButtonList");
		return ptr;
	}

};


// Class GbxUI.GbxGFxListItemNumber
// 0x0080 (0x03A0 - 0x0320)
class UGbxGFxListItemNumber : public UGbxGFxListCellWithData
{
public:
	int                                                SliderFastestSteps;                                       // 0x0320(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0324(0x001C) MISSED OFFSET
	class UGbxGFxSlider*                               SliderItem;                                               // 0x0340(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UGbxTextField*                               ValueItem;                                                // 0x0348(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x50];                                      // 0x0350(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GbxUI.GbxGFxListItemNumber");
		return ptr;
	}


	void OnSliderUpdated(float SliderPct);
};


// Class GbxUI.GbxGFxEditableTextField
// 0x0110 (0x0420 - 0x0310)
class UGbxGFxEditableTextField : public UGbxGFxListCell
{
public:
	bool                                               bConfirmOnFocusOut;                                       // 0x0310(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0311(0x0007) MISSED OFFSET
