#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xD (0xD - 0x0)
// UserDefinedStruct AilmentCharacterParam.AilmentCharacterParam
struct FAilmentCharacterParam
{
public:
	bool                                         HP_10_2A6A0B554FD76877A6A561BD0E8BEF9E;            // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         MP_11_1A158EF64216EA4CEAA25E9BE328BD82;            // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         BP_13_042B724742FE2A6AAB6DFB990FEB5F80;            // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         SP_12_A84FBB8345BBDF19D0F932ADC5D8EC1B;            // 0x3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         POT_26_5080012943948ACDD4A71C976B03782C;           // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         ATK_14_F968C2F941746AD907B8289A952D8C82;           // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         DEF_15_F205B96F4A072146511E5089C80A4FA0;           // 0x6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         MATK_16_F51806CC4A43856DD17E9087279E969D;          // 0x7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         MDEF_17_F98C05764E85B737DD1AC192D6F04332;          // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         ACC_20_28ED74564A0076A2F4E0E393B5AF3E57;           // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         EVA_21_EA2DA92F413808364A3D8C9BB89DCE04;           // 0xA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CON_22_BFE055C84624D03EA69C2DA97BA4FF3E;           // 0xB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         AGI_23_16E18F6D4043637ABC9FC08A22B0A921;           // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


