#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.GetTextWaitTime
struct UBalloonBundleWidgetBP_C_GetTextWaitTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.GetAutoTime
struct UBalloonBundleWidgetBP_C_GetAutoTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xF3 (0xF3 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.CheckBalloonVoiceData
struct UBalloonBundleWidgetBP_C_CheckBalloonVoiceData_Params
{
public:
	bool                                         Enable;                                            // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.CheckThinkingFixedWaitType
struct UBalloonBundleWidgetBP_C_CheckThinkingFixedWaitType_Params
{
public:
	bool                                         Enable;                                            // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1B (0x1B - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.CheckThinkingFixedType
struct UBalloonBundleWidgetBP_C_CheckThinkingFixedType_Params
{
public:
	bool                                         Enable;                                            // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.GetWaitTimeValue
struct UBalloonBundleWidgetBP_C_GetWaitTimeValue_Params
{
public:
	float                                        TimeValue;                                         // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.Debug_SetMessageFullSkip
struct UBalloonBundleWidgetBP_C_Debug_SetMessageFullSkip_Params
{
public:
	bool                                         bSkip;                                             // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x29 (0x29 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.CheckNext
struct UBalloonBundleWidgetBP_C_CheckNext_Params
{
public:
	bool                                         Next;                                              // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.CheckDrawTextEnd
struct UBalloonBundleWidgetBP_C_CheckDrawTextEnd_Params
{
public:
	bool                                         DrawEnd;                                           // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x37 (0x37 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.ChangeTextSpeed
struct UBalloonBundleWidgetBP_C_ChangeTextSpeed_Params
{
public:
	enum class EKSLanguage                       Language;                                          // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xC (0xC - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.CheckAutoSkipMessage
struct UBalloonBundleWidgetBP_C_CheckAutoSkipMessage_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.GetAutoEventMessage
struct UBalloonBundleWidgetBP_C_GetAutoEventMessage_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnRightAxisX
struct UBalloonBundleWidgetBP_C_OnRightAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnRightAxisY
struct UBalloonBundleWidgetBP_C_OnRightAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnLeftAxisX
struct UBalloonBundleWidgetBP_C_OnLeftAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnLeftAxisY
struct UBalloonBundleWidgetBP_C_OnLeftAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnGamePadAxisX
struct UBalloonBundleWidgetBP_C_OnGamePadAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnGamePadAxisY
struct UBalloonBundleWidgetBP_C_OnGamePadAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnListPaging
struct UBalloonBundleWidgetBP_C_OnListPaging_Params
{
public:
	bool                                         IsLeftInput;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.WorldMapSlowCursorX
struct UBalloonBundleWidgetBP_C_WorldMapSlowCursorX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.WorldMapSlowCursorY
struct UBalloonBundleWidgetBP_C_WorldMapSlowCursorY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.HelpScrollAxis
struct UBalloonBundleWidgetBP_C_HelpScrollAxis_Params
{
public:
	float                                        AxisaValue;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3C (0x3C - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.Tick
struct UBalloonBundleWidgetBP_C_Tick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                        InDeltaTime;                                       // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnEventSpeedChange
struct UBalloonBundleWidgetBP_C_OnEventSpeedChange_Params
{
public:
	enum class ENOTICE_TYPE                      NoticeType;                                        // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1424[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FNoticeArgs                           NoticeArgs;                                        // 0x8(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x28 (0x28 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.OnBattleSpeedChange
struct UBalloonBundleWidgetBP_C_OnBattleSpeedChange_Params
{
public:
	enum class ENOTICE_TYPE                      NoticeType;                                        // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1425[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FNoticeArgs                           NoticeArgs;                                        // 0x8(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x1 (0x1 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.RestoreEventSkip
struct UBalloonBundleWidgetBP_C_RestoreEventSkip_Params
{
public:
	bool                                         Skip;                                              // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x178 (0x178 - 0x0)
// Function BalloonBundleWidgetBP.BalloonBundleWidgetBP_C.ExecuteUbergraph_BalloonBundleWidgetBP
struct UBalloonBundleWidgetBP_C_ExecuteUbergraph_BalloonBundleWidgetBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


