#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x258 (0x5F8 - 0x3A0)
// WidgetBlueprintGeneratedClass Balloon_00.Balloon_00_C
class UBalloon_00_C : public UBalloonBase
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x3A0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      Close;                                             // 0x3A8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Open;                                              // 0x3B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAcqImage*                             BTN;                                               // 0x3B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             CBC;                                               // 0x3C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             CBL;                                               // 0x3C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             CBR;                                               // 0x3D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             CCC;                                               // 0x3D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             CTC;                                               // 0x3E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             CTL;                                               // 0x3E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             CTL02;                                             // 0x3F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             CTR;                                               // 0x3F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             LB;                                                // 0x400(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             LC;                                                // 0x408(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             LT;                                                // 0x410(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Name;                                              // 0x418(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Name_02;                                           // 0x420(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKSTextBlock*                          NameTextBlock;                                     // 0x428(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKSTextBlock*                          NameTextBlock_02;                                  // 0x430(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Overlay_8;                                         // 0x438(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             RB;                                                // 0x440(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             RC;                                                // 0x448(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             RT;                                                // 0x450(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_0;                                        // 0x458(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_1;                                        // 0x460(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Tail_B;                                            // 0x468(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Tail_T;                                            // 0x470(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             TailB_Tex;                                         // 0x478(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             TailLB_Tex;                                        // 0x480(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             TailLT_Tex;                                        // 0x488(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             TailRB_Tex;                                        // 0x490(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             TailRT_Tex;                                        // 0x498(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAcqImage*                             TailT_Tex;                                         // 0x4A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTalkText_Balloon_C*                   TalkText_Balloon;                                  // 0x4A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                        Sequence;                                          // 0x4B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             Size;                                              // 0x4B4(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_15CB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class UTexture2D>>     Normal;                                            // 0x4C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAcqImage*>                     RefImageList;                                      // 0x4D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<TSoftObjectPtr<class UTexture2D>>     Anger;                                             // 0x4E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UTexture2D>>     Think;                                             // 0x4F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UTexture2D>>     Normal_NonTalk;                                    // 0x500(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UTexture2D>>     Anger_NonTalk;                                     // 0x510(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UTexture2D>>     Think_NonTalk;                                     // 0x520(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                       LoadObject;                                        // 0x530(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                             FixedSize;                                         // 0x540(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             MinCenter;                                         // 0x548(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                               LastUseTail;                                       // 0x550(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                       Tailes;                                            // 0x558(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         IsLoaded;                                          // 0x568(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_15CC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector2D>                     TailDefaultTranslation;                            // 0x570(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         CurrentPlayVoice;                                  // 0x580(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_15CD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             OffsetParam;                                       // 0x584(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EnableStretch;                                     // 0x58C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_15CE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            DataTable;                                         // 0x590(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          Normal_Label;                                      // 0x598(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          Anger_Label;                                       // 0x5A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          Think_Label;                                       // 0x5B8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          Normal_NonTalk_Label;                              // 0x5C8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          Anger_NonTalk_Label;                               // 0x5D8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          Think_NonTalk_Label;                               // 0x5E8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UBalloon_00_C* GetDefaultObj();

	void RefreshTalkText();
	void SetBalloonResourceLabel();
	bool UnPausedBalloon();
	bool PauseBalloon();
	void SetupStretchImage(enum class EBalloonType Type);
	void GetBalloonDirFromFromCharaPos(const struct FVector2D& Normalize, enum class EEventBalloonDir* Dir);
	void ChangeBalloonDirFromCharaPos(const struct FVector2D& BalloonPos);
	void CheckOutScreenYMax(const struct FVector2D& CheckPos, bool* OutScreen);
	void CheckOutScreenYMin(const struct FVector2D& CheckPos, bool* OutScreen);
	void CheckOutScreenXMax(const struct FVector2D& CheckPos, bool* OutScreen);
	void CheckOutScreenXMin(const struct FVector2D& CheckPos, bool* OutScreen);
	struct FVector2D GetBalloonOffsetFromChara(enum class EEventBalloonDir Dir);
	struct FVector2D GetBalloonOffset(enum class EEventBalloonDir Dir);
	void CheckTranslation_FromChara(bool* Success);
	void ChangeBalloonDir(enum class EEventBalloonDir Dir);
	void Get_Target_Translation_Min_Max(const struct FVector2D& CheckPos, struct FVector2D* Min, struct FVector2D* Max);
	void CheckTranslation(bool* Success);
	void CheckOutScreen(const struct FVector2D& CheckPos, bool* OutScreen);
	bool GetPlayedVoice();
	void CheckDrawTextEnd();
	void PlayCloseAnim();
	void PlayOpenAnim();
	void GetCharacterHeadPos(float* Ret);
	void DebugLog(const struct FVector2D& ScreenPos, const struct FVector2D& balloonOffset, const struct FVector2D& CharaHeight, const struct FVector2D& BalloonSize, const struct FVector2D& TailOffset);
	void SetupBalloonTair();
	void SetTypeImageFromTalkChara(int32 Index, enum class EBalloonType Type);
	void GetPivot(enum class EEventBalloonDir Dir, struct FVector2D* Scale);
	void SetupBalloonDir(enum class EEventBalloonDir BalloonDir, bool UseTail, struct FVector2D* Offset, struct FVector2D* UnderOffset);
	void SetTranslation();
	bool CloseBalloon();
	void InitLoad();
	void CbLoaded(TArray<class UObject*>& Item);
	bool Init(struct FAddBalloonParam& InParam, bool bAutoTalk);
	bool CallNext(bool AutoNext);
	void UpdateTranslation();
	void InitSize(int32 Index);
	void Next(bool AutoNext);
	void WidgetAnimationEvt_Open_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_Close_K2Node_WidgetAnimationEvent_1();
	void OnCloseAnimationFinished();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetTextAnimationWait(enum class EKSLanguage NewLanguage);
	void ResetAppearance();
	void ExecuteUbergraph_Balloon_00(int32 EntryPoint);
};

}


