#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x18 (0x18 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.SetTitleText
struct UBattleDropItemPanelWidget_C_SetTitleText_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// 0x89 (0x89 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.SettingDropItem
struct UBattleDropItemPanelWidget_C_SettingDropItem_Params
{
public:
	TArray<struct FBattleResultItemDropData>     DropData;                                          // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x1 (0x1 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.IsPlaying
struct UBattleDropItemPanelWidget_C_IsPlaying_Params
{
public:
	bool                                         Playing;                                           // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.OnRightAxisX
struct UBattleDropItemPanelWidget_C_OnRightAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.OnRightAxisY
struct UBattleDropItemPanelWidget_C_OnRightAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.OnLeftAxisX
struct UBattleDropItemPanelWidget_C_OnLeftAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.OnLeftAxisY
struct UBattleDropItemPanelWidget_C_OnLeftAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.OnGamePadAxisX
struct UBattleDropItemPanelWidget_C_OnGamePadAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.OnGamePadAxisY
struct UBattleDropItemPanelWidget_C_OnGamePadAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.OnListPaging
struct UBattleDropItemPanelWidget_C_OnListPaging_Params
{
public:
	bool                                         IsLeftInput;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.WorldMapSlowCursorX
struct UBattleDropItemPanelWidget_C_WorldMapSlowCursorX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.WorldMapSlowCursorY
struct UBattleDropItemPanelWidget_C_WorldMapSlowCursorY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.HelpScrollAxis
struct UBattleDropItemPanelWidget_C_HelpScrollAxis_Params
{
public:
	float                                        AxisaValue;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function BattleDropItemPanelWidget.BattleDropItemPanelWidget_C.ExecuteUbergraph_BattleDropItemPanelWidget
struct UBattleDropItemPanelWidget_C_ExecuteUbergraph_BattleDropItemPanelWidget_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


