#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x4F0 (0x878 - 0x388)
// BlueprintGeneratedClass BP_3DWorldMapActor_GlobeV2.BP_3DWorldMapActor_GlobeV2_C
class ABP_3DWorldMapActor_GlobeV2_C : public AWorldMapGlobeActorBase
{
public:
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Atl_3_1;                                  // 0x388(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_Ship_C*   EMAP_Fld_Ocn_1_1_Ship;                             // 0x390(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Isd_1_2;                                  // 0x398(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Dst_3_2;                                  // 0x3A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Ocn_1_2;                                  // 0x3A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Ocn_1_4;                                  // 0x3B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_2_3;                                  // 0x3B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Dst_1_1;                                  // 0x3C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Dst_2_5_B;                                // 0x3C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Snw_1_1_B;                                // 0x3D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Ocn_1_3;                                  // 0x3D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Ocn_1_4;                                  // 0x3E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Ocn_1_3;                                  // 0x3E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Atl_3_1;                                  // 0x3F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Ocn_1_2;                                  // 0x3F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Ocn_1_1;                                  // 0x400(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Mnt_2_1;                                  // 0x408(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Dst_2_3;                                  // 0x410(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_3_2;                                  // 0x418(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Cty_3_1;                                  // 0x420(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_3_1;                                  // 0x428(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_1_3;                                  // 0x430(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_1_1;                                  // 0x438(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_1_2;                                  // 0x440(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Cty_1_3;                                  // 0x448(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_1_4;                                  // 0x450(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Cty_1_4;                                  // 0x458(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_2_Job;                                // 0x460(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Cty_2_1;                                  // 0x468(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_2_1;                                  // 0x470(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Cty_1_1;                                  // 0x478(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Cty_1_2;                                  // 0x480(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Cty_2_2;                                  // 0x488(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Cty_2_2;                                  // 0x490(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Mnt_1_1;                                  // 0x498(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Mnt_1_1;                                  // 0x4A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Mnt_1_2;                                  // 0x4A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Mnt_2_2;                                  // 0x4B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Mnt_2_Job;                                // 0x4B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Mnt_2_2;                                  // 0x4C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Mnt_3_2;                                  // 0x4C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Mnt_2_1;                                  // 0x4D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Mnt_3_1;                                  // 0x4D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Mnt_2_3;                                  // 0x4E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Mnt_3_3;                                  // 0x4E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Mnt_3_3;                                  // 0x4F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Mnt_3_1;                                  // 0x4F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Snw_1_2;                                  // 0x500(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Snw_1_3;                                  // 0x508(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Snw_1_2;                                  // 0x510(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Snw_3_4;                                  // 0x518(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Snw_3_1;                                  // 0x520(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Snw_2_Job;                                // 0x528(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Snw_2_2;                                  // 0x530(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Snw_2_1;                                  // 0x538(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Snw_3_1;                                  // 0x540(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Snw_3_3;                                  // 0x548(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Snw_3_2;                                  // 0x550(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Snw_1_1_A;                                // 0x558(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Snw_1_1;                                  // 0x560(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Isd_3_2;                                  // 0x568(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Isd_1_1;                                  // 0x570(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Isd_1_1;                                  // 0x578(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Isd_2_Job;                                // 0x580(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Isd_1_2;                                  // 0x588(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Isd_1_3;                                  // 0x590(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Isd_2_1;                                  // 0x598(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Isd_2_1;                                  // 0x5A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Isd_3_3;                                  // 0x5A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Isd_3_1;                                  // 0x5B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Dst_3_1;                                  // 0x5B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Dst_2_2;                                  // 0x5C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Dst_2_4;                                  // 0x5C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Dst_2_1;                                  // 0x5D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Dst_2_Job;                                // 0x5D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Sea_2_3;                                  // 0x5E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Sea_2_2;                                  // 0x5E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Dst_3_1;                                  // 0x5F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Sea_3_1;                                  // 0x5F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Sea_2_Job;                                // 0x600(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Sea_1_1;                                  // 0x608(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Sea_1_2;                                  // 0x610(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Sea_1_3;                                  // 0x618(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Fst_3_2;                                  // 0x620(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Fst_3_2;                                  // 0x628(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Fst_2_1;                                  // 0x630(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Fst_3_3;                                  // 0x638(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Fst_2_Job;                                // 0x640(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Fst_2_2;                                  // 0x648(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Fst_1_2;                                  // 0x650(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Wld_1_1;                                  // 0x658(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Fst_3_1;                                  // 0x660(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Fst_1_1;                                  // 0x668(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Wld_1_2;                                  // 0x670(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Wld_2_Job;                                // 0x678(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Wld_2_1;                                  // 0x680(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Wld_2_2;                                  // 0x688(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Wld_3_2;                                  // 0x690(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Wld_3_1;                                  // 0x698(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Sea_3_1;                                  // 0x6A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Wld_3_1;                                  // 0x6A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Wld_3_2;                                  // 0x6B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Wld_2_3;                                  // 0x6B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Wld_2_1;                                  // 0x6C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Wld_2_2;                                  // 0x6C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Wld_1_2;                                  // 0x6D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Fst_1_2;                                  // 0x6D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Fst_1_1;                                  // 0x6E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Fst_1_3;                                  // 0x6E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Wld_1_1;                                  // 0x6F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Fst_1_4;                                  // 0x6F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Fst_3_1;                                  // 0x700(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Fst_3_2;                                  // 0x708(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Fst_2_1;                                  // 0x710(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Fst_2_2;                                  // 0x718(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Dst_2_5_A;                                // 0x720(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Sea_1_1;                                  // 0x728(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Sea_1_3;                                  // 0x730(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Sea_2_2;                                  // 0x738(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Sea_2_3;                                  // 0x740(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Dst_2_4;                                  // 0x748(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Dst_2_3;                                  // 0x750(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Dst_2_2;                                  // 0x758(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Dst_3_1;                                  // 0x760(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Dst_3_2;                                  // 0x768(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Wld_1_3;                                  // 0x770(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Fld_Sea_1_2;                                  // 0x778(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Sea_2_1;                                  // 0x780(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Dst_2_1;                                  // 0x788(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Fst_2_1;                                  // 0x790(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Fst_3_1;                                  // 0x798(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Wld_2_1;                                  // 0x7A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Wld_3_1;                                  // 0x7A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Sea_3_1;                                  // 0x7B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Isd_2_1;                                  // 0x7B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Isd_3_1;                                  // 0x7C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Cty_3_1;                                  // 0x7C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Cty_2_1;                                  // 0x7D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Mnt_3_1;                                  // 0x7D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Mnt_2_1;                                  // 0x7E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Cty_1_2;                                  // 0x7E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Snw_1_2;                                  // 0x7F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Snw_2_1;                                  // 0x7F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Snw_3_2;                                  // 0x800(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Snw_3_1;                                  // 0x808(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Isd_1_1;                                  // 0x810(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Cty_1_1;                                  // 0x818(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Mnt_1_2;                                  // 0x820(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Mnt_1_1;                                  // 0x828(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Snw_1_1;                                  // 0x830(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Sea_1_1;                                  // 0x838(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Wld_1_1;                                  // 0x840(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Fst_1_1;                                  // 0x848(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Twn_Dst_1_1;                                  // 0x850(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapPivotComponentV2_C*        EMAP_Dng_Sea_2_1;                                  // 0x858(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  GlobeMesh;                                         // 0x860(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Scene;                                             // 0x868(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x870(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_3DWorldMapActor_GlobeV2_C* GetDefaultObj();

	void ReceiveBeginPlay();
	void SetIsEnableMasksForPlayerSelect(bool IsEnable);
	void SetIsDisplayedIslandLayer(enum class EWorldMapIslandLayerArea MaskArea, bool IsDisplayed);
	void SetIsMaskedPrologueArea(enum class EWorldMapPrologueMaskArea MaskArea, bool IsMasked);
	void SetIsMaskedArea(enum class EWorldMapMaskArea MaskArea, bool IsMasked);
	void SetIsEnableMask(bool IsEnable);
	void GetGlobeMeshComponent(class UStaticMeshComponent** GlobeMesh);
	TArray<class UWorldMapPivotComponentBase*> GetAllPivots();
	void UserConstructionScript();
};

}


