#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x2 (0x2 - 0x0)
// Function BPI_MonsterListWidgetFocusableItem.BPI_MonsterListWidgetFocusableItem_C.BPI_ResetAppearance
struct IBPI_MonsterListWidgetFocusableItem_C_BPI_ResetAppearance_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function BPI_MonsterListWidgetFocusableItem.BPI_MonsterListWidgetFocusableItem_C.BPI_OnLeft
struct IBPI_MonsterListWidgetFocusableItem_C_BPI_OnLeft_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function BPI_MonsterListWidgetFocusableItem.BPI_MonsterListWidgetFocusableItem_C.BPI_OnRight
struct IBPI_MonsterListWidgetFocusableItem_C_BPI_OnRight_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function BPI_MonsterListWidgetFocusableItem.BPI_MonsterListWidgetFocusableItem_C.BPI_OutFocus
struct IBPI_MonsterListWidgetFocusableItem_C_BPI_OutFocus_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function BPI_MonsterListWidgetFocusableItem.BPI_MonsterListWidgetFocusableItem_C.BPI_Focus
struct IBPI_MonsterListWidgetFocusableItem_C_BPI_Focus_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function BPI_MonsterListWidgetFocusableItem.BPI_MonsterListWidgetFocusableItem_C.BPI_Decide
struct IBPI_MonsterListWidgetFocusableItem_C_BPI_Decide_Params
{
public:
	bool                                         IsDecided;                                         // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}


