#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x61 (0x61 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OpenFixedFollowNPCReleaseDialog
struct UFieldCommandWidgetPlacate_C_OpenFixedFollowNPCReleaseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x281 (0x281 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OpenFixedFollowNPCDialog
struct UFieldCommandWidgetPlacate_C_OpenFixedFollowNPCDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x1D8 (0x1D8 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OpenFailedDialog
struct UFieldCommandWidgetPlacate_C_OpenFailedDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.GetDialogInput
struct UFieldCommandWidgetPlacate_C_GetDialogInput_Params
{
public:
	int32                                        DialogInput;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.CloseDialog
struct UFieldCommandWidgetPlacate_C_CloseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x60 (0x60 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OpenSwapDialog
struct UFieldCommandWidgetPlacate_C_OpenSwapDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x6A (0x6A - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OpenReleaseDialog
struct UFieldCommandWidgetPlacate_C_OpenReleaseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x369 (0x369 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OpenFollowDialog
struct UFieldCommandWidgetPlacate_C_OpenFollowDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OnClosedSwapDialog
struct UFieldCommandWidgetPlacate_C_OnClosedSwapDialog_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OnClosedFailedDialog
struct UFieldCommandWidgetPlacate_C_OnClosedFailedDialog_Params
{
public:
	int32                                        DialogInput;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OnClosedReleaseDialog
struct UFieldCommandWidgetPlacate_C_OnClosedReleaseDialog_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x6 (0x6 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.OnClosedDialog
struct UFieldCommandWidgetPlacate_C_OnClosedDialog_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.Get Follow Placate Member
struct UFieldCommandWidgetPlacate_C_Get_Follow_Placate_Member_Params
{
public:
	class AKSCharacterBase*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x13 (0x13 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.IsChangeStateCloseFinish
struct UFieldCommandWidgetPlacate_C_IsChangeStateCloseFinish_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.SetReference
struct UFieldCommandWidgetPlacate_C_SetReference_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.IsRunning
struct UFieldCommandWidgetPlacate_C_IsRunning_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.SetupHelpUI
struct UFieldCommandWidgetPlacate_C_SetupHelpUI_Params
{
public:
	class FName                                  HeaderLabel;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  FooterLabel;                                       // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3C (0x3C - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.Tick
struct UFieldCommandWidgetPlacate_C_Tick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                        InDeltaTime;                                       // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function FieldCommandWidgetPlacate.FieldCommandWidgetPlacate_C.ExecuteUbergraph_FieldCommandWidgetPlacate
struct UFieldCommandWidgetPlacate_C_ExecuteUbergraph_FieldCommandWidgetPlacate_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


