#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x65 (0x65 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OpenFixedFollowNPCReleaseDialog
struct UFieldCommandWidgetHire_C_OpenFixedFollowNPCReleaseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x185 (0x185 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OpenFixedFollowNPCDialog
struct UFieldCommandWidgetHire_C_OpenFixedFollowNPCDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x180 (0x180 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OpenFailedDialog
struct UFieldCommandWidgetHire_C_OpenFailedDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.GetDialogInput
struct UFieldCommandWidgetHire_C_GetDialogInput_Params
{
public:
	int32                                        DialogInput;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.CloseDialog
struct UFieldCommandWidgetHire_C_CloseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x64 (0x64 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OpenSwapDialog
struct UFieldCommandWidgetHire_C_OpenSwapDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x71 (0x71 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OpenReleaseDialog
struct UFieldCommandWidgetHire_C_OpenReleaseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2C5 (0x2C5 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OpenFollowDialog
struct UFieldCommandWidgetHire_C_OpenFollowDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OnClosedSwapDialog
struct UFieldCommandWidgetHire_C_OnClosedSwapDialog_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OnClosedFailedDialog
struct UFieldCommandWidgetHire_C_OnClosedFailedDialog_Params
{
public:
	int32                                        DialogInput;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OnClosedReleaseDialog
struct UFieldCommandWidgetHire_C_OnClosedReleaseDialog_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x6 (0x6 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.OnClosedDialog
struct UFieldCommandWidgetHire_C_OnClosedDialog_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.Get Follow Hire Member
struct UFieldCommandWidgetHire_C_Get_Follow_Hire_Member_Params
{
public:
	class AKSCharacterBase*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x13 (0x13 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.IsChangeStateCloseFinish
struct UFieldCommandWidgetHire_C_IsChangeStateCloseFinish_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.SetReference
struct UFieldCommandWidgetHire_C_SetReference_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.IsRunning
struct UFieldCommandWidgetHire_C_IsRunning_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.SetupHelpUI
struct UFieldCommandWidgetHire_C_SetupHelpUI_Params
{
public:
	class FName                                  HeaderLabel;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  FooterLabel;                                       // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3C (0x3C - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.Tick
struct UFieldCommandWidgetHire_C_Tick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                        InDeltaTime;                                       // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function FieldCommandWidgetHire.FieldCommandWidgetHire_C.ExecuteUbergraph_FieldCommandWidgetHire
struct UFieldCommandWidgetHire_C_ExecuteUbergraph_FieldCommandWidgetHire_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


