#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.GetDialogInput
struct UFieldCommandWidgetLure_C_GetDialogInput_Params
{
public:
	int32                                        DialogInput;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x112 (0x112 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.OpenFixedFollowNPCReleaseDialog
struct UFieldCommandWidgetLure_C_OpenFixedFollowNPCReleaseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x181 (0x181 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.OpenFixedFollowNPCDialog
struct UFieldCommandWidgetLure_C_OpenFixedFollowNPCDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x1B9 (0x1B9 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.OpenSwapDialog
struct UFieldCommandWidgetLure_C_OpenSwapDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x122 (0x122 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.OpenReleaseDialog
struct UFieldCommandWidgetLure_C_OpenReleaseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x371 (0x371 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.OpenFollowDialog
struct UFieldCommandWidgetLure_C_OpenFollowDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.LureFailedCallback
struct UFieldCommandWidgetLure_C_LureFailedCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.LureChangeCallback
struct UFieldCommandWidgetLure_C_LureChangeCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.LureReleaseCallback
struct UFieldCommandWidgetLure_C_LureReleaseCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x6 (0x6 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.LureCallback
struct UFieldCommandWidgetLure_C_LureCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.Get Follow Lure Member
struct UFieldCommandWidgetLure_C_Get_Follow_Lure_Member_Params
{
public:
	class AKSCharacterBase*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x13 (0x13 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.IsChangeStateCloseFinish
struct UFieldCommandWidgetLure_C_IsChangeStateCloseFinish_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.SetReference
struct UFieldCommandWidgetLure_C_SetReference_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.IsRunning
struct UFieldCommandWidgetLure_C_IsRunning_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.SetupHelpUI
struct UFieldCommandWidgetLure_C_SetupHelpUI_Params
{
public:
	class FName                                  HeaderLabel;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  FooterLabel;                                       // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function FieldCommandWidgetLure.FieldCommandWidgetLure_C.ExecuteUbergraph_FieldCommandWidgetLure
struct UFieldCommandWidgetLure_C_ExecuteUbergraph_FieldCommandWidgetLure_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


