#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.GetDialogInput
struct UFieldCommandWidgetLead_C_GetDialogInput_Params
{
public:
	int32                                        DialogInput;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x61 (0x61 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.OpenFixedFollowNPCReleaseDialog
struct UFieldCommandWidgetLead_C_OpenFixedFollowNPCReleaseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x181 (0x181 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.OpenFixedFollowNPCDialog
struct UFieldCommandWidgetLead_C_OpenFixedFollowNPCDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x52 (0x52 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.OpenSwapDialog
struct UFieldCommandWidgetLead_C_OpenSwapDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x181 (0x181 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.OpenFailedDialog
struct UFieldCommandWidgetLead_C_OpenFailedDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x69 (0x69 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.OpenReleaseDialog
struct UFieldCommandWidgetLead_C_OpenReleaseDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x209 (0x209 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.OpenFollowDialog
struct UFieldCommandWidgetLead_C_OpenFollowDialog_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x18 (0x18 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.Get Follow Lead Member
struct UFieldCommandWidgetLead_C_Get_Follow_Lead_Member_Params
{
public:
	class AKSCharacterBase*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.LeadFailedCallback
struct UFieldCommandWidgetLead_C_LeadFailedCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.LeadReleaseCallback
struct UFieldCommandWidgetLead_C_LeadReleaseCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x6 (0x6 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.LeadCallback
struct UFieldCommandWidgetLead_C_LeadCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.LeadChangeCallback
struct UFieldCommandWidgetLead_C_LeadChangeCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x13 (0x13 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.IsChangeStateCloseFinish
struct UFieldCommandWidgetLead_C_IsChangeStateCloseFinish_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.SetReference
struct UFieldCommandWidgetLead_C_SetReference_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.IsRunning
struct UFieldCommandWidgetLead_C_IsRunning_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.SetupHelpUI
struct UFieldCommandWidgetLead_C_SetupHelpUI_Params
{
public:
	class FName                                  HeaderLabel;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  FooterLabel;                                       // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function FieldCommandWidgetLead.FieldCommandWidgetLead_C.ExecuteUbergraph_FieldCommandWidgetLead
struct UFieldCommandWidgetLead_C_ExecuteUbergraph_FieldCommandWidgetLead_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


