#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x8 (0x8 - 0x0)
// Function KSGameInstanceBP.KSGameInstanceBP_C.GetStartLevel
struct UKSGameInstanceBP_C_GetStartLevel_Params
{
public:
	class FName                                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function KSGameInstanceBP.KSGameInstanceBP_C.GetIsDebugLoadLevel
struct UKSGameInstanceBP_C_GetIsDebugLoadLevel_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function KSGameInstanceBP.KSGameInstanceBP_C.GetFirstSpawn
struct UKSGameInstanceBP_C_GetFirstSpawn_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function KSGameInstanceBP.KSGameInstanceBP_C.SetDebugMode
struct UKSGameInstanceBP_C_SetDebugMode_Params
{
public:
	bool                                         IsDebug;                                           // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function KSGameInstanceBP.KSGameInstanceBP_C.SetFirstSpawn
struct UKSGameInstanceBP_C_SetFirstSpawn_Params
{
public:
	bool                                         FirstSpawn;                                        // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function KSGameInstanceBP.KSGameInstanceBP_C.SetDebugLoadLevel
struct UKSGameInstanceBP_C_SetDebugLoadLevel_Params
{
public:
	bool                                         DebugLoadLebel;                                    // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function KSGameInstanceBP.KSGameInstanceBP_C.SetStartLevel
struct UKSGameInstanceBP_C_SetStartLevel_Params
{
public:
	class FName                                  LevelName;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x13 (0x13 - 0x0)
// Function KSGameInstanceBP.KSGameInstanceBP_C.ExecuteUbergraph_KSGameInstanceBP
struct UKSGameInstanceBP_C_ExecuteUbergraph_KSGameInstanceBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


