#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.IsChangeStateCloseFinish
struct UMainMenuListWidgetBase_C_IsChangeStateCloseFinish_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x1A (0x1A - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.IsChangeStateOpenFinish
struct UMainMenuListWidgetBase_C_IsChangeStateOpenFinish_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.SetReference
struct UMainMenuListWidgetBase_C_SetReference_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.IsRunning
struct UMainMenuListWidgetBase_C_IsRunning_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xC (0xC - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.CallListEvent
struct UMainMenuListWidgetBase_C_CallListEvent_Params
{
public:
	enum class ELIST_EVENT_TYPE                  EventType;                                         // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_35[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CategoryIdx;                                       // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ItemIdxInAll;                                      // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x19 (0x19 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.SetListObject
struct UMainMenuListWidgetBase_C_SetListObject_Params
{
public:
	class UListWidget_C*                         ListWidget;                                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      WidgetOpenAnim;                                    // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      WidgetCloseAnim;                                   // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x14 (0x14 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.ListWidgetPushPop
struct UMainMenuListWidgetBase_C_ListWidgetPushPop_Params
{
public:
	bool                                         IsPush;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.ConstructEvent
struct UMainMenuListWidgetBase_C_ConstructEvent_Params
{
public:
	bool                                         UseCategory;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ELIST_NUM_UNIT_TYPE               NumUnitType;                                       // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.IsActive
struct UMainMenuListWidgetBase_C_IsActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xC (0xC - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.BaseListEvent
struct UMainMenuListWidgetBase_C_BaseListEvent_Params
{
public:
	enum class ELIST_EVENT_TYPE                  EventType;                                         // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_42[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CategoryIdx;                                       // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ItemIdxInAll;                                      // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.CreateCategory
struct UMainMenuListWidgetBase_C_CreateCategory_Params
{
public:
	TArray<struct FListWidgetCategory>           ListWidgetCategory;                                // 0x0(0x10)(Parm, OutParm)
};

// 0x10 (0x10 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.CreateListItem
struct UMainMenuListWidgetBase_C_CreateListItem_Params
{
public:
	TArray<struct FMJListWidgetItemData>         ListWidgetItem;                                    // 0x0(0x10)(Parm, OutParm)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.OnRightAxisX
struct UMainMenuListWidgetBase_C_OnRightAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.OnRightAxisY
struct UMainMenuListWidgetBase_C_OnRightAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.OnLeftAxisX
struct UMainMenuListWidgetBase_C_OnLeftAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.OnLeftAxisY
struct UMainMenuListWidgetBase_C_OnLeftAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.OnGamePadAxisX
struct UMainMenuListWidgetBase_C_OnGamePadAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.OnGamePadAxisY
struct UMainMenuListWidgetBase_C_OnGamePadAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.OnListPaging
struct UMainMenuListWidgetBase_C_OnListPaging_Params
{
public:
	bool                                         IsLeftInput;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.WorldMapSlowCursorX
struct UMainMenuListWidgetBase_C_WorldMapSlowCursorX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.WorldMapSlowCursorY
struct UMainMenuListWidgetBase_C_WorldMapSlowCursorY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.HelpScrollAxis
struct UMainMenuListWidgetBase_C_HelpScrollAxis_Params
{
public:
	float                                        AxisaValue;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3C (0x3C - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.Tick
struct UMainMenuListWidgetBase_C_Tick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                        InDeltaTime;                                       // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x68 (0x68 - 0x0)
// Function MainMenuListWidgetBase.MainMenuListWidgetBase_C.ExecuteUbergraph_MainMenuListWidgetBase
struct UMainMenuListWidgetBase_C_ExecuteUbergraph_MainMenuListWidgetBase_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


