#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class Majesty.DataTableUtilityBase
class UDataTableUtilityBase : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDataTableUtilityBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Majesty.AbilityDataTableUtility
class UAbilityDataTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UAbilityDataTableUtility* GetDefaultObj();

	bool IsDivineAbilitySet(class FName TargetLabel, bool LogEnable);
	bool GetAbilitySetRowData(struct FAbilitySetDataBase* OutData, class FName TargetLabel, bool LogEnable);
	bool GetAbilityRowNames(enum class EBPFuncReturnCode* ReturnCode, TArray<class FName>* OutRowNames);
	bool GetAbilityRowData(enum class EBPFuncReturnCode* ReturnCode, struct FAbilityDataBase* OutData, class FName TargetLabel, bool LogEnable);
};

// 0x60 (0x2C0 - 0x260)
// Class Majesty.AcqUserWidget
class UAcqUserWidget : public UUserWidget
{
public:
	class UWidgetAnimation*                      ResetToDefaultAnim;                                // 0x260(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<enum class EWidgetAnimationGroup, struct FWidgetAnimationGroupData> WidgetAnimationGroup;                              // 0x268(0x50)(Protected, NativeAccessSpecifierProtected)
	bool                                         StopTickWhenWidgetPaused;                          // 0x2B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_695[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAcqUserWidget* GetDefaultObj();

	void StopAnimsImmediately(TArray<class UWidgetAnimation*>& Anims);
	void StopAnimImmediately(class UWidgetAnimation* Anim);
	void StopAllAnimImmediatelyByGroup(enum class EWidgetAnimationGroup Group);
	void StopAllAnimImmediately();
	void ResetAppearance();
	void GroupingAnimations();
	float GetNormalizedElapsedTime(class UWidgetAnimation* Anim);
	bool GetAllAnimations(TArray<class UWidgetAnimation*>* OutAllAnims);
	void EvaluateAnimationSpecificFrame(class UWidgetAnimation* Anim, int32 Frame, bool IsStopAllAnimBeforeEval);
	void EvaluateAnimationLastFrame(class UWidgetAnimation* Anim, bool IsStopAllAnimBeforeEval);
	void AddNonGroupingAnimationsToDefaultGroup();
	void AddAnimationsToGroup(enum class EWidgetAnimationGroup Group, const TArray<class UWidgetAnimation*>& Anims);
	class UUMGSequencePlayer* AcqPlayAnimationDefault(class UWidgetAnimation* Anim, float StartAtTime, bool IsStopAllAnimBeforePlay, int32 NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	class UUMGSequencePlayer* AcqPlayAnimationAtTime(class UWidgetAnimation* Anim, float StartAtTime, bool IsStopAllAnimBeforePlay);
	class UUMGSequencePlayer* AcqPlayAnimation(class UWidgetAnimation* Anim, bool IsStopAllAnimBeforePlay, bool IsFast);
};

// 0x98 (0x358 - 0x2C0)
// Class Majesty.KSUserWidgetBase
class UKSUserWidgetBase : public UAcqUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnOpenCallback;                                    // 0x2C0(0x10)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnOpenFinishCallback;                              // 0x2D0(0x10)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCloseCallback;                                   // 0x2E0(0x10)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCloseFinishCallback;                             // 0x2F0(0x10)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnCloseFinishCallbackBP;                           // 0x300(0x10)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        M_TemporaryHideUser;                               // 0x310(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6D6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidgetAnimation*                      OpenAnim;                                          // 0x318(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      CloseAnim;                                         // 0x320(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UWidgetAnimation*>              AnimationList;                                     // 0x328(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_6D7[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UKSUserWidgetBase* GetDefaultObj();

	void UpdateOpening();
	void UpdateMain();
	void UpdateClosing();
	void UIOpen();
	void UIClose();
	void TurnOffTemporaryHiddenFlag(enum class EWIDGET_TEMPORARY_HIDE_USER HideUser);
	void TickUpdateState(float FDeltaTime);
	bool SetReference();
	void SetManualAnimationUpdate(bool bManual);
	void ResetInputAllowed();
	void ResetFromTitle();
	void ResetForceUIClose();
	void RefreshLanguage(enum class EKSLanguage NewLanguage);
	void OnResetHiddenFlag();
	void OnOpenFinish();
	void OnCloseFinish();
	void NoticeCreatedWidget(enum class EWIDGET_CREATE_PHASE CreatePhase);
	void ManualAnimationUpdate(struct FGeometry& MyGeometry, float InDeltaTime);
	bool IsWait();
	bool IsUpdate();
	bool IsTemporaryHidden();
	bool IsRunning();
	bool IsForceClosing();
	bool IsChangeStateOpenFinish();
	bool IsChangeStateCloseFinish();
	bool Init();
	void HideTemporaryInternal(bool IsHidden, enum class EWIDGET_TEMPORARY_HIDE_USER HideUser);
	void HideTemporary(bool IsHidden, enum class EWIDGET_TEMPORARY_HIDE_USER HideUser);
	bool GetPlayingAnimation(class UWidgetAnimation** Animation);
	bool GetManualAnimationUpdate();
	float GetDeltaTime();
	void ForceUIClose();
	class UUserWidget* FindWidget(class FName& WidgetName);
	class FString Debug_GetStateInfoAsString();
	void Debug_DecideUI(int32 Param);
	bool CheckInputAllowed();
};

// 0x10 (0x368 - 0x358)
// Class Majesty.AbilityForgetWidgetBase
class UAbilityForgetWidgetBase : public UKSUserWidgetBase
{
public:
	FMulticastInlineDelegateProperty_            OnSelectForgetAbility;                             // 0x358(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAbilityForgetWidgetBase* GetDefaultObj();

	bool SetAbilityList(TArray<int32>& AbilityList);
	bool OpenList();
	bool OpenConfirmList();
	bool CloseList();
	void CallOnSelectForgetAbility(int32 SelectCursorPosition, bool IsDecide);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.AchievementDataTableUtility
class UAchievementDataTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UAchievementDataTableUtility* GetDefaultObj();

	void NotifyAchievementDb(class FName DbName, enum class EDBNoticeType Notice);
	TArray<class FName> GetAchievementAllLabels();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.AchievementDebugUtility
class UAchievementDebugUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAchievementDebugUtility* GetDefaultObj();

};

// 0x10 (0x230 - 0x220)
// Class Majesty.AcqManagerBase
class AAcqManagerBase : public AActor
{
public:
	uint8                                        Pad_71F[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAcqManagerBase* GetDefaultObj();

	void UpdateManager(float DeltaSeconds);
	void StartManager();
	bool ResetManagerFromTitle();
	bool ResetManager();
	bool PrepareManager();
	void PostInitManager();
	void OnBeginPlay();
	bool IsAvailable();
	bool DestroyManager();
};

// 0x8 (0x238 - 0x230)
// Class Majesty.AchievementManager
class AAchievementManager : public AAcqManagerBase
{
public:
	class UServiceConnecter*                     M_Service;                                         // 0x230(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AAchievementManager* GetDefaultObj();

	void OnWorldMapOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnUnLockAchievement();
	void OnTitleScene(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnSwoonNpcByFc(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnSubStoryRecordOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnSubStoryClear(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnStoryRecordReOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnStoryRecordOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnStartFieldMainSequenceAfterExBoss(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnRefreshFollowCharacter(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnPartyMemberChangeMenuOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnOpenEndCardEpilogue(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnOpenEndCard(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnMusicRecordOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnMainStoryTaskClear(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnMainStoryClear(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnJoinedCharacter(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnJobMenuOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnItemMenuOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnInformationFieldCommandOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnGetItem(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnFinishFieldCommand(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnEquipMenuOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnCreatedPlayerController(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnChangeVisitedLevel(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnBreak(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnBoostAttack(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnBeginLinerShip(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnAttack(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnAcquisitionAdvancedAbility(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnAcquisitionAbility(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void OnAbilityMenuOpen(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	class AAchievementManager* GetInstance();
	enum class EAchievementStatus GetAchievementStatus(class FName AchiveLabel);
	void DelayOnEpilogueEndCardUnlockAchievement(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void DelayOnEndCardUnlockAchievement(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	void Debug_ShowDebugInfo(bool bEnable);
	void Debug_SetFieldCommandSuccessCount(enum class EMJFieldCommandType FCType, int32 Count);
	bool Debug_ResetAllAchievement();
	bool Debug_ForceUnlockAchievement(class FName AchieveLabel);
	bool Debug_ForceLockAchievement(class FName AchieveLabel);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.SaveDataUtilBase
class USaveDataUtilBase : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class USaveDataUtilBase* GetDefaultObj();

	class UMJSaveData* GetSaveData();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.AchievementSaveDataUtil
class UAchievementSaveDataUtil : public USaveDataUtilBase
{
public:

	static class UClass* StaticClass();
	static class UAchievementSaveDataUtil* GetDefaultObj();

	int32 GetSwoonNpcUniqueCount();
	int32 GetMaxAttackDamage();
	int32 GetLinerShipCount();
	int32 GetFieldCommandSuccessCount(enum class EMJFieldCommandType FCType);
	int32 GetDivineAbilityCount();
	int32 GetBreakAttackCount();
	int32 GetBoostAttackCount(enum class EBOOST_LEVEL BoostLevel);
	int32 GetAdvancedAbilityCount();
	int32 GetAbilityCount();
	void Debug_SetSwoonNpcUniqueCount(int32 NewCount);
	void Debug_SetMaxAttackDamage(int32 NewCount);
	void Debug_SetLinerShipCount(int32 NewCount);
	void Debug_SetFieldCommandSuccessCount(enum class EMJFieldCommandType FCType, int32 Count);
	void Debug_SetDivineAbilityCount(int32 NewCount);
	void Debug_SetBreakAttackCount(int32 NewCount);
	void Debug_SetBoostAttackCount(enum class EBOOST_LEVEL BoostLevel, int32 NewCount);
	void Debug_SetAdvancedAbilityCount(int32 NewCount);
	void Debug_SetAbilityCount(int32 NewCount);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.AchievementTypeDataTableUtility
class UAchievementTypeDataTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UAchievementTypeDataTableUtility* GetDefaultObj();

	void NotifyAchievementTypeDb(class FName DbName, enum class EDBNoticeType Notice);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.AchievementUtility
class UAchievementUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAchievementUtility* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Majesty.AcqGameplayStatics
class UAcqGameplayStatics : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAcqGameplayStatics* GetDefaultObj();

};

// 0x90 (0x2A0 - 0x210)
// Class Majesty.AcqImage
class UAcqImage : public UImage
{
public:
	enum class EAcqImageResourceType             ResourceType;                                      // 0x210(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         SetResourceFromOnRebuilt;                          // 0x211(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_81B[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             Acq_TextureForPreview;                             // 0x218(0x28)(Edit, BlueprintVisible, EditConst, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  Acq_TextureLabelForRuntime_AutoFill;               // 0x240(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  Acq_TextureLabelForRuntime;                        // 0x248(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FMateriaTextureLabel> Acq_MaterialTextureParams;                         // 0x250(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAcqImage* GetDefaultObj();

	void ResetBrushResource();
};

// 0x0 (0x858 - 0x858)
// Class Majesty.AcqListView
class UAcqListView : public UListView
{
public:

	static class UClass* StaticClass();
	static class UAcqListView* GetDefaultObj();

	void SetNumDesignerPreviewEntries(int32 Num);
	void SetEntryWidgetClass(TSubclassOf<class UAcqUserWidget> NewEntryWidgetClass);
	class UUserWidget* GetSelectItemWidget(class UObject* Item);
};

// 0x10 (0x38 - 0x28)
// Class Majesty.AcqListViewEntryItemBase
class UAcqListViewEntryItemBase : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnChangedEntryItem;                                // 0x28(0x10)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAcqListViewEntryItemBase* GetDefaultObj();

};

// 0x48 (0x308 - 0x2C0)
// Class Majesty.AcqListViewWidget
class UAcqListViewWidget : public UAcqUserWidget
{
public:
	FMulticastInlineDelegateProperty_            DecideEventDelegate;                               // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            CancelEventDelegate;                               // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UAcqListView*                          M_ListView;                                        // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_CurrentCursorIndex;                              // 0x2E8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                             M_CurrentDisplayItemRange;                         // 0x2EC(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_866[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAcqUserWidget>            M_EntryWidgetClass;                                // 0x2F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_ItemDisplayNum;                                  // 0x300(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_867[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAcqListViewWidget* GetDefaultObj();

	void Setup(TArray<class UAcqListViewEntryItemBase*>& EntryItems);
	void SetSelectedIndex(int32 Index);
	void SetScrollOffset(float ScrollOffset);
	void SetEntryItems(TArray<class UAcqListViewEntryItemBase*>& EntryItems);
	int32 GetSelectedIndex();
	float GetScrollOffset();
	class UAcqListView* GetListView();
	TArray<class UAcqListViewEntryItemBase*> GetEntryItems();
	int32 GetEntryItemNum();
	void DecideEvent__DelegateSignature(const struct FAcqListViewWidgetEventPayload& Payload);
	void ClearEntryItems();
	void CancelEvent__DelegateSignature();
	float AddScrollOffset(float Delta);
};

// 0x2F0 (0x510 - 0x220)
// Class Majesty.AcqManagerFactory
class AAcqManagerFactory : public AActor
{
public:
	uint8                                        Pad_889[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            M_ManagerList;                                     // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_88A[0xA0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class UClass*>             M_NameToClass;                                     // 0x2E0(0x50)(NativeAccessSpecifierPrivate)
	TMap<class FName, class UClass*>             M_NameToBaseClass;                                 // 0x330(0x50)(NativeAccessSpecifierPrivate)
	TMap<class UClass*, class FName>             M_BaseClassToName;                                 // 0x380(0x50)(NativeAccessSpecifierPrivate)
	TMap<class FName, TWeakObjectPtr<class AAcqManagerBase>> M_apManagerTable;                                  // 0x3D0(0x50)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_88B[0xF0];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAcqManagerFactory* GetDefaultObj();

	void StartManagers(enum class EMANAGER_CREATE_PHASE CreatePhase);
	void SetInitAfterSpawn(class FName ManagerName, FDelegateProperty_& InitAfterSpawn);
	void ResetTables();
	void ResetManagersFromTitle();
	void ResetManagersAll();
	void ResetManagers(enum class EMANAGER_CREATE_PHASE CreatePhase);
	void PostInitManagers(enum class EMANAGER_CREATE_PHASE CreatePhase);
	void OnLoadedClassObject(TArray<class UObject*>& ObjList);
	bool IsExist(class FName ManagerName);
	bool IsAvailableByCategory(enum class EMANAGER_CREATE_PHASE CreatePhase);
	void Initialize(TSoftObjectPtr<class UDataTable> ManagerTable);
	class AAcqManagerBase* GetManagerInstance(class UClass* ManagerClass);
	class AAcqManagerBase* GetManager(class FName ManagerName);
	class AAcqManagerFactory* GetInstance();
	void DestroyManagers(enum class EMANAGER_CREATE_PHASE CreatePhase);
	void DestroyManager(class FName ManagerName);
	void Debug_ShowManagerInfo(bool bShow);
	void Debug_GetManagerInfo(class FString& OutDebugInfo);
	bool CreateManagersSequentially(enum class EMANAGER_CREATE_PHASE CreatePhase);
	void CreateManagers(enum class EMANAGER_CREATE_PHASE CreatePhase);
	bool CreateManagerClassesSequentially(enum class EMANAGER_CREATE_PHASE CreatePhase);
};

// 0xD8 (0x2F8 - 0x220)
// Class Majesty.ActionCommandBase
class AActionCommandBase : public AActor
{
public:
	class FName                                  M_strActionLabel;                                  // 0x220(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABattleCharacterBase*                  M_cEnforcer;                                       // 0x228(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ABattleCharacterBase*>          M_acSubEnforcerList;                               // 0x230(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ABattleCharacterBase*>          M_acTarget;                                        // 0x240(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ABattleCharacterBase*>          M_acSubTargetList;                                 // 0x250(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        M_nOptionIndex;                                    // 0x260(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  M_strOptionData;                                   // 0x264(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A20[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          M_astrOptionDataList;                              // 0x270(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         M_bEnableRandomTarget;                             // 0x280(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bEnableSkillALL;                                 // 0x281(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bEnableDamageUpWithFullHP;                       // 0x282(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bSettledPlayOnce_OnRecovered;                    // 0x283(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bAblityHit;                                      // 0x284(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bAttackHitFailed;                                // 0x285(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsLastHit;                                      // 0x286(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bEnableRandomCover;                              // 0x287(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bExecRandomCover;                                // 0x288(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A21[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABattleCharacterBase*                  M_cRandomCoverEnforcer;                            // 0x290(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bExecutedCounterTrap;                            // 0x298(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsForceWeakness;                                // 0x299(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A22[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nAdditiveBreakDamage;                            // 0x29C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActionCommandBase*                    M_cSummonOwnerAbility;                             // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsSummonAbility;                                // 0x2A8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsSummonLastHit;                                // 0x2A9(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsSettledAutoTameMonster;                       // 0x2AA(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A23[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ULevelSequencePlayer*                  M_cActionCommandSequencePlayer;                    // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABattleAbilitySequenceActor*           M_cActionCommandSequenceActor;                     // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelSequence*                        M_cCommandSequence;                                // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bEnableCommandSequence;                          // 0x2C8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bReadyCommandSequence;                           // 0x2C9(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A24[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nTotalSlideFrame;                                // 0x2CC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bExecCommandSequence;                            // 0x2D0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsInfomation;                                   // 0x2D1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsOnHitSE;                                      // 0x2D2(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A25[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  M_strOnHitSEID;                                    // 0x2D4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsSessionSupport;                               // 0x2DC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsBusinessSupport;                              // 0x2DD(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A26[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  M_strBusinessSupportInfo;                          // 0x2E0(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AActionCommandBase* GetDefaultObj();

	bool WeaponChangeCommand(enum class EWEAPON_CATEGORY WeaponType);
	bool WaitSummonAbilityCommand();
	void WaitSummonAbility();
	bool WaitSessionSupporterCommand();
	bool WaitSessionAbilityCommand();
	void WaitLoadCommandSequence();
	bool WaitEnemyActionCommand();
	void WaitCaptureMainPartyCommand();
	void WaitCallSubPartyCommand();
	bool WaitBusinessSupporterCommand();
	void SuspendActionCommand();
	void StartCommandSequence();
	bool ShowInfomationCommand(class FName TextID);
	bool ShowBusinessSupportInfomationCommand();
	bool SetupRandomAbilityEffect();
	void SetTargetList(TArray<class ABattleCharacterBase*>& AcTargetList);
	bool SetSummonAbility(bool bEnable, bool bLastHit, class FName StrActionLabel, class AActionCommandBase* COwnerAbility);
	void SetSubTargetList(TArray<class ABattleCharacterBase*>& AcSubTargetList);
	void SetSubEnforcerList(TArray<class ABattleCharacterBase*>& AcSubEnforcerList);
	void SetSettledPlayOnce_OnRecovered(bool bEnable);
	void SetSettledAutoTameMonster(bool bExec);
	void SetOptionDataList(TArray<class FName>& AstrOptionDataList, class FName StrActionLabel, int32 NOptionIndex, bool bUseGrowMagicBuff);
	void SetOptionData(class FName StrOptionData, int32 NOptionIndex);
	void SetExecutedCounterTrap(bool bExec);
	void SetEnforcer(class ABattleCharacterBase* CEnforcer);
	void SetBusinessSupportInfomationText(class FText& StrInfoText);
	void SetAttackHitFailed(bool bFailed);
	void SetAdditiveBreakDamage(int32 NBreakDamage);
	void SetActionCommandSequenceActor(class ABattleAbilitySequenceActor* CSequenceActor);
	bool ReturnSummonCharacterCommand();
	bool ReturnSessionSupporterCommand();
	bool ReturnBusinessSupporterCommand();
	void ResumeActionCommandSequencer();
	void RequestLoadCommandSequence(TSoftObjectPtr<class ULevelSequence>& CCommandSequence);
	bool RegisterOnHitSECommand(class FName SEID);
	bool PlayWeaponAttackCommand(class ABattleCharacterBase* ActionCharacter);
	bool PlayVoiceCommand(enum class EBATTLE_VOICE_TYPE VoiceID, enum class EPlayableCharacterID UniqueCharaID, enum class EBATTLE_VOICE_TYPE UniqueVoiceID);
	bool PlayVibrationCommand(class FName VibrationID, enum class EVibrationPower Power);
	bool PlaySessionActionCommand(enum class EKSCharacterAction BattleActionID);
	bool PlaySECommand(class FName SEID);
	bool PlayBusinessSupportActionCommand(enum class EKSCharacterAction BattleActionID);
	bool PlayActionForSelfOnlyCommand(class ABattleCharacterBase* ActionCharacter, enum class EKSCharacterAction BattleSelfActionID, enum class EKSCharacterAction BattleOtherActionID, bool bExceptEnforcer);
	bool PlayActionCommand(class ABattleCharacterBase* ActionCharacter, enum class EKSCharacterAction BattleActionID, enum class EPlayableCharacterID UniqueCharaID, enum class EKSCharacterAction UniqueActionID, bool bExceptEnforcer);
	bool PlayAbilitySECommand(int32 Index);
	void PauseActionCommandSequencer();
	bool OnAttackDamageSP(class ABattleCharacterBase* CEnforcer);
	bool OnAttackDamageHP(class ABattleCharacterBase* CEnforcer);
	void IsUseItemCommand(bool* bIsUseItemCommand, bool* bIsMeatItem);
	bool IsSettledAutoTameMonster();
	bool IsSessionSupportCommand();
	bool IsPlayOnHitDamageVoice();
	void IsMusicalCommand(bool* bIsSong, bool* bIsDance);
	bool IsForceWeakness();
	bool IsBusinessSupportCommand();
	bool HideInfomationCommand();
	TArray<class ABattleCharacterBase*> GetTargetList();
	TArray<class ABattleCharacterBase*> GetSubTargetList();
	TArray<class ABattleCharacterBase*> GetSubEnforcerList();
	bool GetSettledPlayOnce_OnRecovered();
	void GetInvadeMonsterSize(enum class ECHARACTER_SIZE* OutCharacterSize);
	bool GetExecutedCounterTrap();
	class ABattleCharacterBase* GetEnforcer();
	void GetCriticalPower(bool bCritical, float* OutRatio);
	bool GetAttackHitFailed();
	class FName GetActionLabel();
	class FName GetAbilityEffect(int32 NIndex);
	void FinishCommandSequence();
	bool ExecSummonCharacterCommand(int32 NSummonIndex, bool bRandom);
	bool ExecSummonAbilityCommand(int32 NSummonIndex);
	bool ExecStepCounter();
	bool ExecStartCharacterWarpCommand(const struct FVector& CCommandOffset);
	bool ExecSpecialAilmentCommand();
	bool ExecSessionAbilityCommand();
	bool ExecPlayDiseaseMissUI();
	bool ExecEndCharacterWarpCommand();
	void ExecCaptureMainPartyCommand();
	void ExecCallSubPartyCommand();
	bool ExecAilmentCommand(int32 Index, bool AllAilment, bool LastHit);
	float ConvertFrameToSecondByFrameRate(int32 NFrameNumber, const struct FFrameRate& CFrameRate);
	bool CheckStealMoney(class ABattleCharacterBase* CStealTarget, int32 NStealRateMin);
	bool CheckStealItem(class ABattleCharacterBase* CStealTarget, int32 NStealRateMin);
	enum class EBATTLE_SEQUENCE_PATTERN_TYPE CheckSequencePattern();
	bool CheckLastHit(class ABattleCharacterBase* CTarget);
	bool CheckEnableExcitementBuff();
	bool CheckEnableAutoTameMonster();
	bool CheckBoostLevelLess(int32 NBorderLevel, bool bContainEqual);
	bool CheckBoostLevelGreater(int32 NBorderLevel, bool bContainEqual);
	bool CheckAttackCounter();
	bool CheckAbilityHit();
	bool CallSessionSupporterCommand();
	bool CallBusinessSupporterCommand();
	void CalcBreakDamage(enum class EATTRIBUTE_RESIST EAttributeWeak, enum class EATTRIBUTE_RESIST EWeaponWeak, int32* OutBreakDamage);
};

// 0x8 (0x40 - 0x38)
// Class Majesty.ActionCommandDirector
class UActionCommandDirector : public ULevelSequenceDirector
{
public:
	uint8                                        Pad_BA0[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActionCommandDirector* GetDefaultObj();

	void WeaponChange_Implementation(enum class EWEAPON_CATEGORY WeaponType);
	void WaitSummonAbility_Implementation();
	void WaitSessionSupporter_Implementation();
	void WaitSessionAbility_Implementation();
	void WaitEnemyAction_Implementation();
	void WaitCaptureMainParty_Implementation();
	void WaitCallSubParty_Implementation();
	void WaitBusinessSupporter_Implementation();
	void ShowInfomation_Implementation(class FName TextID);
	void ShowBusinessSupportInfomation_Implementation();
	void SetMaterialParameter_Vector_Implementation(class AEmitter* Emitter, class FName ParameterName, const struct FVector& Value);
	void SetMaterialParameter_Float_Implementation(class AEmitter* Emitter, class FName ParameterName, float Value);
	void SetActionCommand(class AActionCommandBase* CActionCommand);
	void ReturnSummonCharacter_Implementation();
	void ReturnSessionSupporter_Implementation();
	void ReturnBusinessSupporter_Implementation();
	void RegisterOnHitSE_Implementation(class FName SEID);
	void RandomJumpToMarker_Implementation(float Rate, const class FString& Marker);
	void RandomJumpToFrame_Implementation(float Rate, int32 Frame);
	void PlayWeaponAttack_Implementation(class ABattleCharacterBase* ActionCharacter);
	void PlayVoiceWithAbilityHit_Implementation(enum class EBATTLE_VOICE_TYPE VoiceType, enum class EPlayableCharacterID UniqueCharaID, enum class EBATTLE_VOICE_TYPE UniqueVoiceType, bool OnHit);
	void PlayVoice_Implementation(enum class EBATTLE_VOICE_TYPE VoiceType, enum class EPlayableCharacterID UniqueCharaID, enum class EBATTLE_VOICE_TYPE UniqueVoiceType);
	void PlayVibration_Implementation(class FName VibrationID, enum class EVibrationPower Power);
	void PlaySEWithAbilityHit_Implementation(class FName SEID, bool OnHit);
	void PlaySessionAction_Implementation(enum class EKSCharacterAction BattleActionID);
	void PlaySE_Implementation(class FName SEID);
	void PlayBusinessSupportAction_Implementation(enum class EKSCharacterAction BattleActionID);
	void PlayActionWithAbilityHit_Implementation(class ABattleCharacterBase* ActionCharacter, enum class EKSCharacterAction BattleActionID, enum class EPlayableCharacterID UniqueCharaID, enum class EKSCharacterAction UniqueActionID, bool OnHit);
	void PlayActionForSelfOnly_Implementation(class ABattleCharacterBase* ActionCharacter, enum class EKSCharacterAction BattleSelfActionID, enum class EKSCharacterAction BattleOtherActionID, bool bExceptEnforcer);
	void PlayAction_Implementation(class ABattleCharacterBase* ActionCharacter, enum class EKSCharacterAction BattleActionID, enum class EPlayableCharacterID UniqueCharaID, enum class EKSCharacterAction UniqueActionID, bool bExceptEnforcer);
	void PlayAbilitySEWithAbilityHit_Implementation(int32 Index, bool OnHit);
	void PlayAbilitySE_Implementation(int32 Index);
	void JumpToMarker_Implementation(const class FString& StrMarker);
	void JumpToFrame_Implementation(int32 Frame);
	void HideInfomation_Implementation();
	void ExecSummonCharacter_Implementation(int32 SummonIndex, bool Random);
	void ExecSummonAbility_Implementation(int32 SummonIndex);
	void ExecStepCounter_Implementation();
	void ExecStartCharacterWarp_Implementation(const struct FVector& CCommandOffset);
	void ExecSpecialAilment_Implementation();
	void ExecSessionAbility_Implementation();
	void ExecPlayDiseaseMissUI_Implementation();
	void ExecEndCharacterWarp_Implementation();
	void ExecCaptureMainParty_Implementation();
	void ExecCallSubParty_Implementation();
	void ExecAilmentWithAbilityHit_Implementation(int32 Index, bool AllAilment, bool LastHit, bool OnHit);
	void ExecAilment_Implementation(int32 Index, bool AllAilment, bool LastHit);
	void CheckPattern3JumpToMarker_Implementation(const class FString& PatternB, const class FString& PatternC);
	void CheckPattern3JumpToFrame_Implementation(int32 PatternB, int32 PatternC);
	void CheckPattern2JumpToMarker_Implementation(const class FString& PatternB);
	void CheckPattern2JumpToFrame_Implementation(int32 PatternB);
	void CheckMultiPatternJumpToMarker_Implementation(const TArray<class FString>& MarkerList);
	void CheckMultiPatternJumpToFrame_Implementation(const TArray<int32>& FrameList);
	bool CheckGPUEmitter(class UParticleSystem* CTarget, int32 NIndex);
	void CheckCounterJumpToMarker_Implementation(const class FString& Marker);
	void CheckCounterJumpToFrame_Implementation(int32 Frame);
	void CheckBoostLevelLessJumpToMarker_Implementation(int32 BorderLevel, bool ContainEqual, const class FString& Marker);
	void CheckBoostLevelLessJumpToFrame_Implementation(int32 BorderLevel, bool ContainEqual, int32 Frame);
	void CheckBoostLevelGreaterJumpToMarker_Implementation(int32 BoostLevel, bool ContainEqual, const class FString& Marker);
	void CheckBoostLevelGreaterJumpToFrame_Implementation(int32 BoostLevel, bool ContainEqual, int32 Frame);
	void CheckAbilityHitJumpToMarker_Implementation(bool OnHit, const class FString& Marker);
	void CheckAbilityHitJumpToFrame_Implementation(bool OnHit, int32 Frame);
	void CallSessionSupporter_Implementation();
	void CallBusinessSupporter_Implementation();
};

// 0x8 (0xB8 - 0xB0)
// Class Majesty.ActionOrderComponent
class UActionOrderComponent : public UActorComponent
{
public:
	class ABattleCharacterBase*                  M_cOwnerPlayer;                                    // 0xB0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UActionOrderComponent* GetDefaultObj();

};

// 0x0 (0x2C0 - 0x2C0)
// Class Majesty.ActionOrderIcon
class UActionOrderIcon : public UAcqUserWidget
{
public:

	static class UClass* StaticClass();
	static class UActionOrderIcon* GetDefaultObj();

	bool ResetParam();
	bool ImmediateHidden();
	bool ImmediateDettach();
	bool End();
	bool DettachSubIcon();
	bool AttachSubIcon();
};

// 0x0 (0x2C0 - 0x2C0)
// Class Majesty.ActionOrderTimeLineBase
class UActionOrderTimeLineBase : public UAcqUserWidget
{
public:

	static class UClass* StaticClass();
	static class UActionOrderTimeLineBase* GetDefaultObj();

};

// 0x0 (0x358 - 0x358)
// Class Majesty.ActionPopupWidgetBase
class UActionPopupWidgetBase : public UKSUserWidgetBase
{
public:

	static class UClass* StaticClass();
	static class UActionPopupWidgetBase* GetDefaultObj();

	bool TemporaryClose();
	bool ReOpen();
	bool Open(class AActor* TargetActor, class FName ActionTextLabel);
	bool Close();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.ActivityDataUtility
class UActivityDataUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UActivityDataUtility* GetDefaultObj();

	void RequestResetAllActiveActivities();
	void RequestRefreshActivity();
	void RequestNewGame();
	void NotifyActivityDB(class FName DbName, enum class EDBNoticeType Notice);
	bool IsNotClearedAnyActivityTask();
	bool IsAllActivityTaskCleared();
	TArray<class FName> GetAllMainStoryLabelRelatedActivity();
	void Debug_SetActivityAvailability(const class FString& ActivityId, bool bEnabled);
	void Debug_ResumeActivity(const class FString& ActivityId);
	void Debug_ResetAllMainStory();
	void Debug_OutputAllMainStory();
	void Debug_ClearAllMainStory();
};

// 0x8 (0x238 - 0x230)
// Class Majesty.ActivityManager
class AActivityManager : public AAcqManagerBase
{
public:
	class UKSSaveSystem*                         M_CacheSaveDataForMerge;                           // 0x230(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AActivityManager* GetDefaultObj();

	void SetSystemSaveDataForMerge(class UKSSaveSystem* SaveDataOther);
	void MergeActivitySaveDataOnPostLoadSlot();
	void MergeActivitySaveData(class UKSSaveSystem* SaveDataOther);
	void ClearSystemSaveDataForMerge();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.ActorUtil
class UActorUtil : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UActorUtil* GetDefaultObj();

	void ChangeOutLinerName(class AActor* Actor, const class FString& NewName);
};

// 0x10 (0xC0 - 0xB0)
// Class Majesty.AISACControlComponent
class UAISACControlComponent : public UActorComponent
{
public:
	TArray<struct FAISACCtrlParam>               M_acAISACData;                                     // 0xB0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAISACControlComponent* GetDefaultObj();

	void SetupAISAC();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.AreaInfoTableUtility
class UAreaInfoTableUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAreaInfoTableUtility* GetDefaultObj();

	void GetAreaInfoTableRowNames(enum class EBPFuncReturnCode* ReturnCode, TArray<class FName>* OutRowNames);
	bool GetAreaInfoData(struct FAreaInfoData* OutData, class FName TargetLabel);
};

// 0x8 (0x268 - 0x260)
// Class Majesty.ArrowButtonBase
class UArrowButtonBase : public UUserWidget
{
public:
	bool                                         M_bUseGameText;                                    // 0x260(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BE2[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UArrowButtonBase* GetDefaultObj();

	void SetUseGameText(bool UseGameText);
	void SetTextList(TArray<class FName>& TextList);
};

// 0xE0 (0x3A0 - 0x2C0)
// Class Majesty.BalloonBase
class UBalloonBase : public UAcqUserWidget
{
public:
	enum class EBalloonType                      BalloonType;                                       // 0x2C0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EndFlag;                                           // 0x2C1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         DrawTextEnd;                                       // 0x2C2(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bIsReady;                                        // 0x2C3(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bPause;                                          // 0x2C4(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_BF6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAddBalloonParam                      BalloonParam;                                      // 0x2C8(0xA0)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	int32                                        BalloonIndex;                                      // 0x368(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             FontSize;                                          // 0x36C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             MinWH;                                             // 0x374(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             TextBoxSize;                                       // 0x37C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_BF7[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            FinishBalloonEvent;                                // 0x388(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                        Pad_BF8[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBalloonBase* GetDefaultObj();

	bool UnPausedBalloon();
	void SetTextAnimationWait(enum class EKSLanguage NewLanguage);
	bool PauseBalloon();
	bool IsReady();
	bool IsPauseBalloon();
	bool IsEnd();
	bool IsDrawTextEnd();
	bool Init(struct FAddBalloonParam& InParam, bool bAutoTalk);
	enum class EBalloonType GetType();
	bool GetPlayedVoice();
	struct FAddBalloonParam GetBalloonParam();
	bool GetAutoBalloon();
	bool CloseBalloon();
	bool CallNext(bool AutoNext);
	bool CallBalloonEvent(enum class EBalloonEventType EventType);
};

// 0x80 (0x3D8 - 0x358)
// Class Majesty.BalloonBundleWidgetBase
class UBalloonBundleWidgetBase : public UKSUserWidgetBase
{
public:
	TArray<class UBalloonBase*>                  RefBalloons;                                       // 0x358(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UBalloonBase*>                  RefAutoBalloons;                                   // 0x368(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UBalloonBase*>                  UnUseBalloons;                                     // 0x378(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UBalloonBase*>                  UnUseAutoBalloons;                                 // 0x388(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UBalloonBase*>                  UseBalloons;                                       // 0x398(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UBalloonBase*>                  UseAutoTalkBalloons;                               // 0x3A8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UBalloonBase*                          RefDeepThink;                                      // 0x3B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBalloonBase*                          RefDeepThinkFixedText;                             // 0x3C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBalloonBase*                          M_cBalloonActive;                                  // 0x3C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C20[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBalloonBundleWidgetBase* GetDefaultObj();

	bool UnPausedAutoTalkBalloonAll();
	void SetAutoTimer(float FTimer);
	void RestoreEventSkip(bool Skip);
	bool PauseAutoTalkBalloonAll();
	void OnEventSpeedChange(enum class ENOTICE_TYPE NoticeType, struct FNoticeArgs& NoticeArgs);
	void OnBattleSpeedChange(enum class ENOTICE_TYPE NoticeType, struct FNoticeArgs& NoticeArgs);
	void Next(bool AutoNext);
	bool IsReady();
	bool IsEnd();
	bool IsAllEnd();
	float GetTextWaitTime();
	float GetAutoTimer();
	float GetAutoTime();
	bool GetAutoEventMessage();
	class UBalloonBase* GetActive();
	bool DeleteBalloonAll();
	bool DeleteBalloon(class UBalloonBase* PcDelete);
	bool DeleteAutoBalloonAll();
	bool DeleteAutoBalloon(class UBalloonBase* PcDelete);
	void Debug_SetMessageFullSkip(bool bSkip);
	bool CloseAll();
	void ChangeTextSpeed(enum class EKSLanguage Language);
	bool CallBalloonEvent(enum class EBalloonEventType EventType);
	class UBalloonBase* AddBalloon(struct FAddBalloonParam& InAddParam);
	class UBalloonBase* AddAutoTalkBalloon(struct FAddBalloonParam& InAddParam, float FDispTime);
};

// 0x8 (0x360 - 0x358)
// Class Majesty.BarMenuStorySelectBase
class UBarMenuStorySelectBase : public UKSUserWidgetBase
{
public:
	uint8                                        Pad_C28[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         BarMenuMode;                                       // 0x359(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C29[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBarMenuStorySelectBase* GetDefaultObj();

	void SetWidgetState(enum class ESTORY_SELECT_STATE Val);
	bool SetupStoryData(class FName& WorldMapLabel);
	bool Setup(class FName& WorldMapLabel, bool bIsBarMode);
	bool SetUIParts();
	bool SetBarUIParts(class FName TownNameLabel);
	bool OpenEvent(class FName WorldMapLabel, bool IsBarMenu);
	enum class ESTORY_SELECT_STATE GetWidgetState();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.BarTalkUtility
class UBarTalkUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UBarTalkUtility* GetDefaultObj();

	void GetBarTalkDataByLevelInfo(enum class EBPFuncReturnCode* ReturnCode, struct FBarTalkDefine* OutBarTalkData, struct FLevelInfoData& LevelInfoData);
};

// 0x28 (0x2D0 - 0x2A8)
// Class Majesty.BattleAbilitySequenceActor
class ABattleAbilitySequenceActor : public ALevelSequenceActor
{
public:
	TArray<class ABattleSequenceEmitter*>        M_acAbilityHitEffectList;                          // 0x2A8(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ABattleSequenceEmitter*>        M_acSupportRotationEffectList;                     // 0x2B8(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         M_bPauseAbilitySequenceUpdate;                     // 0x2C8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C46[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABattleAbilitySequenceActor* GetDefaultObj();

	void SetSupportRotationEffectList(TArray<class ABattleSequenceEmitter*>& AcEffectList);
	void SetAbilitySequencePause(bool bPauseEnable);
	void SetAbilityHitEffectList(TArray<class ABattleSequenceEmitter*>& AcEffectList);
	bool GetAbilitySequencePause();
};

// 0xF8 (0x318 - 0x220)
// Class Majesty.BattleActionOrder
class ABattleActionOrder : public AActor
{
public:
	TArray<struct FActionOrderData>              M_acActionOrderPool;                               // 0x220(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActionOrderData>              M_acCurrentOrder;                                  // 0x230(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActionOrderData>              M_acReserveCurrentOrder;                           // 0x240(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acCurrentCharacter;                              // 0x250(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActionOrderData>              M_acEstimateCurrentOrder;                          // 0x260(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActionOrderData>              M_acNextOrder;                                     // 0x270(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActionOrderData>              M_acReserveNextOrder;                              // 0x280(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acNextCharacter;                                 // 0x290(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActionOrderData>              M_acEstimateNextOrder;                             // 0x2A0(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acCurrentCharacterForSubParty;                   // 0x2B0(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acNextCharacterForSubParty;                      // 0x2C0(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActionOrderData>              M_acCurrentOrderForSubParty;                       // 0x2D0(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActionOrderData>              M_acNextOrderForSubParty;                          // 0x2E0(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acSubPartyPlayerList;                            // 0x2F0(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acSubEnemyList;                                  // 0x300(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                        M_nActionCharacterCount;                           // 0x310(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CDF[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABattleActionOrder* GetDefaultObj();

	bool UpdateNextOrderIndex();
	bool UpdateNextOrder();
	bool UpdateCurrentOrderIndex();
	bool SubActionCharacterCount();
	bool SortPredicateByWaitTime(struct FActionOrderData& CElementA, struct FActionOrderData& CElementB);
	bool SortPredicateByNextTime(struct FActionOrderData& CElementA, struct FActionOrderData& CElementB);
	bool SortActionOrderByWaitTime(TArray<struct FActionOrderData>& AcTargetOrder);
	bool SortActionOrderByNextTime(TArray<struct FActionOrderData>& AcTargetOrder);
	bool ShuffleActionOrder(TArray<struct FActionOrderData>& AcTargetOrder);
	bool SetupSubPartyPlayer(TArray<class ABattleCharacterBase*>& AcSubPartyPlayer);
	bool SetupFirstTurnPlayer();
	bool SetNextOrderChange(class ABattleCharacterBase* CTargetCharacter);
	void SetEstimateActionOrderChange(TArray<struct FActionOrderData>& AcTargetOrder, class ABattleCharacterBase* CTargetCharacter, enum class EACTION_ORDER_TYPE EOrderType, bool bBuffOrder, bool* FindCharacter);
	bool SetCurrentOrderChange(class ABattleCharacterBase* CTargetCharacter);
	bool SetBattleFirstActionTurn(TArray<class ABattleCharacterBase*>& AcFirstActionCharacter);
	bool SetActionOrderChange(TArray<struct FActionOrderData>& AcTargetOrder, class ABattleCharacterBase* CTargetCharacter);
	bool SealActionOrder(class ABattleCharacterBase* CTarget, struct FActionOrderData* CTargetOrder, bool* bSealNextOrder);
	bool ResetNextOrderForIsOrderChange();
	bool ResetEstimateNextOrder();
	bool ResetEstimateCurrentOrder();
	bool ResetCurrentOrderForIsOrderChange();
	bool ResetCurrentCharacterWaitTime();
	bool ResetActionOrderForIsOrderChange(TArray<struct FActionOrderData>& AcTargetOrder);
	bool ReplaceActionOrder(TArray<struct FActionOrderData>& AcTargetOrder, TArray<struct FActionOrderData>& AcReserveList, enum class EACTION_ORDER_TYPE EType, class ABattleCharacterBase* CReplaceCharacter, int32 NReplaceIndex, bool bReturnOrderToReserve, struct FActionOrderData* CReplaceOrder);
	bool RemoveNextOrderForSubParty(class ABattleCharacterBase* CTargetCharacter);
	bool RemoveNextOrder(class ABattleCharacterBase* CTargetCharacter, bool bEverSince);
	bool RemoveCurrentOrderForSubParty(class ABattleCharacterBase* CTargetCharacter);
	bool RemoveCurrentOrder(class ABattleCharacterBase* CTargetCharacter);
	bool RemoveBreakStyleOrder(TArray<struct FActionOrderData>& AcTargetOrder, TArray<struct FActionOrderData>& AcReserveList);
	bool RemoveBreakStyle();
	bool RemoveActionOrderForEstimate(TArray<struct FActionOrderData>& AcTargetOrder, class ABattleCharacterBase* CTargetCharacter);
	bool RemoveActionOrderByIndex(TArray<struct FActionOrderData>& AcTargetOrder, TArray<struct FActionOrderData>& AcReserveList, int32 NRemoveIndex);
	bool RemoveActionOrder(TArray<struct FActionOrderData>& AcTargetOrder, TArray<struct FActionOrderData>& AcReserveList, class ABattleCharacterBase* CTargetCharacter);
	void PopOrder(class ABattleCharacterBase** CNextCharacter, struct FActionOrderData* CNextOrderData);
	bool PlaySubIconOpenAnim(TArray<struct FActionOrderData>& OrderData);
	bool PlaySubIconCloseAnim(TArray<struct FActionOrderData>& OrderData);
	bool MoveActionOrderByIndex(TArray<struct FActionOrderData>& AcTargetOrder, int32 NTargetIndex, int32 NToIndex);
	bool MoveActionOrder(TArray<struct FActionOrderData>& AcTargetOrder, enum class EACTION_ORDER_TYPE EType, int32 NMoveCount, bool bIsNextOrder);
	bool IsSettledOrderForEightBattle();
	bool IsNextCharacterCross();
	bool IsNextCharacterContinue(class ABattleCharacterBase* CCheckCharacter);
	bool IsCurrentOrderComplete();
	bool InsertNextOrderForSubParty(int32* NInsetIndex, class ABattleCharacterBase* CTargetCharacter);
	bool InsertNextOrder(int32* NInsetIndex, class ABattleCharacterBase* CTargetCharacter, enum class EACTION_ORDER_TYPE EType, float FDelay, bool bUseIcon);
	bool InsertCurrentOrderForSubParty(int32* NInsetIndex, class ABattleCharacterBase* CTargetCharacter);
	bool InsertCurrentOrder(int32* NInsetIndex, class ABattleCharacterBase* CTargetCharacter, enum class EACTION_ORDER_TYPE EType, float FDelay, bool bUseIcon);
	bool InsertActionOrder(TArray<struct FActionOrderData>& AcTargetOrder, struct FActionOrderData& CInsertOrder, int32* NInsetIndex);
	bool InitializeActionOrder(TArray<class ABattleCharacterBase*>& AcBattlePlayer, TArray<class ABattleCharacterBase*>& AcBattleEnemy, enum class EBATTLE_START_TYPE EStartType);
	bool GetOrderIconFromCharaRef(TArray<struct FActionOrderData>& SearchArray, class ABattleCharacterBase* TargetRef, struct FActionOrderData* Data);
	void GetOrder(class ABattleCharacterBase** CNextCharacter, struct FActionOrderData* CNextOrderData);
	void GetEstimateActionOrderList(TArray<struct FActionOrderData>* AcCurrentOrder, TArray<struct FActionOrderData>* AcNextOrder);
	void GetActionOrderList(TArray<struct FActionOrderData>* AcCurrentOrder, TArray<struct FActionOrderData>* AcNextOrder);
	bool FindNextOrderByCharacter(class ABattleCharacterBase* CTargetCharacter, TArray<struct FActionOrderData>* AcFindOrderList);
	bool FindCurrentOrderByCharacter(class ABattleCharacterBase* CTargetCharacter, TArray<struct FActionOrderData>* AcFindOrderList);
	bool ExecMoveNextOrder(enum class EACTION_ORDER_TYPE EType, int32 NMoveCount);
	bool ExecMoveCurrentOrder(enum class EACTION_ORDER_TYPE EType, int32 NMoveCount);
	bool ExecEstimateNextOrder(TArray<class ABattleCharacterBase*>& AcTargetCharacter, enum class EACTION_ORDER_TYPE EOrderType, int32 NMoveCount);
	bool ExecEstimateCurrentOrder(TArray<class ABattleCharacterBase*>& AcTargetCharacter, enum class EACTION_ORDER_TYPE EOrderType, int32 NMoveCount);
	bool ExecEstimateActionOrder(TArray<class ABattleCharacterBase*>& AcTargetCharacter, enum class EACTION_ORDER_TYPE EOrderType, int32 NMoveCount, bool bContainCurrentOrder, bool bContinueEstimate);
	bool EndCharacterOrderForEightBattle();
	bool Debug_OutputOrderLogFromBodyList(const class FString& Title, const TArray<class FString>& BodyList);
	bool Debug_OutputOrderLog(const class FString& Title, const class FString& Body);
	bool Debug_OutputOrderIconLog(class UActionOrderIcon* CIcon, const class FString& Title);
	bool Debug_GetCommonOrderDataLog(const struct FActionOrderData& CTarget, bool IsCurrent, class FString* OutBody);
	bool CreateSubPartyOrder(TArray<class ABattleCharacterBase*>& AcSubPartyCharacter, TArray<struct FActionOrderData>& AcOriginalOrder, TArray<struct FActionOrderData>& AcOrderResult, TArray<struct FActionOrderData>& AcReserveList, TArray<struct FActionOrderData>& AcBribeOrderList, bool IsNextOrder);
	bool CreateSubPartyCharacterList(TArray<class ABattleCharacterBase*>& AcSubPartyCharacter, TArray<struct FActionOrderData>& AcOrderResult, bool IsNextOrder);
	bool CreateMainPartyCharacterList(TArray<struct FActionOrderData>& AcOriginalOrder, TArray<struct FActionOrderData>& AcOrderResult);
	bool CreateActionOrder(TArray<class ABattleCharacterBase*>& AcBattleCharacter, TArray<struct FActionOrderData>& AcOrderResult, TArray<struct FActionOrderData>& AcReserveList);
	bool ClearCurrentOrder();
	bool CheckSpecialOrderAllAGIUp(int32 AbilityID);
	bool CheckSpecialOrderAGIUpSelfDown(int32 AbilityID);
	bool CheckShuffleEnable(const struct FActionOrderData& CTargetOrder);
	bool CheckEnablePartyChangeOrder(enum class EACTION_ORDER_TYPE EOrderType);
	bool ChangeBattleTurn();
	bool ChangeBattleSubParty(class ABattleCharacterBase* CActiveCharacter, bool DefeatChange);
	bool ChangeBattlePartyMember(TArray<class ABattleCharacterBase*>& AcChangePlayerList);
	bool BribeActionOrder(class ABattleCharacterBase* CEnforcer, class ABattleCharacterBase* CTarget, struct FActionOrderData* CReplaceOrder, struct FActionOrderData* CTargetOrder, bool* bReplaceNextOrder);
	bool BreakActionOrder(class ABattleCharacterBase* CTargetCharacter);
	void AssignNextOrderIndex();
	void AssignCurrentOrderIndex();
	bool AddNextOrderCharacter(class ABattleCharacterBase* CAddCharacter);
	bool AddLastActionOrder(TArray<struct FActionOrderData>& AcTargetOrder, struct FActionOrderData& CInsertOrder, int32* NInsetIndex);
};

// 0x70 (0x120 - 0xB0)
// Class Majesty.BattleAIBase
class UBattleAIBase : public UActorComponent
{
public:
	class ABattleCharacterBase*                  M_cOwnerCharacter;                                 // 0xB0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBATTLE_AI_STATE                  M_ePreState;                                       // 0xB8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBATTLE_AI_STATE                  M_eCurrentState;                                   // 0xB9(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CFA[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        M_astrStateNameList;                               // 0xC0(0x10)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<enum class EBATTLE_AI_STATE, enum class EBATTLE_AI_SUB_STATE> M_anAISubState;                                    // 0xD0(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBattleAIBase* GetDefaultObj();

	void UpdateThinkForConfusion(class FName* CommandName);
	void UpdateThink(class FName* CommandName);
	void SetOwnerCharacter(class ABattleCharacterBase* COwner);
	void SetBattleCommandTable(TArray<struct FBattleAICommandData>& AcCommandTable);
	void SelectBattleTarget(TArray<class ABattleCharacterBase*>& PlayerList, TArray<class ABattleCharacterBase*>& EnemyList, enum class EBATTLE_TARGET_TYPE TargetType, TArray<class ABattleCharacterBase*>* TargetList);
	bool PreUpdateThink();
	bool PreTurnStart();
	bool PreOrderStart(class ABattleCharacterBase* ActionCharacter);
	bool PostUpdateThink();
	bool PostSignOfBoost();
	bool PostOrderEnd(class ABattleCharacterBase* ActionCharacter);
	bool PostBattleEvent();
	bool OnRevive();
	bool OnDead();
	bool OnDamage();
	bool OnBreak();
	void GetCounterAbility(class FName* CommandName);
	void GetBattleAISubState(enum class EBATTLE_AI_SUB_STATE* CurrentSubState);
	class FString GetBattleAIStateName();
	void GetBattleAIState(enum class EBATTLE_AI_STATE* CurrentState, enum class EBATTLE_AI_STATE* PrevState);
	void ChangeBattleAISubState(enum class EBATTLE_AI_SUB_STATE NewSubState);
	void ChangeBattleAIState(enum class EBATTLE_AI_STATE NewState, bool ResetSubState);
	bool AIInitialize();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.BattleAIUtility
class UBattleAIUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UBattleAIUtility* GetDefaultObj();

};

// 0x150 (0x980 - 0x830)
// Class Majesty.BattleCamera
class ABattleCamera : public ACineCameraActor
{
public:
	struct FBattleCameraInitData                 M_cCameraInitData;                                 // 0x830(0x48)(BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EBATTLE_CAMERA_TYPE               M_eCameraType;                                     // 0x878(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D24[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            M_cResumeTransform;                                // 0x880(0x30)(BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            M_cStartTransformForTargetFocus;                   // 0x8B0(0x30)(BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            M_cGoalTransformForTargetFocus;                    // 0x8E0(0x30)(BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            M_sBaseTransform;                                  // 0x910(0x30)(BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            CameraTransform;                                   // 0x940(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bCameraWaitMove;                                   // 0x970(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D25[0xF];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABattleCamera* GetDefaultObj();

	void StartResulttCamera(enum class EBATTLE_RESULT_TYPE EResultType, bool bIsFront);
	void StartEnemyDeadCamera(enum class EBREAK_CAMERA_TYPE EBreakType);
	void StartEncountCamera();
	void StartBreakCamera(enum class EBREAK_CAMERA_TYPE EBreakType);
	void StartAbilityCamera(int32 NBoostLevel, enum class EBATTLE_TARGET_TYPE ETargetType, int32 NSlideFrame, class AActionCommandBase* CActionCommand, bool bEnemySide, bool bIsFront, class FName StrAbilityName);
	void SetupBaseTransform();
	void SetTargetFocusCamera(enum class EBATTLE_TARGET_TYPE ETargetType, class ABattleCharacterBase* CTarget);
	void SetInterpolationCurveForAbilityCamera(class UCurveFloat* CInterpolationCurve);
	void SetCameraWaitMove(bool bEnable);
	void SetCameraTransform(const struct FTransform& CTransform);
	void ResumeWaitMove();
	void ResetTargetFocusCamera();
	void ResetCameraTransform();
	void PostCameraTick(float DeltaTime);
	void InterpolationResultCamera(float FRatio, class ACineCameraActor* CTargetCamera);
	void InterpolationBattleCamera(class UCurveFloat* CInterpolationCurve, float FRatio, class ACineCameraActor* CTargetCamera);
	void InterpolationAbilityCamera(float FRatio, class ACineCameraActor* CTargetCamera);
	struct FRotator GetLastLookatTrackingRotation(class ACineCameraActor* CTargetCamera);
	struct FVector GetLastLookatTrackingPosition(class ACineCameraActor* CTargetCamera);
	void GetCameraInitParameterForAbilityCamera(struct FPostProcessSettings* OutPostSetting, struct FCameraFocusSettings* OutFocusSetting, struct FCameraFilmbackSettings* OutFilmbackSetting, struct FCameraLensSettings* OutLensSetting, float* OutCurrentAperture, float* OutFOV);
	void GetAudioListenerPosition(struct FVector* OutLocation, struct FVector* OutFrontDir, struct FVector* OutRightDir);
	void FixBattleCamera();
	void FinishResultCamera();
	void FinishEncountCamera();
	void FinishBreakCamera();
	void FinishAbilityCamera();
	bool CheckZeroRotator(const struct FRotator& CRotator);
};

// 0x410 (0x630 - 0x220)
// Class Majesty.BattleCharacterBase
class ABattleCharacterBase : public AActor
{
public:
	int32                                        M_nCharacterID;                                    // 0x220(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E64[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AKSCharacterBase*                      M_cAnimationCharacter;                             // 0x228(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AKSCharacterBase*>              M_acSubAnimationCharacter;                         // 0x230(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCharacterParam                       M_cMasterParameter;                                // 0x240(0x34)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        M_nCurrentHP;                                      // 0x274(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nDecreaseHPMax;                                  // 0x278(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsChangedHPMax;                                 // 0x27C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E65[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nCurrentMP;                                      // 0x280(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nCurrentBP;                                      // 0x284(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nCurrentBPMax;                                   // 0x288(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nCurrentShieldPoint;                             // 0x28C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nShieldPointMax;                                 // 0x290(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E66[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABattleCharacterBase*                  M_cOwnerPlayer;                                    // 0x298(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nUseBPInCurrentOrder;                            // 0x2A0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bUseBoost;                                       // 0x2A4(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bBreakEnemyInCurrentOrder;                       // 0x2A5(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bExecBreakAct;                                   // 0x2A6(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bCharacterReady;                                 // 0x2A7(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bAbilityHitFlag;                                 // 0x2A8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bAbilityHitInvisible;                            // 0x2A9(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bUseDamageCutShield;                             // 0x2AA(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bJustKillInAilment;                              // 0x2AB(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bReflectionEnforcer;                             // 0x2AC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E67[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EDISEASE_TYPE, enum class EATTRIBUTE_RESIST> M_aeDiseaseResist;                                 // 0x2B0(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bHitDiseaseInAction;                             // 0x300(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bIsExceptField;                                  // 0x301(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E68[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nDragInIndex;                                    // 0x304(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nDragInIndexTest;                                // 0x308(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               M_vForceMovementStart;                             // 0x30C(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               M_vForceMovementGoal;                              // 0x318(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsExecForceMovement;                            // 0x324(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bResumeIdleAction;                               // 0x325(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bResumeIdleActionFixed;                          // 0x326(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBATTLE_ACTION_TYPE               M_eResumeIdleActionType;                           // 0x327(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsAutoTameMonster;                              // 0x328(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bEnableBlind;                                    // 0x329(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E69[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UActionOrderComponent*                 M_cActionOrderComponent;                           // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nOrderCountMax;                                  // 0x338(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nCurrentOrderCountMax;                           // 0x33C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nCurrentOrderCounter;                            // 0x340(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nCurrentActionTimeBase;                          // 0x344(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nNextActionTimeBase;                             // 0x348(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E6A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FActionOrderData>              M_acNextActionOrderData;                           // 0x350(0x10)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UBattleVoiceComponent*                 M_cBattleVoiceComponent;                           // 0x360(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bPlayOnRecoveredVoice;                           // 0x368(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bSettledPlayOnce_OnRecovered;                    // 0x369(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E6B[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       M_cDefaultEffectSocket;                            // 0x370(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       M_cGroundEffectSocket;                             // 0x378(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       M_cChargeActionEffectSocket;                       // 0x380(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E6C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            M_sBaseTransform;                                  // 0x390(0x30)(BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bIsCharacterWarpMode;                            // 0x3C0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bEnableDeadCharacterControl;                     // 0x3C1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E72[0xE];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            CharaTransform;                                    // 0x3D0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTransform                            CanoeTransform;                                    // 0x400(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         VisibleCanoe;                                      // 0x430(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EnableCanoeTrace;                                  // 0x431(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E74[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CharacterOpacity;                                  // 0x434(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         DisableBattleCameraOpacity;                        // 0x438(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E76[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          PotentialityAction_BodyColor;                      // 0x43C(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PotentialityAction_EyesColor;                      // 0x44C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<enum class ESUPPORT_AILMENT_TYPE>     M_aeSupportAilment;                                // 0x450(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<enum class ESUPPORT_AILMENT_TYPE, struct FSupportAbilityDataBase> M_acSupportAbilityData;                            // 0x460(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class EWEAPON_STANCE                    M_eWeaponStance;                                   // 0x4B0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E79[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EWEAPON_CATEGORY>          M_aeEquipmentWeaponList;                           // 0x4B8(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	enum class EWEAPON_CATEGORY                  M_eMainWeapon;                                     // 0x4C8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nMainWeaponIndex;                                // 0x4CC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWEAPON_CATEGORY                  M_eNormalAttackWeapon;                             // 0x4D0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nNormalAttackWeaponIndex;                        // 0x4D4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nSwitchWeaponIndex;                              // 0x4D8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWEAPON_CATEGORY                  M_eForteWeapon;                                    // 0x4DC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  M_strForteWeaponID;                                // 0x4E0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPotentialityActionComponent*          M_cPotentialityActionComponent;                    // 0x4E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bPotentialityActionEnable;                       // 0x4F0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nExcitementPoint;                                // 0x4F4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bMasqueradeEnable;                               // 0x4F8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UMasqueradeComponent*                  M_cMasqueradeComponent;                            // 0x500(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bInventorEnable;                                 // 0x508(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UInventorComponent*                    M_cInventorComponent;                              // 0x510(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bChargeActionEnable;                             // 0x518(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E80[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FBattleAdditiveOrderData>      M_acChargeActionDataList;                          // 0x520(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UBattleAIBase*                         M_cBattleAIComponent;                              // 0x530(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bBattleAIReady;                                  // 0x538(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bIsPreparation;                                  // 0x539(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bIsWeakIconFullOpen;                             // 0x53A(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E81[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWeakLockData                         M_cCurrentWeakLockData;                            // 0x540(0x18)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FWeakLockData                         M_cRequestWeakLockData;                            // 0x558(0x18)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bIsUpdateWeakLockData;                           // 0x570(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E82[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWeakChangeData                       M_cCurrentWeakChangeData;                          // 0x578(0x18)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FWeakChangeData                       M_cRequestWeakChangeData;                          // 0x590(0x18)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bIsUpdateWeakChangeData;                         // 0x5A8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E84[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FShieldChangeData                     M_cCurrentShieldChangeData;                        // 0x5B0(0x18)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FShieldChangeData                     M_cRequestShieldChangeData;                        // 0x5C8(0x18)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bIsUpdateShieldChangeData;                       // 0x5E0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bIsUpdateShieldChangeDataTest;                   // 0x5E1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E85[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EATTRIBUTE_TYPE>           M_aeOpenedAttributeList;                           // 0x5E8(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                        M_nBribeCounter;                                   // 0x5F8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_fBribeRatio;                                     // 0x5FC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bRequestSettingNextOrder;                        // 0x600(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E87[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRequestActionOrderData>       M_RequestSettingNextOrderData;                     // 0x608(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bRequestSettingNextTurnOnly;                     // 0x618(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E88[0x17];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABattleCharacterBase* GetDefaultObj();

	TArray<bool> WeakTypeToWeaponType(int32 EWeakLockType);
	TArray<bool> WeakTypeToMagicType(int32 EWeakLockType);
	bool UpdateWeakLock_PostOrder();
	bool UpdateWeakChange_PostOrder();
	bool UpdateSubStatusParam(bool UpdateBoost, bool UpdatePotential);
	bool UpdateStatusParam(bool UpdateBoost, bool UpdatePotential);
	bool UpdateShieldChange_PostOrder();
	bool UpdateRequestSettingNextOrder_PostOrder();
	bool UpdateChargeActionCount();
	bool TurnONStatusUI();
	bool TurnOffStatusUI();
	bool SwitchNormalAttackWeapon(bool bDirNext, int32* NWeaponIndex);
	bool SwitchMainWeapon(bool bDirNext, int32* NWeaponIndex);
	bool SwitchCatapultWeapon(bool bDirNext, int32* NWeaponIndex);
	bool SurveyOpenedWeakPoint(int32* NOpenedNum, int32* NWeakPointMax);
	void StopForceMovementTimeline();
	void StartForceMovementTimeline();
	void SetWeaponStance(enum class EWEAPON_STANCE EStance);
	bool SetWeakIconFullOpen(bool bIsFullOpen);
	void SetVisibleCanoe(bool bVisible);
	void SetUseDamageCutShield(bool bUseShield);
	bool SetupSubAnimationCharacter(TArray<class ABattleCharacterBase*>& AcTarget, const struct FVector& CCommandOffset);
	void SetupBaseTransform(enum class EBATTLE_CHARA_POSITION_RESET_TYPE EResetType, bool bEnableDeadCharacterControl);
	bool SetupActionOrderSealAction(bool bEnable);
	bool SetupActionOrderBribe(bool bEnable);
	bool SetupActionOrderBlindFast(bool bEnable);
	bool SetupActionOrderBlind(bool bEnable);
	bool SetSupportAilment(const struct FSupportAbilityDataBase& CSupportAbilityData);
	bool SetShieldPointMax(int32 NShieldMax);
	void SetReflactionEnforcer(bool bEnable);
	void SetPotentialityAction_EyesColor(float FAlpha);
	void SetPotentialityAction_BodyColor(const struct FLinearColor& CColor);
	void SetGetBackBoostPoint(int32 NGetBackBoostPoint);
	void SetForceMovementTimelineCurve(class UCurveFloat* CMovementRatio, class UCurveVector* CMovementOffset, class UCurveFloat* COpacityCurve, float FTimelineLength);
	void SetForceMovementParameter(const struct FVector& VStartPoint, const struct FVector& VGoalPoint, bool bResumeIdle, enum class EBATTLE_ACTION_TYPE EResumeIdleType, bool bResumeIdleFixed);
	void SetExcitementPoint(class ABattleCharacterBase* CEnforcer, int32 NBoostLevel);
	bool SetEnableWeakLockData();
	bool SetEnableWeakChangeData();
	bool SetEnableShieldChangeData();
	void SetEnablePlayOnRecoveredVoice(bool bEnable);
	void SetEnableCanoeTrace(bool bEnable);
	void SetDisableBattleCameraOpacity(bool bDisable);
	void SetDefaultLocation(bool bInMainParty);
	void SetDecreaseHPMax(int32 DecreaseValue);
	void SetDebugSwitch(enum class EBATTLE_DEBUG_SWITCH EType, bool bValue);
	void SetDeadFlagForReplay(bool bDeadFlag);
	void SetCharaTransform(const struct FTransform& CTransform);
	void SetCharacterOpacityForActionCommand(float FOpacity);
	void SetCharacterOpacity(float FOpacity);
	void SetCharacterName(class FName StrCharacterNameLabel);
	void SetCanoeTransform(const struct FTransform& CTransform);
	bool SetBoostPointMax(int32 NBoostMax);
	void SetAbilityHitFlag(bool bAbilityHit, bool bAbilityHitInvisible);
	bool SearchDiseaseForAI(enum class EDISEASE_TYPE DiseaseType);
	bool SearchDiseaseByCategoryForAI(enum class EDISEASE_CATEGORY DiseaseCategory);
	bool SaveCharacterParameter();
	void ReturnCaptureMove();
	bool RestoreGroggy();
	bool RestoreBreak();
	void ResetVoiceFlagForPreAction();
	bool ResetSelectWeaponForMasquerade(enum class EWEAPON_CATEGORY ETargetWeapon);
	void ResetHitDiseaseForPreAction();
	void ResetExcitementPoint();
	void ResetCanoeTransform();
	void ResetBattleCharacterForReplay();
	bool RequestWeakLock(const struct FWeakLockData& CNewWeakLockData);
	bool RequestWeakChange(const struct FWeakChangeData& CNewWeakChangeData);
	bool RequestShieldChange(const struct FShieldChangeData& CNewShieldChangeData);
	bool RemoveDiseaseForSequencer(class FName DiseaseName);
	bool RemoveDiseaseForAI(enum class EDISEASE_TYPE DiseaseType);
	void ReleasePotentialityAction();
	void RecoveryPotentialityActionPoint(class ABattleCharacterBase* CEnforcer, int32 NValue, bool bUseRecoveryUI, bool bIsMeatItem);
	void RecoveryMP(class ABattleCharacterBase* CEnforcer, int32 NValue, bool bOverHeal, bool bUseRecoveryUI, bool bIsMeatItem);
	void RecoveryHP(class ABattleCharacterBase* CEnforcer, int32 NValue, bool bOverHeal, bool bUseRecoveryUI, bool bIsMeatItem);
	void RecoveryBP(class ABattleCharacterBase* CEnforcer, int32 NValue, bool bUseRecoveryUI, bool bIsMeatItem);
	struct FBattleAdditiveOrderData PopChargeActionData();
	void PlayCaptureMove();
	bool PlayBattleVoiceForDamage(int32 NDamageValue, class AActionCommandBase* CActionCommand);
	bool PlayBattleVoice(enum class EBATTLE_VOICE_TYPE EBattleVoiceType, const struct FBattleVoiceSetData& CPlayCondition, bool bIsSkipDiseaseCheck);
	bool OpenWeakIcon(int32 NIndex, bool bRandom, bool bPreparation, bool bPlay2nd, int32* bOpenIndex);
	bool OnTakeNewDisease(enum class EDISEASE_TYPE EDiseaseType);
	bool OnTakeDisease(class ABattleCharacterBase* CEnforcer, enum class EDISEASE_TYPE EDiseaseType, enum class EDISEASE_CATEGORY EDiseaseCategory, int32 NInvocationValue, int32 NBoostLevel, bool bIsNewDisease);
	bool OnPotentialityAction();
	bool OnHitDamageSP(bool bIsBreakAttack);
	bool OnHitDamageHP(bool bIsBreakAttack, bool bIsBreakTarget, enum class EATTRIBUTE_RESIST ETotalResist, enum class EATTRIBUTE_RESIST EWeaponResist);
	void OnFinish_CreateBattleAI();
	bool OffPotentialityAction(bool bCancel);
	void MoveLastNextOrder();
	bool IsWeakIconFullOpen();
	bool IsSupporterComplete();
	bool IsSelecterEffectVisibleSealAction();
	bool IsSelecterEffectVisibleNormal();
	bool IsSelecterEffectVisibleBribe();
	bool IsPotentialityActionEnable();
	bool IsMasqueradeEnable();
	void IsJustKillInAilment(bool* bJustKill);
	bool IsInventorEnable();
	bool IsHitDiseaseInAction();
	bool IsGarderaAbility(class FName AbilityName);
	bool IsExecForceMovement();
	bool IsExecBreakAct();
	bool IsExceptField();
	bool IsCharacterTameMonster();
	bool IsCharacterSupporter();
	bool IsCharacterReady();
	bool IsCharacterPinch();
	bool IsCharacterNPC();
	bool IsCharacterNonPartsBattle();
	void IsCharacterGroggy(bool* bIsGroggy, bool* bEnableCurrentAction, bool* bEnableNextAction);
	bool IsCharacterEnemy();
	bool IsCharacterDisableAction();
	bool IsCharacterDecondition();
	bool IsCharacterDeadlySense();
	bool IsCharacterDead();
	bool IsCharacterBreak();
	bool IsAutoTameMonster();
	void InterruptCurrentOrder(const struct FRequestActionOrderData& CActionOrderData);
	void InitUseDamageCutShield();
	bool InitializeBattleVoiceDataData(class FName StrVoiceCharacterID);
	bool InitializeActionOrderData();
	enum class EWEAPON_STANCE GetWeaponStance();
	void GetWeaponResist(enum class EWEAPON_CATEGORY EAttackWeapon, bool bCheckWeakLock, enum class EATTRIBUTE_RESIST* EResistResult);
	void GetWaitEnemyActionFrame(int32* NWaitFrame);
	void GetTameMonsterData(bool* bTameEnable, float* FTameRateBase);
	int32 GetSwitchWeaponIndex();
	enum class ESESSION_SE_TYPE GetSessionSEType();
	void GetReplayStatus(bool bIsSelfTurn, enum class EBATTLE_REPLAY_CHARA_STATUS* EReplayStatus);
	void GetReplayDiseaseMask(int32* NDiseaseMask);
	class UPotentialityActionComponent* GetPotentialityActionComponent();
	void GetPlayableCharacterID(enum class EPlayableCharacterID* ECharaID);
	class ABattleCharacterBase* GetOwnerPlayer();
	bool GetOpenedAttribute(int32 NIndex, enum class EATTRIBUTE_TYPE* EResult);
	int32 GetNormalAttackWeaponIndex();
	enum class EWEAPON_CATEGORY GetNormalAttackWeaponCategory();
	struct FActionOrderData GetNextActionOrderData(int32 NOrderIndex);
	class UMasqueradeComponent* GetMasqueradeComponent();
	enum class EWEAPON_CATEGORY GetMainWeaponCategory();
	class UInventorComponent* GetInventorComponent();
	class FName GetForteWeaponID();
	int32 GetExcitementPoint();
	TArray<enum class EWEAPON_CATEGORY> GetEquipmentWeaponCategory();
	TArray<struct FItemData> GetEquipmentList();
	TArray<class FName> GetEquipmentLabelList();
	bool GetEnchantAttribute(enum class EWEAPON_CATEGORY ECheckWeapon, enum class EATTRIBUTE_TYPE* EEnchantAttribute);
	bool GetEnablePlayOnRecoveredVoice();
	bool GetEnableBlind();
	void GetDiseaseResist(enum class EDISEASE_TYPE EDiseaseType, enum class EATTRIBUTE_RESIST* EResistResult);
	void GetDelayEnemyActionSE(TArray<struct FActionDelaySEData>* AcActionDelaySEData, bool* bEnable);
	struct FVector GetDefaultWarpPosition();
	int32 GetDecreaseHPMax();
	class UDebugBattleCharaComponent* GetDebugComponent();
	struct FVector GetCursorPosition();
	struct FVector GetCurrentPosition();
	class FName GetCharmEnemyLabel();
	void GetCharacterVoice_BattleStart(class FName* StrVoiceID, bool* bFindVoiceID);
	void GetCharacterName(class FText* StrCharacterName);
	void GetCharacterJobByRowID(int32* NFirstJob, int32* NSecondJob);
	void GetCharacterJob(enum class EJOB_TYPE* EFirstJob, enum class EJOB_TYPE* ESecondJob, bool* bEnableSecondJob);
	void GetCharacterID(int32* NCharaID);
	void GetCharacterEvation(int32* Result, float* Ratio);
	void GetCharacterDefence(enum class EAILMENT_CALC_TYPE CalcType, int32* Result, float* Ratio);
	void GetCharacterConcentrate(int32* Result, float* Ratio);
	void GetCharacterAttack(enum class EAILMENT_CALC_TYPE CalcType, class ABattleCharacterBase* DamageTarget, int32* Result, float* Ratio);
	void GetCharacterAgility(int32* Result, float* Ratio);
	void GetCharacterAccuracy(int32* Result, float* Ratio);
	bool GetBribeData(bool* BribeEnable, int32* BribeMoney);
	class UBattleVoiceComponent* GetBattleVoiceComponent();
	class USceneComponent* GetBattleEffectSocket(bool bGround);
	class UBattleAIBase* GetBattleAIComponent();
	void GetAttributeResist(enum class EATTRIBUTE_TYPE EAttackAttribute, bool bCheckWeakLock, enum class EATTRIBUTE_RESIST* EResistResult);
	class AKSCharacterBase* GetAnimationCharacter();
	class AActor* GetAnimationActorForAttach();
	int32 GetActionTimeForNextTurn(enum class EACTION_ORDER_TYPE EType, float FDelayRatio);
	int32 GetActionTimeForCurrentTurn(enum class EACTION_ORDER_TYPE EType, float FDelayRatio);
	class UActionOrderComponent* GetActionOrderComponent();
	class FName GetAbilityData(int32 NIndex);
	bool FinishPotentialityAction(bool bCheckResume);
	void FinishChangePartySequence();
	void ExecSwitchSlidePartySubToMain();
	void ExecSwitchSlidePartyMainToSub();
	bool ExecStartCharacterWarp();
	void ExecSettingNextOrder(TArray<struct FRequestActionOrderData>& AcActionOrderData, bool bNextTurnOnly, bool bRequest);
	void ExecRevive(class ABattleCharacterBase* CEnforcer, int32 NReviveHP, bool bOverHeal, bool bUseRecoveryUI, bool bUseReviveVoice);
	void ExecReturnSupporterAction(bool bWithReturnText);
	void ExecReturnCharmAction();
	bool ExecEndCharacterWarp();
	void ExecDragInAction(class ABattleCharacterBase* Enforcer, int32 NInvocationTurn, enum class EBATTLE_DRAG_IN_TYPE EDragInType);
	void ExecCharmAction(class ABattleCharacterBase* Enforcer);
	void ExecBlowAwayAction(class ABattleCharacterBase* Enforcer, int32 NInvocationTurn);
	bool EndCharacterOrder(float* FWaitTime);
	bool EndBattleTurnForSubParty(float* FWaitTime);
	bool DecideActionForSubParty(float* FWaitTime);
	bool Debug_SetActionDelaySEData(TArray<struct FActionDelaySEData>& CSEData);
	bool Debug_GetActionDelaySEData(TArray<struct FActionDelaySEData>* CSEData);
	void CreateSubAnimationCharacter(int32 NCreateNum);
	bool CreateOpenedAttributeList(int32* NAttributeNum, int32* NAttributeMax);
	void CreateBattleEffectSocket(const struct FVector& VEffectOffset);
	void CreateBattleAI(TSoftClassPtr<class UBattleAIBase>& CBattleAIClass, bool bAutoInitialize);
	bool CheckWrapAroundEnable(const struct FActionOrderData& CTargetOrderData, enum class EACTION_ORDER_TYPE ERequestType, bool bIsNextTurn, bool bMoveForward);
	void CheckWeaponWeakOpen(enum class EWEAPON_CATEGORY EWeaponCategory, bool* bOpened);
	void CheckUseDamageCutShield(bool* bUseShield);
	bool CheckSupportAilment(enum class ESUPPORT_AILMENT_TYPE ESupportAilment, struct FSupportAbilityDataBase* CSupportAbilityData);
	bool CheckShuffleEnable();
	bool CheckReflactionEnforcer();
	bool CheckPreparationSealing(enum class ECOMMAND_SUB_MENU_TYPE ESubMenuType);
	bool CheckPotentialityActionExec(enum class EPOTENTIALITY_ACTION_TYPE EActionType);
	bool CheckOverTakeEnable(const struct FActionOrderData& CTargetOrderData, enum class EACTION_ORDER_TYPE ERequestType, bool bIsNextTurn);
	bool CheckLastOrderInTurn();
	bool CheckFirstOrderInTurn();
	bool CheckExecedPreparation();
	void CheckExecDiseaseForPostOrder(bool* bEnable);
	bool CheckEquipmentWeapon(enum class EWEAPON_CATEGORY ECheckWeapon);
	bool CheckEnableStealthTarget();
	bool CheckEnableStealthCursor();
	bool CheckEnableStealthActionOrder();
	bool CheckDebugSwitch(enum class EBATTLE_DEBUG_SWITCH EType);
	bool CheckCharacterReviveEnable(bool bReviveAndRecovery);
	bool CheckBoostPointMax();
	void CheckAttributeWeakOpen(enum class EATTRIBUTE_TYPE EAttributeType, bool* bOpened);
	void CheckAbilityHitFlag(bool* bAbilityHitFlag, bool* bAbilityHitInvisible);
	bool ChangeMainWeapon(enum class EWEAPON_CATEGORY ETargetWeapon, bool bUseWeaponTexture);
	bool ChangeActionModeForGaldera();
	bool ChangeActionMode(bool bIsSpecial, int32 NModeIndex, bool bUseTransition);
	bool BeginCharacterOrder(float* FWaitTime);
	bool ApplyChangeActionMode();
	bool AddPotentialityActionPoint(int32 NAddPoint, bool bIgnore);
	bool AddMaxHP(int32 NAdditiveMaxHP);
	bool AddDiseaseForSequencer(class FName DiseaseName, int32 InvocationValue, int32 InvocationTurn);
	bool AddDiseaseForAI(class FName DiseaseName, int32 InvocationValue, int32 InvocationTurn, class ABattleCharacterBase* Enforcer);
	bool AddChargeActionData(class FName StrAbilityName, TArray<class ABattleCharacterBase*>& AcTargetList);
	bool AddBribeCounter();
	class UActorComponent* AddActorComponent(class UClass* CActorComponentClass);
};

// 0x30 (0x250 - 0x220)
// Class Majesty.BattleCommandMenuActor
class ABattleCommandMenuActor : public AActor
{
public:
	bool                                         M_bIsTargetEnemySide;                              // 0x220(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E9F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          M_astrOptionDataList;                              // 0x228(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                  M_strUseActionLabel;                               // 0x238(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                 M_acCommandSealingList;                            // 0x240(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABattleCommandMenuActor* GetDefaultObj();

	void SetupCommandSealingList();
	void SetCommandSealing(enum class ECOMMAND_SEALING_TYPE EType, bool bSealing);
	bool OnStyleChange();
	bool OnPotentialityAction();
	bool OnBreakStyle();
	bool OnBoostStyle();
	bool OffPotentialityAction();
	bool OffBreakStyle();
	bool OffBoostStyle();
	bool IsCommandSealing(enum class ECOMMAND_SEALING_TYPE EType);
	void GetOptionDataList(TArray<class FName>* AstrOptionDataList, class FName* StrUseActionLabel);
	void GetEventFlag(class FName FlagName, bool* Value);
	bool ExecPotentialityAction();
	void ClearCommandSealing();
	void CheckCommandSealingListForItem(class ABattleCharacterBase* CEnforceer, const struct FItemData& CItemData, enum class EACTION_COMMAND_USEABLE* ECommandUseable);
	void CheckCommandSealingListForInvade(class ABattleCharacterBase* CEnforceer, const struct FInvadeData& CInvadeData, enum class EACTION_COMMAND_USEABLE* ECommandUseable);
	void CheckCommandSealingList(class ABattleCharacterBase* CEnforceer, const struct FAbilitySetDataBase& CAbilitySet, enum class EACTION_COMMAND_USEABLE* ECommandUseable);
};

// 0x0 (0x358 - 0x358)
// Class Majesty.BattleDamageNumberBase
class UBattleDamageNumberBase : public UKSUserWidgetBase
{
public:

	static class UClass* StaticClass();
	static class UBattleDamageNumberBase* GetDefaultObj();

	void UpdatePosition();
	void OnBattleSpeedChange(enum class ENOTICE_TYPE NoticeType, struct FNoticeArgs& NoticeArgs);
};

// 0x8 (0x40 - 0x38)
// Class Majesty.BattleEventDirector
class UBattleEventDirector : public ULevelSequenceDirector
{
public:
	uint8                                        Pad_EE3[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattleEventDirector* GetDefaultObj();

	void WaitReturnCapture_Implementation();
	void StopBGM_Implementation(float FadeOutTime);
	void SetWhiteOutFlag_Implementation(bool bEnable);
	void SetEventFlag_Implementation(class FName FlagName, bool Value);
	void SetBattleSequenceDirector(class ABattleSequenceDirector* CSequenceDirector);
	void SetBattleEnemyVisibility_Implementation(bool bVisible);
	void SetAdvancedAbility_Implementation(enum class EPlayableCharacterID CharacterID, int32 NIndex, bool bEnable);
	void ReturnCapture_Implementation();
	void RemoveBoostEffect_Implementation();
	void ReleasePotentialityAction_Implementation(enum class EPlayableCharacterID CharacterID);
	void RandomJumpToFrame_Implementation(float Rate, int32 Frame);
	void PlayVibration_Implementation(class FName VibrationID, enum class EVibrationPower Power);
	void PlaySE_Implementation(class FName SEID);
	void PlayBGM_Implementation(class FName BgmLabel, float FadeOutTime, float FadeInTime);
	void PlayAction_Implementation(class ABattleCharacterBase* ActionCharacter, enum class EKSCharacterAction BattleActionID);
	void OpenTutorial_Implementation(enum class ETUTORIAL_TYPE TutorialType, bool bForcedDisplay);
	void OpenTalk_Implementation(class FName TalkTextID, const struct FVector2D& Offset, bool WaitFinish);
	void OpenActionInfoFromAdvancedAbility_Implementation(class FName TextID, enum class EPlayableCharacterID CharaID, int32 NAbilityIndex);
	void OpenActionInfoForEightBattle_Implementation(class FName TextID);
	void OpenActionInfo_Implementation(class FName TextID);
	void JumpToFrame_Implementation(int32 Frame);
	void InstantDeath_EnemyAll_Implementation();
	void FixBattleCamera_Implementation();
	void ExecPotentialityAction_Implementation(class ABattleCharacterBase* ActionCharacter);
	void ExecExtendBGM_Implementation(int32 NIndex);
	void ExecBattleSuspend_Implementation();
	void ControlDisease_Implementation(class ABattleCharacterBase* TargetCharacter, bool Remove, class FName DiseaseName, int32 InvocationValue, int32 InvocationTurn);
	void CloseTalk_Implementation();
	void CloseActionInfo_Implementation();
	void ChangeCharacterName_Implementation(class ABattleCharacterBase* TargetCharacter, class FName CharacterNameID);
	void ChangeBoostLevel_Implementation(class ABattleCharacterBase* ActionCharacter, int32 BoostLevel);
	void ChangeActionMode_Implementation(class ABattleCharacterBase* ActionCharacter, bool bIsEnable, int32 NModeIndex, bool bUseTransition);
};

// 0x348 (0x578 - 0x230)
// Class Majesty.BattleManager
class ABattleManager : public AAcqManagerBase
{
public:
	enum class EBATTLE_ENCOUNT_TYPE              M_eBattleMode;                                     // 0x230(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bIsViewerMode;                                   // 0x231(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F77[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nBattleTurnCount;                                // 0x234(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nEnemyBreakCount;                                // 0x238(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bUsedRepeatAbility;                              // 0x23C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F79[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRareEnemyParam                       M_cRareCatlinParam;                                // 0x240(0x14)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRareEnemyParam                       M_cRareOctlinParam;                                // 0x254(0x14)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bIsWaterSideMode;                                // 0x268(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F7A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nBattleOrderCount;                               // 0x26C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nBattleOrderCountMax;                            // 0x270(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bUseSubPartyBattle;                              // 0x274(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F7B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABattleCharacterBase*>          M_acBattleCharacter;                               // 0x278(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acBattlePlayer;                                  // 0x288(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acBattleEnemy;                                   // 0x298(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acBattleSupporter;                               // 0x2A8(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acSubBattlePlayer;                               // 0x2B8(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acSubBattleSupporter;                            // 0x2C8(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bEnableSyncAnimationCharacter;                   // 0x2D8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F7E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABattleCharacterBase*                  M_cSyncAnimationCharacter_Parent;                  // 0x2E0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acSyncAnimationCharacter_Childs;                 // 0x2E8(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class ABattleCharacterBase*                  M_cPrevNoticeCharacter_Pinch;                      // 0x2F8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleCharacterBase*                  M_cPrevNoticeCharacter_JustBreak;                  // 0x300(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acReflectionEnforcerList;                        // 0x308(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class ABattleCamera*                         M_cBattleCamera;                                   // 0x318(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleSequenceDirector*               M_cBattleDirector;                                 // 0x320(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bExecutedReturnDragInEffect_Sea;                 // 0x328(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F81[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<bool>                                 M_abDragInIndex;                                   // 0x330(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<int32, class UTexture2D*>               M_acPlayerIconTexture;                             // 0x340(0x50)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FBattleVoiceSetList> M_acBattleVoiceSetList;                            // 0x390(0x50)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FBattleAdditiveOrderData              M_cCurrentAdditiveOrderData;                       // 0x3E0(0x38)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bExecSessionAbility;                             // 0x418(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F86[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActionCommandBase*                    M_cCurrentActionCommand;                           // 0x420(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULevelSequence*                        M_cBattleEventSequence;                            // 0x428(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bIsBattleEvent;                                  // 0x430(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bReadyBattleEvent;                               // 0x431(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bExecBattleEvent;                                // 0x432(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bExecBattleStartDash;                            // 0x433(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F87[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABattleCommandMenuActor*               M_cBattleCommandMenuActor;                         // 0x438(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                          M_acUsedOnceMonsterList;                           // 0x440(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          M_acUsedAwakingMonsterList;                        // 0x450(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bIsAutoTameMonster;                              // 0x460(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F88[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABattleCharacterBase*                  M_cAutoTameTarget;                                 // 0x468(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleActionOrder*                    M_cBattleActionOrder;                              // 0x470(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ABattleCharacterBase*>          M_acFirstActionCharacter;                          // 0x478(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bIsFirstActionCharacter;                         // 0x488(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bExecFirstActionTurn;                            // 0x489(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F89[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABattleCharacterBase*                  M_cActiveCharacter;                                // 0x490(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleCharacterBase*                  M_cActionCharacter;                                // 0x498(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleCharacterBase*                  M_cAdditiveCharacter;                              // 0x4A0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FActionOrderData                      M_cCurrentOrderData;                               // 0x4A8(0x40)(BlueprintVisible, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        M_nTotalRewardMoney;                               // 0x4E8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nTotalRewardExp;                                 // 0x4EC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nTotalRewardJP;                                  // 0x4F0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nRewardLuckyMoney;                               // 0x4F4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nRewardLuckyExp;                                 // 0x4F8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nRewardLuckyJP;                                  // 0x4FC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fMoneyRatioByAbility;                            // 0x500(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fExpRatioByAbility;                              // 0x504(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fJPRatioByAbility;                               // 0x508(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fMoneyRatioByEquipment;                          // 0x50C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fExpRatioByEquipment;                            // 0x510(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fJPRatioByEquipment;                             // 0x514(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fMoneyRatioBySupport;                            // 0x518(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fExpRatioBySupport;                              // 0x51C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fJPRatioBySupport;                               // 0x520(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fExpRatioBySupportInNight;                       // 0x524(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fJPRatioBySupportInNight;                        // 0x528(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bOverrideBattleSpeed;                            // 0x52C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bAllowChangeBattleSpeed;                         // 0x52D(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bMainPartyIsFrontMember;                         // 0x52E(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bOnePartyDead;                                   // 0x52F(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bExecChangePartySequencer;                       // 0x530(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F97[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nSettledPlayerNum;                               // 0x534(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FWeaponTexutreUnloadManage            M_WeaponUnloadManage;                              // 0x538(0x28)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_F98[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bDebugRelaseWeaponTexture;                       // 0x570(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F99[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABattleManager* GetDefaultObj();

	void UpdateBattleNumberUI();
	bool UpdateBattleFieldDisease();
	bool SwapBattlePlayerForEightBattle();
	void StartBattleRequest();
	void SetUsedRepeatAbility(bool bEnable);
	bool SetupAutoTameMonster(class ABattleCharacterBase* CTarget);
	void SetUnloadWeaponGCType(enum class EWEAPON_UNLOAD_GC_TYPE EType);
	void SetUnloadWeaponCntMax(uint8 UMax);
	void SetSyncAnimationCharacterParent(class ABattleCharacterBase* CCharacter);
	void SetPrevNoticeCharacter_Pinch(class ABattleCharacterBase* CPinchCharacter);
	void SetPrevNoticeCharacter_JustBreak(class ABattleCharacterBase* CJustBreakCharacter);
	bool SetMoneyRatioBySupport(float FRatio);
	bool SetMoneyRatioByEquipment(float FRatio);
	bool SetMoneyRatioByAbility(float FRatio);
	bool SetJPRatioBySupportInNight(float FRatio);
	bool SetJPRatioBySupport(float FRatio);
	bool SetJPRatioByEquipment(float FRatio);
	bool SetJPRatioByAbility(float FRatio);
	bool SetExpRatioBySupportInNight(float FRatio);
	bool SetExpRatioBySupport(float FRatio);
	bool SetExpRatioByEquipment(float FRatio);
	bool SetExpRatioByAbility(float FRatio);
	void SetExecSessionAbilityForTutorial(bool bEnable);
	void SetEnableRelaseWeaponTexture(bool bRelease);
	void SetDebugSwitch(enum class EBATTLE_DEBUG_SWITCH EType, bool bValue);
	void SetDebugParameter(enum class EBATTLE_DEBUG_SWITCH EType, int32 NValue);
	bool SetBattleStartType(enum class EBATTLE_START_TYPE StartType, bool WaterSide);
	void SearchPlayerCharacter(enum class EPlayableCharacterID ECharaID, class ABattleCharacterBase** PlayerCharacter, bool* bFindCharacter, bool* bCharacterAlive);
	void SearchEnemyCharacter(class FName StrEnemyID, class ABattleCharacterBase** EnemyCharacter, bool* bFindCharacter, bool* bCharacterAlive);
	bool SearchBattleFieldDisease(enum class EFIELD_DISEASE_TYPE DiseaseType);
	void ReturnDragInIndex(int32 NIndex);
	void ResetDragInIndex();
	bool RequestPlayActionWaitTime(float FWaitTime);
	void RequestLoadForEndroll(enum class EEndRollSegmentSet ESegment);
	void RequestLoadBattleEvent(TSoftObjectPtr<class ULevelSequence>& CEventSequence);
	bool RequestChangeBattleParty();
	void RequestBattleEvent(TSoftObjectPtr<class ULevelSequence>& EventSequence, class ABattleCharacterBase* MainActor, class ABattleCharacterBase* EventEnforcer);
	bool RemoveBattleFieldDisease(enum class EFIELD_DISEASE_TYPE DiseaseType);
	void ReleasePotentialityAction();
	void PlayReturnDragInEffect(class ABattleCharacterBase* CReturnCharacter, enum class EBATTLE_DRAG_IN_TYPE EDragInType);
	void OpenMultiLineInfomation(class FText& StrFirstText, class FText& StrSecondText);
	void OpenChainInfomation(TArray<class FText>& AstrInfomationText, float FShowTime);
	void OpenActionInfomation(class FText& StrInfomationText);
	bool IsItemCommandSeal();
	bool IsItemCommandEnable();
	bool IsGuardCommandEnable();
	bool IsFirstActionTurn();
	bool IsExecBattleStartDash();
	bool IsEscapeCommandEnable();
	bool IsEndrollReplayMode();
	bool IsEnableRelaseWeaponTexture();
	bool IsEightBattleMode();
	void IsChangeBattlePartyEnable(bool* bEnable, bool* bExecutable);
	bool IsBoostCommandEnable();
	bool IsBattleSpeedOverride();
	bool IsAutoTameMonster();
	bool IsAllowChangeBattleSpeed();
	bool InitUsedInvadeMonster();
	void InitSyncAnimationCharacter();
	void InitPrevNoticeCharacter();
	void InitializeResultValue();
	void InitBattleOrderCount();
	bool InitBattleFirstActionCharacter();
	bool GetWaterSideMode();
	bool GetUsedRepeatAbility();
	bool GetSyncAnimationCharacter(class ABattleCharacterBase** CParent, TArray<class ABattleCharacterBase*>* AcChilds);
	TArray<class ABattleCharacterBase*> GetSubBattlePlayerList();
	int32 GetSettledPlayerNum();
	float GetResultMoneyRatio();
	float GetResultJPRatio();
	float GetResultExpRatio();
	TArray<class ABattleCharacterBase*> GetRespawnableEnemyList(bool* bFindEnemy);
	void GetRespawnableEnemy(int32 NIndex, class ABattleCharacterBase** CRespawnableEnemy, bool* bFindEnemy);
	bool GetPrevNoticeCharacter_Pinch(class ABattleCharacterBase** CPinchCharacter);
	bool GetPrevNoticeCharacter_JustBreak(class ABattleCharacterBase** CJustBreakCharacter);
	bool GetOnePartyDead();
	void GetMapObjectRoot(class AActor** CMapObjectRoot);
	bool GetMainPartyIsFrontMember();
	class ABattleManager* GetInstance();
	void GetEventFlag(class FName FlagName, bool* Value);
	class FName GetEnemyGroupID();
	int32 GetEnemyBreakCount();
	int32 GetDebugParameter(enum class EBATTLE_DEBUG_SWITCH EType);
	class UDebugBattleLogComponent* GetDebugLogComponent();
	class UDebugBattleManagerComponent* GetDebugComponent();
	bool GetCurrentAdditiveOrderData(struct FBattleAdditiveOrderData* CAdditiveOrderData);
	void GetCurrentActionOrderData(struct FActionOrderData* CActionData);
	bool GetCurrentActionCommand(class AActionCommandBase** CActionCommand);
	class ABattleCommandMenuActor* GetCommandMenuActor();
	bool GetBattleVoiceSetList(class FName StrCharacterID, TArray<class FName>* AstrBattleVoiceLabel);
	bool GetBattleViewerMode();
	int32 GetBattleTurnCount();
	TArray<class ABattleCharacterBase*> GetBattleSupporterList();
	enum class EBATTLE_START_TYPE GetBattleStartType();
	void GetBattleSequencerObject_SteamEffect(class AEmitter** CSteamAuraA, class AEmitter** CSteamFieldA);
	void GetBattleSequencerObject_AntlionSand(class AStaticMeshActor** CAntlionSandA, class AStaticMeshActor** CAntlionSandB);
	class ABattleSequenceDirector* GetBattleSequenceDirector();
	void GetBattlePlayerListForSequencer(TArray<class ABattleCharacterBase*>* AcFrontParty, TArray<class ABattleCharacterBase*>* AcBackParty);
	TArray<class ABattleCharacterBase*> GetBattlePlayerListForEightBattle();
	TArray<class ABattleCharacterBase*> GetBattlePlayerList();
	void GetBattleOrderCount(int32* NOrderCount, int32* NOrderCountMax);
	enum class EBATTLE_ENCOUNT_TYPE GetBattleMode();
	bool GetBattleInfomation(class FName* StrEnemyGroupID, bool* bBossBattle, bool* bFieldCommandBattle);
	TArray<class ABattleCharacterBase*> GetBattleEnemyList();
	TArray<class ABattleCharacterBase*> GetBattleCharacterList();
	class ABattleCamera* GetBattleCamera();
	void GetBattleBoostMode(bool* bBoostMode);
	void GetBattleActiveCharacter(class ABattleCharacterBase** CActiveCharacter);
	class ABattleActionOrder* GetBattleActionOrder();
	bool GetAutoTameTarget(class ABattleCharacterBase** CAutoTameTarget);
	int32 GetAddDragInIndex();
	void FinishChangePartySequencer();
	void FinishBattleStartDash();
	void FinishBattleEvent();
	bool ExecInitializeEnemyResourceList();
	void ExecDebugPlayBattleEvent(TSoftObjectPtr<class ULevelSequence>& CEventSequence, class ABattleCharacterBase* CMainActor, class ABattleCharacterBase* CEventEnforcer);
	bool ExecDebugPlayAbility(class FName StrAbilityLabel, int32 NBoostLevel, bool bPlayerSide);
	bool ExecChangeBattleSpeed();
	void ExecBattleSuspend();
	bool ExecBattleFieldDisease(enum class EFIELD_DISEASE_TYPE DiseaseType);
	bool ExecActionOrderBlind(bool bEnable, bool bPlayerOnly);
	bool Debug_IsReadyBattleSuspend();
	bool CreateStationaryBattleUI();
	void CloseActionInfomation();
	bool CheckUsedOnceMonster(class FName StrCheckMonsterLabel);
	bool CheckUsedAwakingMonster(class FName StrCheckMonsterLabel);
	bool CheckSupportAilmentInParty(enum class ESUPPORT_AILMENT_TYPE EAilmentType, struct FSupportAbilityDataBase* CAbilityData);
	bool CheckDebugSwitch(enum class EBATTLE_DEBUG_SWITCH EType);
	bool CheckBattleVictory();
	bool CheckBattleTutorial_OpenCommandMenu();
	bool CheckBattlePlayerInMainParty(class ABattleCharacterBase* CTargetPlayer);
	void CheckBattleDefeat(bool* bBattleDefeat, bool* bEightBattleChange);
	void ChangeBattlePartyForAbility();
	void ApplyAllDebugSwitch();
	bool AddUsedOnceMonster(class FName StrUsedMonsterLabel);
	bool AddUsedAwakingMonster(class FName StrUsedMonsterLabel);
	void AddUnloadWeaponTextureLabel(TArray<class FName>& WeaponList);
	void AddSyncAnimationCharacterChilds(class ABattleCharacterBase* CCharacter);
	bool AddRewardLuckyMoney(int32 NValue);
	bool AddRewardLuckyJP(int32 NValue);
	bool AddRewardLuckyExp(int32 NValue);
	void AddReflectionEnforcerList(class ABattleCharacterBase* CCharacter);
	void AddloadWeaponTextureLabel(TArray<class FName>& WeaponList);
	void AddEnemyBreakCount();
	void AddBattleTurnCount();
	void AddBattleOrderCount();
	void AddBattleLogForOneLine(const class FString& StrBattleLog);
	void AddBattleLog(const struct FDebugBattleLog& CBattleLog);
	bool AddBattleFirstActionCharacter(class ABattleCharacterBase* CActionCharacter);
	bool AddBattleFieldDisease(enum class EFIELD_DISEASE_TYPE DiseaseType, int32 InvocationValue, int32 InvocationTurn, int32 DiseaseLevel, class ABattleCharacterBase* Enforcer);
	bool AddAdditiveOrderForSong(class ABattleCharacterBase* Enforcer, class FName AbilityName);
	bool AddAdditiveOrderForSignOfBoost(class ABattleCharacterBase* Enforcer, class FName AbilityName);
	bool AddAdditiveOrderForReraise(class ABattleCharacterBase* Enforcer);
	bool AddAdditiveOrderForRepeat(class ABattleCharacterBase* Enforcer, class FName AbilityName, TArray<class ABattleCharacterBase*>& AcTargetList);
	bool AddAdditiveOrderForReflection(class ABattleCharacterBase* Enforcer, class FName StrAbilityName, class FName StrAilmentName, int32 NInvocationValue, enum class EATTRIBUTE_TYPE EAttribute, class ABattleCharacterBase* CTargetList);
	bool AddAdditiveOrderForLastAttack(class ABattleCharacterBase* Enforcer, class FName AbilityName, TArray<class ABattleCharacterBase*>& AcTargetList);
	bool AddAdditiveOrderForFirstAttack(class ABattleCharacterBase* Enforcer, class FName AbilityName, TArray<class ABattleCharacterBase*>& AcTargetList);
	bool AddAdditiveOrderForEnchant(class ABattleCharacterBase* Enforcer, class FName AbilityName, TArray<class ABattleCharacterBase*>& AcTargetList);
	bool AddAdditiveOrderForCounter(class ABattleCharacterBase* Enforcer, class FName AbilityName, bool bOnDead, bool bCounterOnce, class ABattleCharacterBase* CTargetList);
	bool AddAdditiveOrderForChaseAttack(class ABattleCharacterBase* Enforcer, class FName AbilityName, TArray<class ABattleCharacterBase*>& AcTargetList);
	bool AddAdditiveOrderForAutoTameMonster(class ABattleCharacterBase* CEnforcer, class ABattleCharacterBase* CTarget);
};

// 0x28 (0x50 - 0x28)
// Class Majesty.StateDataBase
class UStateDataBase : public UObject
{
public:
	enum class EMAINSEQ_TYPE                     M_SeqType;                                         // 0x28(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMAINSEQ_TYPE                     M_BeforeSeqType;                                   // 0x29(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMAINSEQ_TYPE                     M_NextSeqType;                                     // 0x2A(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EREQUEST_TYPE                     M_ExecRequestType;                                 // 0x2B(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FA5[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EREQUEST_TYPE>             M_RequestList;                                     // 0x30(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMainSequenceStateParam               M_Param;                                           // 0x40(0x10)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UStateDataBase* GetDefaultObj();

	bool UpdateState();
	void SetStateParam(const struct FMainSequenceStateParam& Param);
	enum class EPRIORITY GetPriority();
	bool ChangeState(enum class EMAINSEQ_TYPE Type);
};

// 0x8 (0x58 - 0x50)
// Class Majesty.BattleReadyStateData
class UBattleReadyStateData : public UStateDataBase
{
public:
	uint8                                        Pad_FAA[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattleReadyStateData* GetDefaultObj();

};

// 0x170 (0x390 - 0x220)
// Class Majesty.BattleSequenceDirector
class ABattleSequenceDirector : public AActor
{
public:
	TArray<class ALevelSequenceActor*>           M_acManualUpdateSequencerList;                     // 0x220(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cBoostSequenceActor;                             // 0x230(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cAbilityCameraSequenceActor;                     // 0x238(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cWeatherSequenceActor;                           // 0x240(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cEncountSequenceActor;                           // 0x248(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cBreakSequenceActor;                             // 0x250(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleAbilitySequenceActor*           M_cActionCommandSequenceActor;                     // 0x258(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ABattleAbilitySequenceActor*>   M_acSubActionCommandSequenceActor;                 // 0x260(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cBattleEventSequenceActor;                       // 0x270(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cBattleDashSequenceActor;                        // 0x278(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cBattleResultSequenceActor;                      // 0x280(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                   M_cBattlePartyChangeSequenceActor;                 // 0x288(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleCamera*                         M_cBattleCamera;                                   // 0x290(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APostProcessVolume*                    M_cPostProcessVolume;                              // 0x298(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nBoostLevel;                                     // 0x2A0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1017[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                M_cBattleDustEffectActor;                          // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleSequenceEmitter*                M_cBoostEffectLv1Actor;                            // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleSequenceEmitter*                M_cBoostEffectLv2Actor;                            // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleSequenceEmitter*                M_cBoostEffectLv3Actor;                            // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleSequencePointLight*             M_cPointLightActor;                                // 0x2C8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1018[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EBATTLE_CAMERA_SEQUENCE           M_eAbilityCameraSlideSequence;                     // 0x2E8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1019[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFrameTime                            M_cAbilityCameraSlideStartFrame;                   // 0x2EC(0x8)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameTime                            M_cAbilityCameraSlideEndFrame;                     // 0x2F4(0x8)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBATTLE_CAMERA_SEQUENCE           M_eAbilityCameraBackSequence;                      // 0x2FC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_101B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFrameTime                            M_cAbilityCameraBackStartFrame;                    // 0x300(0x8)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameTime                            M_cAbilityCameraBackEndFrame;                      // 0x308(0x8)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActionCommandBase*                    M_cActionCommand;                                  // 0x310(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SUB_ACTION_COMMAND_MAX;                            // 0x318(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_nSubActionCommandCounter;                        // 0x31C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActionCommandBase*>            M_acSubActionCommand;                              // 0x320(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                        ABILITY_POINT_LIGHT_MAX;                           // 0x330(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_101D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABattleSequencePointLight*>     M_acAbilityPointLightActor;                        // 0x338(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class AActor*                                M_cPartyAreaMounter;                               // 0x348(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                M_cEnemyAreaMounter;                               // 0x350(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ABattleSequenceEmitter*>        M_acAbilityEffectList;                             // 0x358(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleSequenceEmitter*>        M_acAbilityHitEffectList;                          // 0x368(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABattleSequenceEmitter*>        M_acSupportRotationEffectList;                     // 0x378(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UBalloonBase*                          M_cEventBalloon;                                   // 0x388(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABattleSequenceDirector* GetDefaultObj();

	void WaitTutorialFinish();
	void WaitTalkBalloonFinish();
	void WaitReturnCaptureCommand();
	void WaitResultUIFinishCommand();
	void WaitResultUIFinish();
	void WaitActionCommandDirector();
	void UpdateAbilityCameraSlideSegment(class ULevelSequencePlayer* CPlayer, float FSlideRate);
	void UpdateAbilityCameraBackSegment(class ULevelSequencePlayer* CPlayer, float FBackRate);
	void UnRegisterSequenceUpdated(class ULevelSequencePlayer* CPlayer);
	void UnRegisterAbilitySequenceUpdated(class ABattleAbilitySequenceActor* CAbilitySequence);
	void TickManualSequencerUpdate(float FDeltaSeconds);
	bool SuspendBoostSequencer(int32 NBoostLevel);
	void SuspendActionCommand();
	void StartBattleFade();
	class UParticleSystemComponent* SpawnBoostEffect(int32 NBoostLevel);
	void SetWeatherSequencerRestoreFlag(bool bRestoreState);
	bool SetSequenceTrackDisable(class ALevelSequenceActor* CSequenceActor, const struct FMovieSceneObjectBindingID& CTrackID, bool bDisable);
	void SetBattleWipeWhiteOutFlag(bool bEnable);
	void SetBattleEnemyVisibility(bool bVisible);
	void SetAdvancedAbility(enum class EPlayableCharacterID CharacterID, int32 NIndex, bool bEnable);
	void ReturnCaptureCommand();
	void ResumeActionCommandDirector();
	bool ResetActionCommandDirector(class ABattleAbilitySequenceActor* CSequenceActor, bool bIsSubCommand);
	void RemoveBoostEffect();
	void ReleasePotentialityAction(enum class EPlayableCharacterID CharacterID);
	void RegisterSequenceUpdated(class ULevelSequencePlayer* CPlayer, FDelegateProperty_ CDelegate);
	void RegisterAbilitySequenceUpdated(class ABattleAbilitySequenceActor* CAbilitySequence);
	void PlayVibrationCommand(class FName VibrationID, enum class EVibrationPower Power);
	void PlaySECommand(class FName SEID);
	void PlayActionCommand(class ABattleCharacterBase* ActionCharacter, enum class EKSCharacterAction BattleActionID);
	void OpenTutorialCommand(enum class ETUTORIAL_TYPE ETutorialType, bool bForcedDisplay);
	void OpenTalkCommand(class FName TalkTextID, const struct FVector2D& Offset, bool WaitFinish);
	void OpenResultUICommand();
	void OpenActionInfoFromAdvancedAbility(class FName TextID, enum class EPlayableCharacterID CharaID, int32 AbilityIndex);
	void OpenActionInfoForEightBattle(class FName TextID);
	void OpenActionInfo(class FName TextID);
	void NotifyCameraCut(class ACineCameraActor* CTargetCamera);
	void InterpolationResultCamera(float FRatio);
	void InterpolationAbilityCamera(float FRatio);
	void InstantDeath_EnemyAll();
	class ULevelSequence* GetWeatherSequence(enum class ETimeZoneType ETimeZone, enum class EBATTLE_SEQUENCER_CHANGE_TYPE EChangeType);
	class FName GetPlayerLabelByIntID(int32 NPlayerID);
	class ULevelSequence* GetPartyChangeSequence(bool bFrontToBack);
	class ULevelSequenceDirector* GetLevelSequenceDirector(class ULevelSequencePlayer* CPlayer);
	class ULevelSequence* GetEscapeDashSequence(bool bSuccess);
	class ULevelSequence* GetEncountSequence(enum class EBATTLE_CAMERA_TYPE ECameraType);
	class ULevelSequence* GetBreakSequence(enum class EBREAK_CAMERA_TYPE EBreakType, enum class EBATTLE_CAMERA_TYPE ECameraType);
	class ULevelSequence* GetBoostSequence(int32 NBoostLevel, enum class EBATTLE_SEQUENCER_CHANGE_TYPE EChangeType);
	class ULevelSequence* GetBattleStartDashSequence(enum class EBATTLE_START_DASH_TYPE EStartDashType);
	class ULevelSequence* GetBattleResultSequence(enum class EBATTLE_RESULT_TYPE EResultType, enum class EBATTLE_CAMERA_TYPE ECameraType, bool bIsFront);
	bool GetAbilityCameraSlideSegment(class ULevelSequencePlayer* CPlayer, float* FLength);
	class ULevelSequence* GetAbilityCameraSequence(int32 NBoostLevel, enum class EBATTLE_TARGET_TYPE ETargetType, enum class EBATTLE_CAMERA_TYPE ECameraType, bool bEnemySide, bool bIsFront, class FName StrAbilityName);
	bool GetAbilityCameraBackSegment(class ULevelSequencePlayer* CPlayer, float* FLength);
	void FixBattleCameraCommand();
	void FinishSubActionCommandDirector();
	void FinishResultDash();
	void FinishPartyChange();
	void FinishEscapeDash();
	void FinishEncountCamera();
	void FinishBreaktCamera();
	void FinishBoostShutDown();
	void FinishBattleStartDash();
	void FinishBattleResult();
	void FinishBattleEvent();
	void FinishActionCommandDirector();
	void FinishAbilityCamera();
	bool FindTrackAttachInfoByTag(class ALevelSequenceActor* CSequenceActor, class FName StrTag, enum class EBATTLE_EFFECT_ATTACH_TYPE* EAttachType);
	bool FindEventActorTrackByTag(class ALevelSequenceActor* CSequenceActor, class FName StrTag);
	bool FindEmitterTemplateByTag(class ALevelSequenceActor* CSequenceActor, class FName StrTag, TArray<class UParticleSystem*>* AcEmitterTemplate, TArray<struct FMovieSceneObjectBindingID>* AcBindingID);
	bool ExecWeatherSequencer(enum class ETimeZoneType ETimeZone, enum class EBATTLE_SEQUENCER_CHANGE_TYPE EChangeType);
	void ExecWeatherLoop();
	void ExecSubActionCommandDirector(class AActionCommandBase* CActionCommand, class ULevelSequence* CExecSequence);
	bool ExecResultDashSequencer();
	void ExecResultDash();
	void ExecPotentialityAction(class ABattleCharacterBase* ActionCharacter);
	bool ExecPartyChangeSequencer(bool bFrontToBack);
	void ExecPartyChange(bool bFrontToBack);
	void ExecNextBoostEvent();
	void ExecForceTickForRigRail(class ACameraRig_Rail* CTargetCameraRig);
	void ExecForceTickForCineCamera(class ACineCameraActor* CTargetCamera);
	bool ExecEscapeDashSequencer(bool bSuccess);
	void ExecEscapeDash(bool bSuccess);
	bool ExecEncountCameraSequencer(enum class EBATTLE_CAMERA_TYPE ECameraType);
	void ExecEncountCamera(enum class EBATTLE_CAMERA_TYPE ECameraType);
	bool ExecBreakCameraSequencer(enum class EBREAK_CAMERA_TYPE EBreakType, enum class EBATTLE_CAMERA_TYPE ECameraType);
	void ExecBreakCamera(enum class EBREAK_CAMERA_TYPE EBreakType, enum class EBATTLE_CAMERA_TYPE ECameraType);
	void ExecBoostStart(int32 NBoostLevel);
	void ExecBoostShutDown(bool bWithWeather);
	bool ExecBoostSequencer(int32 NBoostLevel, enum class EBATTLE_SEQUENCER_CHANGE_TYPE EChangeType);
	void ExecBoostLoop();
	void ExecBattleSuspendCommand();
	bool ExecBattleStartDashSequencer(enum class EBATTLE_START_DASH_TYPE EStartDashType);
	void ExecBattleStartDash(enum class EBATTLE_START_DASH_TYPE EStartDashType);
	bool ExecBattleResultSequencer(enum class EBATTLE_RESULT_TYPE EResultType, enum class EBATTLE_CAMERA_TYPE ECameraType, bool bIsFront);
	void ExecBattleResult(enum class EBATTLE_RESULT_TYPE EResultType, enum class EBATTLE_CAMERA_TYPE ECameraType, bool bIsFront);
	bool ExecBattleEventSequencer(class ULevelSequence* CExecSequence, class ABattleCharacterBase* CEventActor, enum class EBATTLE_CHARA_POSITION_RESET_TYPE EPositionType);
	void ExecBattleEvent(class ULevelSequence* CExecSequence, class ABattleCharacterBase* CEventActor, enum class EBATTLE_CHARA_POSITION_RESET_TYPE EPositionType);
	bool ExecActionCommandSequencer(class AActionCommandBase* CActionCommand, class ULevelSequence* CExecSequence, class ABattleAbilitySequenceActor* CSequenceActor, bool bIsSubCommand);
	void ExecActionCommandDirector(class AActionCommandBase* CActionCommand, class ULevelSequence* CExecSequence);
	bool ExecAbilityCameraSequencer(int32 NBoostLevel, enum class EBATTLE_TARGET_TYPE ETargetType, enum class EBATTLE_CAMERA_TYPE ECameraType, int32 NSlideFrame, class AActionCommandBase* CActionCommand, bool bEnemySide, bool bIsFront, class FName StrAbilityName);
	void ExecAbilityCamera(int32 NBoostLevel, enum class EBATTLE_TARGET_TYPE ETargetType, enum class EBATTLE_CAMERA_TYPE ECameraType, int32 NSlideFrame, class AActionCommandBase* CActionCommand, bool bEnemySide, bool bIsFront, class FName StrAbilityName);
	void EnableAbilityHitEffect();
	class ULevelSequencePlayer* CreateAbilitySequencePlayer(class UObject* WorldContextObject, class ULevelSequence* CLevelSequence, const struct FMovieSceneSequencePlaybackSettings& CSettings, class ABattleAbilitySequenceActor** OutActor);
	TArray<class ABattleSequenceEmitter*> CreateAbilityEffect(class UParticleSystem* CTemplate, enum class EBATTLE_EFFECT_ATTACH_TYPE EAttachType, class AActionCommandBase* CActionCommand, bool bGroundEffect, bool bReviveEffect, bool bAttachSocket);
	void CloseTalkCommand();
	void CloseActionInfo();
	bool CheckTrackHaveSpecifiedTag(class ALevelSequenceActor* CSequenceActor, const struct FMovieSceneObjectBindingID& CTrackID, class FName StrCheckTag);
	bool CheckSequencerHaveSpecifiedTag(class ALevelSequenceActor* CSequenceActor, class FName StrCheckTag);
	void ChangeBoostLevelCommand(class ABattleCharacterBase* ActionCharacter, int32 BoostLevel);
	void ChangeBoostLevel(int32 NBoostLevel, bool bAddLevel);
};

// 0x20 (0x290 - 0x270)
// Class Majesty.BattleSequenceEmitter
class ABattleSequenceEmitter : public AEmitter
{
public:
	class UParticleSystemComponent*              M_cOriginalEffect;                                 // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bEmitterTrigger;                                 // 0x278(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bEnableAttachTarget;                             // 0x279(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_102D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UEnforcerOffsetComponent*              M_cEnforcerOffsetComponent;                        // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABattleCharacterBase*                  M_cAttachBattleCharacter;                          // 0x288(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABattleSequenceEmitter* GetDefaultObj();

	void UpdateBattleEmitterVisibility(bool bVisible);
	void SetParticleSystemTemplate(class UParticleSystem* CTemplate);
	void SetParticleSystemComponent(class UParticleSystemComponent* CComponent);
	void SetEnableAttachTarget(bool bEnable);
	void SetEmitterTrigger(bool bTrigger);
	void SetAttachBattleCharacter(class ABattleCharacterBase* CCharacter);
	void ReleaseParticleSystemComponent();
	bool IsEnableAttachTarget();
	bool IsEmitterTrigger();
	class ABattleCharacterBase* GetAttachBattleCharacter();
};

// 0x10 (0x230 - 0x220)
// Class Majesty.BattleSequencePointLight
class ABattleSequencePointLight : public AActor
{
public:
	class UPointLightComponent*                  PointLightComponent;                               // 0x220(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShadowResolutionScale;                             // 0x228(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1032[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABattleSequencePointLight* GetDefaultObj();

	void SetShadowResolutionScale(float FValue);
};

// 0x8 (0x58 - 0x50)
// Class Majesty.BattleStateData
class UBattleStateData : public UStateDataBase
{
public:
	uint8                                        Pad_1035[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattleStateData* GetDefaultObj();

};

// 0xB8 (0x168 - 0xB0)
// Class Majesty.BattleVoiceComponent
class UBattleVoiceComponent : public UActorComponent
{
public:
	class ABattleCharacterBase*                  M_cOwnerPlayer;                                    // 0xB0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bReadyBattleVoice;                               // 0xB8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_103C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EBATTLE_VOICE_TYPE, struct FBattleVoiceDataList> M_acBattleVoiceDataList;                           // 0xC0(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FBattleVoiceDataList> M_acAbilityVoiceDataList;                          // 0x110(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bSettledPlayOnce_OnTakeDamage;                   // 0x160(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bEnableDetailLog;                                // 0x161(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_103D[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattleVoiceComponent* GetDefaultObj();

	void SetSettledPlayOnce_OnTakeDamage(bool bEnable);
	void ResetVoiceFlagForPreAction();
	bool PlayBattleVoice(enum class EBATTLE_VOICE_TYPE EBattleVoiceType, const struct FBattleVoiceSetData& CPlayCondition);
	bool IsReadyBattleVoice();
	bool IsBattleVoice(enum class EBATTLE_VOICE_TYPE EBattleVoiceType);
	bool InitBattleVoice(class FName StrBattleVoiceID);
	bool GetSettledPlayOnce_OnTakeDamage();
	void GetEventFlag(class FName FlagName, bool* Value);
};

// 0x10 (0x2D0 - 0x2C0)
// Class Majesty.BattleWipeBase
class UBattleWipeBase : public UAcqUserWidget
{
public:
	bool                                         M_bBattleEndWipeOut;                               // 0x2C0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bEnableWhiteOut;                                 // 0x2C1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bExecWipe;                                       // 0x2C2(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBATTLE_WIPE_STATE                M_eState;                                          // 0x2C3(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bDebugWipeColorEnable;                           // 0x2C4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1044[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                M_DebugWipeColor;                                  // 0x2C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1045[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattleWipeBase* GetDefaultObj();

	void WipeOutAtBattleStart();
	void WipeOutAtBattleEnd();
	void WipeInAtBattleStart();
	void WipeInAtBattleEnd();
	void SetWhiteOut(bool Enable);
	void SetupDebugWipeColor();
	bool IsReadyAnimation();
	bool IsExecWipe();
	bool IsEnableWhiteOut();
	bool IsBattleEndWipeOut();
	void HideWipeAtBattleEnd_Immediately();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.BitFlagSaveDataUtil
class UBitFlagSaveDataUtil : public USaveDataUtilBase
{
public:

	static class UClass* StaticClass();
	static class UBitFlagSaveDataUtil* GetDefaultObj();

	bool IsFixedFollowNPC_Placate();
	bool IsFixedFollowNPC_Lure();
	bool IsFixedFollowNPC_Lead();
	bool IsFixedFollowNPC_Hire();
};

// 0x8 (0x260 - 0x258)
// Class Majesty.BlockingVolumeFootStep
class ABlockingVolumeFootStep : public AVolume
{
public:
	enum class EPhysicalSurface                  M_eFootStepType;                                   // 0x258(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_104C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABlockingVolumeFootStep* GetDefaultObj();

};

// 0x58 (0x3B0 - 0x358)
// Class Majesty.BusinessWithNpcNotificationBase
class UBusinessWithNpcNotificationBase : public UKSUserWidgetBase
{
public:
	bool                                         M_bIsOpening;                                      // 0x358(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1053[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSpActMerchantResult                  M_SpActMerchantResult;                             // 0x360(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBusinessWithNpcNotificationBase* GetDefaultObj();

	void OpenNotificationAnimal(struct FSpActMerchantResult& SpActMerchantResult, bool bIsFast);
	void OpenNotification(struct FSpActMerchantResult& SpActMerchantResult, bool bIsFast);
	void CloseNotification(bool bIsFast);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.ButtonTextDataTable
class UButtonTextDataTable : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UButtonTextDataTable* GetDefaultObj();

	bool GetButtonTextTableRowData(enum class EBPFuncReturnCode* ReturnCode, struct FButtonTextData* OutData, class FName TargetLabel, bool LogEnable);
};

// 0x18 (0x238 - 0x220)
// Class Majesty.CalcBillboard
class ACalcBillboard : public AActor
{
public:
	uint8                                        Pad_1057[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCameraComponent*                      M_pCineCamComp;                                    // 0x228(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1058[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACalcBillboard* GetDefaultObj();

};

// 0x10 (0x238 - 0x228)
// Class Majesty.KSTriggerBase
class AKSTriggerBase : public ATriggerBase
{
public:
	enum class EKSTriggerType                    M_eTriggerType;                                    // 0x228(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1067[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nProcessOrder;                                   // 0x22C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1068[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AKSTriggerBase* GetDefaultObj();

	void Update(float DeltaSeconds);
	void SetDebugTextColor(const struct FLinearColor& Color);
	void SetDebugText(const class FString& DebugStr);
	void Reset();
	void Initialize();
	enum class EKSTriggerType GetTriggerType();
	bool CanActivateTrigger();
};

// 0x0 (0x238 - 0x238)
// Class Majesty.MJBoxTrigger
class AMJBoxTrigger : public AKSTriggerBase
{
public:

	static class UClass* StaticClass();
	static class AMJBoxTrigger* GetDefaultObj();

};

// 0x30 (0x268 - 0x238)
// Class Majesty.CameraLockTrigger
class ACameraLockTrigger : public AMJBoxTrigger
{
public:
	bool                                         M_bLock;                                           // 0x238(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bUnlock;                                         // 0x239(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bLockX;                                          // 0x23A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bLockY;                                          // 0x23B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bLockZ;                                          // 0x23C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1073[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               M_LimitLock;                                       // 0x240(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               M_LimitLockFar;                                    // 0x24C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               M_LimitUnlock;                                     // 0x258(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1075[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACameraLockTrigger* GetDefaultObj();

	void SetLimitPosition(struct FVector& LimitLock, struct FVector& LimitLockFar, struct FVector& LimitUnlock);
	class UBoxComponent* GetCollision();
	struct FVector ClamptLockPositionInRange(struct FVector& LockPosition);
};

// 0x8 (0x228 - 0x220)
// Class Majesty.CameraLockTriggerHolder
class ACameraLockTriggerHolder : public AActor
{
public:
	uint8                                        Pad_1078[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACameraLockTriggerHolder* GetDefaultObj();

};

// 0x0 (0x238 - 0x238)
// Class Majesty.CanoeDockTrigger
class ACanoeDockTrigger : public AMJBoxTrigger
{
public:

	static class UClass* StaticClass();
	static class ACanoeDockTrigger* GetDefaultObj();

};

// 0x80 (0x540 - 0x4C0)
// Class Majesty.CharacterFlipbookComponent
class UCharacterFlipbookComponent : public UPaperFlipbookComponent
{
public:
	uint8                                        Pad_1088[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class UMaterialInstanceDynamic*> M_FlipbookMaterialList;                            // 0x4E8(0x50)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_1089[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCharacterFlipbookComponent* GetDefaultObj();

	void SetFlipbookVisibility(bool bVisibility);
	void SetFlipbookOffset(struct FVector& Offset);
	void SetCharacterDir(enum class EKSCharacterDir Dir);
	void SetCharacterActionLabel(class FName CharaActionLabel);
	void PlayCurrentAnimation();
	void PlayAnimation(enum class EKSCharacterAction EAction);
	bool IsFlipbookVisibile();
	class UMaterialInstanceDynamic* GetCurrentFlipbookMaterial();
	class UMaterialInstanceDynamic* GetCachedFlipbookMaterial(class FName FlipbookName);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CharacterGrowTableUtility
class UCharacterGrowTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UCharacterGrowTableUtility* GetDefaultObj();

	int32 GetTotalExpFromLevel(int32 Level);
	bool GetCharacterGrowTableRowDataByLevel(enum class EBPFuncReturnCode* ReturnCode, struct FCharacterGrowData* OutData, int32 Level, bool LogEnable);
	bool GetCharacterGrowTableRowData(enum class EBPFuncReturnCode* ReturnCode, struct FCharacterGrowData* OutData, class FName TargetLabel, bool LogEnable);
	int32 CalcLevelFromTotalExp(int32 Exp);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CharacterParamUtility
class UCharacterParamUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterParamUtility* GetDefaultObj();

	struct FCharacterParam Sub_CharacterParam_CharacterParam(const struct FCharacterParam& A, const struct FCharacterParam& B);
	void SetCharacterParamProperty(struct FCharacterParam& CharaParam, enum class ECHARACTER_PARAM_TYPE ParamType, int32 Value);
	struct FCharacterParam Multiply_CharacterParam_RevisionParam(const struct FCharacterParam& Base, const struct FCharacterParam& Revision);
	struct FCharacterParam Multiply_CharacterParam_Float_ExceptMinus(const struct FCharacterParam& Base, float Revision);
	struct FCharacterParam Multiply_CharacterParam_Float(const struct FCharacterParam& Base, float Revision);
	void MinusParamFromBool(const struct FCharacterParam& Base, TArray<bool>* RetList);
	struct FCharacterParam InversionMinusParameter(const struct FCharacterParam& Base);
	int32 GetCharacterParamProperty(struct FCharacterParam& CharaParam, enum class ECHARACTER_PARAM_TYPE ParamType);
	void Debug_OutputCharacterParam(struct FCharacterParam& Val);
	class FString Debug_MakeCharacterParamString(struct FCharacterParam& Val);
	struct FCharacterParam Add_CharacterParam_CharacterParam(const struct FCharacterParam& A, const struct FCharacterParam& B);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CharacterResource_BattleReductionDataUtility
class UCharacterResource_BattleReductionDataUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UCharacterResource_BattleReductionDataUtility* GetDefaultObj();

	bool GetCharRes_BattleReductionRowData(struct FCharResource_BattleReductionTable* OutData, class FName TargetLabel, bool EnableLog);
	bool GetCharRes_BattleReductionLabelNames(TArray<class FName>* OutData);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CharacterResourceDataUtility
class UCharacterResourceDataUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UCharacterResourceDataUtility* GetDefaultObj();

	bool GetCharacterResourceRowData(struct FCharacterResourceData* OutData, class FName TargetLabel, bool EnableLog);
	bool GetCharacterResourceLabelNames(TArray<class FName>* OutData);
};

// 0x90 (0x2C0 - 0x230)
// Class Majesty.CharacterResourceManager
class ACharacterResourceManager : public AAcqManagerBase
{
public:
	TArray<class ULoadCharaAssetQueue*>          M_LoadQueue;                                       // 0x230(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10B2[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, struct FLoadedObject>      M_LoadedFlipbookResource;                          // 0x260(0x50)(NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       M_SubPartyMemberResource;                          // 0x2B0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ACharacterResourceManager* GetDefaultObj();

	void RequestUnLoadCharactersAsset(const TArray<class FName>& CharaResourceIds);
	bool RequestLoadSubPartyCharactersAsset();
	bool RequestLoadCharactersAsset(const TArray<class FName>& CharaResourceIds);
	bool RequestLoadCharactersActionAsset(TArray<struct FSimpleActionLoad>& CharaResourceIds);
	bool RequestLoadCharacterAssetSync_SelectAction(class FName CharaResLabel, FDelegateProperty_ LoadedCallback, const TArray<enum class EKSCharacterAction>& ActionLabels);
	bool RequestLoadCharacterAssetSync(class FName CharaResLabel, FDelegateProperty_ LoadedCallback);
	bool RequestLoadCharacterAsset(class FName CharaResLabel, FDelegateProperty_ LoadedCallback, const TArray<enum class EKSCharacterAction>& ActionLabels, bool bBattle);
	bool RefreshLoadCharacters(const TArray<class FName>& NewCharactersResourceId);
	void OnLoadedSubPartyResource(TArray<class UObject*>* LoadedResource);
	void OnLoadedMainPartyResource(TArray<class UObject*>* LoadedResource);
	bool IsLoading();
	void Debug_SetAlwaysEnableTick(bool Enable);
	bool Debug_LoadCharacterAssetSync(const TArray<class FName>& CharacterResourceIds);
	void Debug_GetDebugInfo(class FString* OutDebugInfo);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CharacterResourceUtility
class UCharacterResourceUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterResourceUtility* GetDefaultObj();

	void GetNPCResourceLabelFromLevelName(TArray<class FName>* OutData, class FName LevelName);
	void GetCurrentSubPartyResourceLabel(TArray<class FName>* OutData, class UObject* WorldContextObject);
	void GetCurrentPartyResourceLabel(TArray<class FName>* OutData, class UObject* WorldContextObject);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CharactersActionTableUtility
class UCharactersActionTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UCharactersActionTableUtility* GetDefaultObj();

	bool GetCharactersActionRowData(struct FCharacterActionResource* OutData, class FName TargetLabel, bool EnableLog);
	bool GetCharactersActionLabels(TArray<class FName>* LabelList);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CharacterSaveDataUtil
class UCharacterSaveDataUtil : public USaveDataUtilBase
{
public:

	static class UClass* StaticClass();
	static class UCharacterSaveDataUtil* GetDefaultObj();

	bool UpdateFollowNpcSupportLimit(enum class EMJFieldCommandType FieldCommandType, int32 SupportLimit);
	void SubPlayerMoney(int32 SubMoney);
	void SetTameMonsterMode(enum class ETameMonsterMode Mode);
	void SetTameMonsterData(int32 Index, const struct FTameMonsterData& NewTameMonster);
	void SetPlayerMoney(int32 Money);
	void SetMyShipCustomFirstChoice(enum class EMYSHIP_CUSTOM_PART Part, enum class EMYSHIP_CUSTOM_TYPE Type);
	void SetMyShipCustom(enum class EMYSHIP_CUSTOM_PART Part, enum class EMYSHIP_CUSTOM_TYPE Type);
	void SetLegendMonsterData(int32 Index, const struct FTameMonsterData& NewLegendMonster);
	void SetHunterPartner(enum class EHUNTER_PARTNER_ID PartnerID);
	bool SetFollowWaitingNpc(int32 NPCID, int32 SupportLimitCount, enum class EMJFieldCommandType FieldCommandType, enum class EPlayableCharacterID CharaID);
	bool SetFollowNpc(int32 NPCID, int32 SupportLimitCount, enum class EMJFieldCommandType FieldCommandType, enum class EPlayableCharacterID CharaID);
	void SetFirstEquipment(enum class EPlayableCharacterID PlayerCharaId);
	void SetCharacterRawMP(int32 PlayerCharaId, int32 MP);
	void SetCharacterRawHP(int32 PlayerCharaId, int32 HP);
	void SetCharacterLevelAndExp(int32 PlayerCharaId, int32 Level, int32 Exp);
	void SetCharacterJobPoint(int32 PlayerCharaId, int32 JP);
	void SetCharacterData(int32 CharacterIndex, struct FSavePlayerCharacterData& CharacterData);
	void SetBackpackItemList(TArray<struct FSaveBackPackItem>& ItemList);
	void SetAdvancedAbility(int32 CharacterID, int32 AbilityIndex, bool IsLearn);
	void SetAbility(int32 CharacterID, int32 JobID, int32 AbilityIndex, bool IsLearn);
	void MergePlayerMoney(int32 ReminiMoney);
	bool IsLearnAdvancedAbility(int32 CharacterID, int32 AbilityIndex);
	int32 GetTameMonsterNum();
	enum class ETameMonsterMode GetTameMonsterMode();
	int32 GetSecondJobID_FromSaveCharacterData(int32 CharacterID);
	int32 GetRawPOT_FromSaveCharacterData(int32 CharacterID);
	int32 GetRawMP_FromSaveCharacterData(int32 CharacterID);
	int32 GetRawHP_FromSaveCharacterData(int32 CharacterID);
	int32 GetPriorityJobID_FromSaveCharacterData(int32 CharacterID);
	int32 GetPlayerMoney();
	enum class EMYSHIP_CUSTOM_TYPE GetMyShipCustomFirstChoice(enum class EMYSHIP_CUSTOM_PART Part);
	enum class EMYSHIP_CUSTOM_TYPE GetMyShipCustom(enum class EMYSHIP_CUSTOM_PART Part);
	int32 GetLevel_FromSaveCharacterData(int32 CharacterID);
	int32 GetLegendMonsterNum();
	int32 GetJobPoint_FromSaveCharacterData(int32 CharacterID);
	enum class EHUNTER_PARTNER_ID GetHunterPartner();
	void GetFollowWaitingNpcUniqueId(TArray<int32>* OutUniqId);
	bool GetFollowWaitingNPCDataByType(int32* NPCID, int32* SupportLimit, enum class EMJFieldCommandType FieldCommandType);
	bool GetFollowWaitingNpcByFieldCommandType(enum class EMJFieldCommandType FieldCommandType, struct FSaveFollowNpcData* Output);
	void GetFollowNpcUniqueId(TArray<int32>* OutUniqId);
	bool GetFollowNPCDataByType(int32* NPCID, int32* SupportLimit, enum class EMJFieldCommandType FieldCommandType);
	bool GetFollowNpcByNpcUniqueId(int32 NPCID, struct FSaveFollowNpcData* Output);
	bool GetFollowNpcByFieldCommandType(enum class EMJFieldCommandType FieldCommandType, struct FSaveFollowNpcData* Output);
	bool GetFollowNpcByCharacterIdAndFieldCommandType(enum class EPlayableCharacterID CharaID, enum class EMJFieldCommandType Type, struct FSaveFollowNpcData* Output);
	bool GetFollowNpcByCharacterID(enum class EPlayableCharacterID CharaID, struct FSaveFollowNpcData* Output);
	void GetFollowNpcAndWaitingNpcUniqueId(TArray<int32>* OutUniqId);
	TArray<struct FSaveFollowNpcData> GetFollowNpc();
	int32 GetFirstJobID_FromSaveCharacterData(int32 CharacterID);
	int32 GetExp_FromSaveCharacterData(int32 CharacterID);
	TArray<int32> GetEquipSupportSkill_FromSaveCharacterData(int32 CharacterID);
	struct FSaveEquipmentDataID GetEquipment_FromSaveCharacterData(int32 CharacterID);
	int32 GetCharacterID_FromSaveCharacterData(int32 CharacterID);
	bool GetCharacterFixedEquipment(int32 CharacterID, enum class EEQUIPMENT_PART Part);
	class FName GetCharacterEquipmentPartLabel(int32 CharacterID, enum class EEQUIPMENT_PART Part);
	TArray<class FName> GetCharacterEquipmentLabels(int32 CharacterID);
	struct FSaveEquipmentData GetCharacterEquipmentLabel(int32 CharacterID);
	struct FSavePlayerCharacterData GetCharacterData(int32 CharacterID);
	bool FindCharacterFromPlayerMember(int32 CharacterID, int32* FoundIndex, struct FSavePlayerCharacterData* FoundCharacter, enum class EBPFuncReturnCode* ReturnCode);
	bool DeleteTameMonsterInvadeID(int32 TargetInvadeID);
	bool DeleteTameMonster(int32 Index);
	bool DeleteLegendMonster(int32 Index);
	bool DeleteFollowWaitingNpc(enum class EMJFieldCommandType FieldCommandType);
	bool DeleteFollowNpcByCharacterID(enum class EPlayableCharacterID CharaID);
	bool DeleteFollowNpc(enum class EMJFieldCommandType FieldCommandType);
	void Debug_SetAllAbility(int32 CharacterID, bool FullOpen);
	bool CheckCharacterAlive_SpecialActionType(int32 SpecialActionType);
	bool CanShowHunterPartnerInParty();
	bool AddTameMonster(const struct FTameMonsterData& TameMonster);
	void AddPlayerMoney(int32 AddMoney);
	bool AddLegendMonster(const struct FTameMonsterData& LegendMonster);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CharactersFlipbookUtility
class UCharactersFlipbookUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UCharactersFlipbookUtility* GetDefaultObj();

	bool IsIdleAction(enum class EKSCharacterAction Action);
	bool GetThiefMissionFlipbookToSaveLoad(class FName* OutLabel, class UObject* WorldContextObject, int32 CharaID, int32 JobID, int32 Form, enum class EPLAYER_JOB_FB_TYPE Type);
	bool GetMissionFlipbookLabelToSaveLoad(class FName* OutLabel, class UObject* WorldContextObject, int32 CharaID, int32 Form, int32 JobID);
	bool GetMissionFlipbookLabelToPlayerSelect(class FName* OutLabel, int32 CharaID, enum class EPLAYER_SELECT_FB_TYPE SelectType, enum class EPLAYER_SELECT_FB_PATTERN Pattern);
	bool GetMissionFlipbookLabelToJob(class FName* OutLabel, class UObject* WorldContextObject, int32 CharaID, int32 JobID, enum class EPLAYER_JOB_FB_TYPE Type, bool CheckTou);
	bool GetMissionCustomFlipbookRowData(struct FKSUIFlipbookData* OutData, class FName TargetLabel, bool EnableLog);
	bool GetMissionCustomFlipbookNames(TArray<class FName>* OutNames);
	bool GetMissionCustomFlipbookListRowDataFromCharaID(struct FCustomMissionFlipbookList* OutData, int32 CharaID);
	bool GetMissionCustomFlipbookListRowData(struct FCustomMissionFlipbookList* OutData, class FName TargetLabel);
	bool GetCustomFlipbookRowData(struct FKSFlipbookData* OutData, class FName TargetLabel, bool EnableLog);
	bool GetCharactersFlipbookRowData(struct FKSCharaFlipbook* OutData, class FName TargetLabel, bool EnableLog);
	bool GetActionSocket(class FName TargetCharaLabel, enum class EKSCharacterAction EAction, enum class EKSCharacterDir EDir, TMap<class FName, struct FMJSpriteSocketData>* OutSocketData, bool* OutIsReverse);
	bool GetActionFlipbookName(class UPaperFlipbookComponent* FbComp, class FName CharaActionLabel, enum class EKSCharacterAction EAction, enum class EKSCharacterDir EDir, class FName* OutFlipbookName, bool* OutIsReverse);
};

// 0x108 (0x368 - 0x260)
// Class Majesty.CharactersGridPanelBase
class UCharactersGridPanelBase : public UUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnOpenedCallback;                                  // 0x260(0x10)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnClosedCallback;                                  // 0x270(0x10)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSelectedCharacter;                               // 0x280(0x10)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class ECHARACTER_GRID_PANEL_WIDGET_STATE M_WidgetState;                                     // 0x290(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_110C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FIntPoint                             M_CursorPosition;                                  // 0x294(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                             M_GridSize;                                        // 0x29C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_110D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UPartyCharacterPanelBase*>      M_PartyCharacterPanelRefs;                         // 0x2A8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UPartyCharPanelSelectBackBase*> M_PartyCharacterPanelSelectBackRefs;               // 0x2B8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FIntPoint, class UPartyCharacterPanelBase*> M_PartyCharacterPanelPositions;                    // 0x2C8(0x50)(BlueprintVisible, ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FIntPoint, class UPartyCharPanelSelectBackBase*> M_PartyCharacterPanelSelectBackPositions;          // 0x318(0x50)(BlueprintVisible, ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCharactersGridPanelBase* GetDefaultObj();

	void SetWidgetState(enum class ECHARACTER_GRID_PANEL_WIDGET_STATE NewState);
	void SetTitleText(class FName& TextLabel);
	void SetMember(TArray<struct FCharacterGridPanelParam>& NewMember);
	void SetCursorPosition(struct FIntPoint& NewPos);
	void Open();
	void MoveCursor(struct FIntPoint& Delta);
	TArray<class UPartyCharPanelSelectBackBase*> GetPartyCharacterPanelSelectBackRefs();
	TArray<class UPartyCharacterPanelBase*> GetPartyCharacterPanelRefs();
	bool GetPartyCharacterPanelByPos(struct FIntPoint& Pos, class UPartyCharacterPanelBase** OutPanel, class UPartyCharPanelSelectBackBase** OutSelectBack);
	struct FIntPoint GetCursorPosition();
	void Decide();
	void Close();
	void BroadcastOnSelectedCharacter(enum class EPlayableCharacterID PlayerID);
	void BroadcastOnOpenedDelegate();
	void BroadcastOnClosedDelegate();
};

// 0x10 (0x140 - 0x130)
// Class Majesty.CircularDayNightParentWidgetBase
class UCircularDayNightParentWidgetBase : public UCanvasPanel
{
public:
	class UWidget*                               ChildWidget;                                       // 0x130(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsChildKeepHorizontal;                             // 0x138(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1110[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RotationAngle;                                     // 0x13C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCircularDayNightParentWidgetBase* GetDefaultObj();

	void SetRotationAngle(float NewRotationAngle);
};

// 0xD0 (0x428 - 0x358)
// Class Majesty.CommonDialog
class UCommonDialog : public UKSUserWidgetBase
{
public:
	struct FMJUICommonDialogParam                CurrentParam;                                      // 0x358(0xC8)(BlueprintVisible, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        ButtonIndex;                                       // 0x420(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_111A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCommonDialog* GetDefaultObj();

	bool SettingSelectSE(TArray<class FName>& SelectSE);
	void SelectButton(int32 buttonIdx);
	bool OpenPlayerMoney();
	bool OpenDialog(struct FMJUICommonDialogParam& Param);
	void OnSelectCallback();
	void ExecCloseFinishCallback();
	bool ClosePlayerMoney();
	bool CloseDialog();
	bool ButtonVisible(bool Visible);
};

// 0x0 (0x358 - 0x358)
// Class Majesty.CommonNotificationBase
class UCommonNotificationBase : public UKSUserWidgetBase
{
public:

	static class UClass* StaticClass();
	static class UCommonNotificationBase* GetDefaultObj();

};

// 0x0 (0x858 - 0x858)
// Class Majesty.CustomListView
class UCustomListView : public UListView
{
public:

	static class UClass* StaticClass();
	static class UCustomListView* GetDefaultObj();

	class UUserWidget* GetSelectItemWidget(class UObject* Item);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.CustomSpriteDataTableUtility
class UCustomSpriteDataTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UCustomSpriteDataTableUtility* GetDefaultObj();

	bool GetMissionCustomSpriteRowData(enum class EBPFuncReturnCode* ReturnCode, struct FKSSpriteData* OutData, class FName TargetLabel, bool LogEnable);
	bool GetCustomSpriteRowData(enum class EBPFuncReturnCode* ReturnCode, struct FKSSpriteData* OutData, class FName TargetLabel, bool LogEnable);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.DarkAreaDataUtility
class UDarkAreaDataUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UDarkAreaDataUtility* GetDefaultObj();

	void SetIsDarkendDarkArea(class FName& DarkAreaLabel, bool IsDarkend);
	void SetIsDarkendAllDarkArea(bool IsDarkend);
	bool IsLevelDarkend(class FName& LevelLabel);
	bool IsLevelBelongDarkArea(class FName& LevelLabel);
	bool IsDarkendDarkAreaLabel(class FName& DarkAreaLabel);
	bool IsDarkendAnyDarkArea();
	bool IsAllowLostWayLevel(class FName& LevelLabel);
	bool GetDarkendWorldMapLabels(TArray<class FName>* OutWorldMapLabel);
	bool GetDarkendLevelLabels(TArray<class FName>* OutLevelLabel);
	bool GetDarkendDarkAreaLabels(TArray<class FName>* OutDarkAreaLabel);
	bool GetDarkAreaLabelByLevel(enum class EBPFuncReturnCode* ReturnCode, class FName& LevelLabel, class FName* OutDarkAreaLabel);
	bool GetDarkAreaByLevel(enum class EBPFuncReturnCode* ReturnCode, class FName& LevelLabel, struct FDarkAreaData* OutDarkArea);
	void GetAllDarkAreaLabels(TArray<class FName>* OutDarkAreaLabel);
};

// 0x78 (0x720 - 0x6A8)
// Class Majesty.DarkAreaParticleComponent
class UDarkAreaParticleComponent : public UParticleSystemComponent
{
public:
	struct FVector                               M_BaseLocation;                                    // 0x6A8(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               M_LocationOffset;                                  // 0x6B4(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                              M_RotationOffset;                                  // 0x6C0(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                               M_ScaleOffset;                                     // 0x6CC(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FWorldMapDarkAreaEffectParam          M_DarkAreaEffectParam;                             // 0x6D8(0x40)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_114A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDarkAreaParticleComponent* GetDefaultObj();

	void SetTransformOffset(struct FVector& LocationOffset, struct FRotator& RotationOffset, struct FVector& ScaleOffset);
	void SetEnableEffect(bool Enable);
	void SetDarkAreaEffectParam(struct FWorldMapDarkAreaEffectParam& NewParam);
	void SetBaseLocation(struct FVector& baseLocation);
	class FName GetWorldMapLabel();
	class FName GetDarkAreaLabel();
	struct FWorldMapDarkAreaEffectParam GetDarkAreaEffectParam();
	void ApplyTransform();
};

// 0x1F8 (0x428 - 0x230)
// Class Majesty.DatabaseManager
class ADatabaseManager : public AAcqManagerBase
{
public:
	class UDataTable*                            M_DatabaseInfo;                                    // 0x230(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1151[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UScriptStruct*, class FName>      M_StructToName;                                    // 0x288(0x50)(NativeAccessSpecifierPrivate)
	TMap<class FName, class UDataTable*>         M_DatabaseTable;                                   // 0x2D8(0x50)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FRowNameIdSet>      M_RowNameIdSet;                                    // 0x328(0x50)(NativeAccessSpecifierPrivate)
	TMap<class FName, class FString>             M_AsyncLoading;                                    // 0x378(0x50)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_1152[0x60];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADatabaseManager* GetDefaultObj();

	void Static_Unload(class FName DbName);
	bool Static_LoadSyncSingle(class FName DbName);
	bool Static_LoadSyncByTiming(enum class EDB_LOAD_TIMING LoadTiming);
	bool Static_LoadAsyncSingle(class FName DbName);
	bool Static_LoadAsyncByTiming(enum class EDB_LOAD_TIMING LoadTiming);
	bool Static_IsLoading(class FName DbName);
	bool Static_IsLoaded(class FName DbName);
	bool Static_IsAnythingLoading();
	bool Static_GetRowNames(TArray<class FName>* OutRowNames, class FName DbName);
	class FName Static_GetRowName(class FName DbName, int32 RowId);
	int32 Static_GetRowID(class FName DbName, class FName RowName);
	class UDataTable* Static_GetDBPtr(class FName DbName);
	bool SetDbInfoTable(TSoftObjectPtr<class UDataTable> DbInfo);
	void OnLoaded(TArray<class UObject*>& ObjList);
	void Debug_ShowDBInfo(bool bEnable);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.DatabaseMisc
class UDatabaseMisc : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDatabaseMisc* GetDefaultObj();

	void SetDatabaseNoticeDelegate();
};

// 0xA0 (0x2C0 - 0x220)
// Class Majesty.DBAccessManager
class ADBAccessManager : public AActor
{
public:
	TMap<class FName, class FName>               M_SupporterLabelToNpcLableTable;                   // 0x220(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class FName>               M_EnemyLabelToNpcLableTable;                       // 0x270(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ADBAccessManager* GetDefaultObj();

	bool SearchAbilitySetFromRestricWeapon(class FName& WeaponLabel, class FName* AbilitySetLabel);
	bool PrepareDBAccess(int32 Index);
	class FText MakeItemDetailText(struct FItemData& ItemData, int32 CharacterID);
	bool GetNpcLabelBySupporterLabel(class FName* OutLabel, class FName SupporterLabel);
	bool GetNpcLabelByEnemyLabel(class FName* OutLabel, class FName EnemyLabel);
	bool GetNpcDataBySupporterLabel(struct FNPCData* OutData, class FName SupporterLabel);
	bool GetNpcDataByEnemyLabel(struct FNPCData* OutData, class FName EnemyLabel);
	void GetMenuJobLabelList(TArray<class FName>* OutJobList);
	void GetMenuJobIDList(TArray<int32>* OutIDList);
	bool GetItemDataForMenu(class FName& ItemLabel, struct FItemDataForMenu* Value);
	class ADBAccessManager* GetInstance();
	bool ConvertUniqueIDToLabel(int32 NPCUniqID, class FName* NPCLabel);
	bool ConvertSupportAbilityIdToLabel(int32 SuportAbilityId, class FName* SuportAbilityLabel);
	bool ConvertLabelToAbilitySetID(class FName AbilitySetLabel, int32* AbilitySetID);
};

// 0x18 (0xC8 - 0xB0)
// Class Majesty.DebugBattleCharaComponent
class UDebugBattleCharaComponent : public UActorComponent
{
public:
	uint8                                        Pad_1164[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDebugBattleCharaComponent* GetDefaultObj();

	void SetMasterParameter(enum class ECHARACTER_PARAM_TYPE EType, int32 NValue);
	void SetDebugSwitch(enum class EBATTLE_DEBUG_SWITCH EType, bool bValue);
	void SetCurrentMP(int32 NValue);
	void SetCurrentHP(int32 NValue);
	int32 GetTotalParameter(enum class ECHARACTER_PARAM_TYPE EType);
	int32 GetMasterParameter(enum class ECHARACTER_PARAM_TYPE EType);
	int32 GetCurrentShield();
	bool GetCurrentPOT(int32* OutActionPoint, int32* OutActionPointMax);
	int32 GetCurrentMP();
	int32 GetCurrentHP();
	int32 GetCurrentBP();
	void GetCharacterName(class FText* StrCharacterName);
	TArray<struct FItemData> GetCharacterEquipmentList();
	class AKSCharacterBase* GetAnimationCharacter();
	bool CheckDebugSwitch(enum class EBATTLE_DEBUG_SWITCH EType);
};

// 0x28 (0xD8 - 0xB0)
// Class Majesty.DebugBattleLogComponent
class UDebugBattleLogComponent : public UActorComponent
{
public:
	uint8                                        Pad_1166[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDebugBattleLogComponent* GetDefaultObj();

	int32 GetBattleLogListNumMax();
	TArray<struct FDebugBattleLog> GetBattleLogList();
	bool GetBattleLogDirty();
	int32 GetBattleLogCount();
	void ClearBattleLogDirty();
};

// 0xC8 (0x178 - 0xB0)
// Class Majesty.DebugBattleManagerComponent
class UDebugBattleManagerComponent : public UActorComponent
{
public:
	uint8                                        Pad_116D[0xC8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDebugBattleManagerComponent* GetDefaultObj();

	void SetFixedWonderAbility(class FName StrAbilityName);
	void SetDebugSwitch(enum class EBATTLE_DEBUG_SWITCH EType, bool bValue);
	void SetDebugParameter(enum class EBATTLE_DEBUG_SWITCH EType, int32 NValue);
	bool SetConvertPlayerIDList(bool bEnable, TMap<int32, class FName>& AcConvertPlayerIDList);
	bool IsEnableConvertPlayerID();
	class FName GetFixedWonderAbility();
	int32 GetDebugParameter(enum class EBATTLE_DEBUG_SWITCH EType);
	class FName ConvertPlayerIDForBattleEventDebug(int32 NPlayerID);
	bool CheckDebugSwitch(enum class EBATTLE_DEBUG_SWITCH EType);
};

// 0x10 (0xC0 - 0xB0)
// Class Majesty.DebugCanvasComponent
class UDebugCanvasComponent : public UActorComponent
{
public:
	bool                                         AutoArrangement;                                   // 0xB0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1172[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AutoID;                                            // 0xB4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             StartPos;                                          // 0xB8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDebugCanvasComponent* GetDefaultObj();

	void SetVisible(bool bVisible);
	void SetAutoArrangement(bool Enable, const struct FVector2D& Pos);
	void RemoveTextWithID(int32 ID);
	void RemoveText();
	void RemovePrimitiveWithID(int32 ID);
	void RemovePrimitive();
	void RemoveAllText();
	void RemoveAllPrimitive();
	bool IsVisible();
	void AddTextWithID(int32 ID, struct FDebugTextData& TextData);
	void AddText(struct FDebugTextData& TextData);
	void AddRowPartText(class FText Text, const struct FLinearColor& Color);
	void AddPrimitiveWithID(int32 ID, struct FDebugPrimitiveData& PrimData);
	void AddPrimitive(struct FDebugPrimitiveData& PrimData);
};

// 0xF8 (0x1A8 - 0xB0)
// Class Majesty.DebugListMenuComponent
class UDebugListMenuComponent : public UActorComponent
{
public:
	uint8                                        Pad_1178[0xF8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDebugListMenuComponent* GetDefaultObj();

	void SetDelegateOnDecided(FDelegateProperty_ OnDecided);
	void SetDelegateOnClosed(FDelegateProperty_ OnClosed);
	void OpenMenu();
	bool IsRunning();
	void InitMenu(int32 FilterColNum, int32 ItemColNum);
	void CloseMenu();
	void ClearDelegateOnDecided();
	void AddItemDataArray(TArray<struct FDebugListMenuItem>& Data);
	void AddItemData(struct FDebugListMenuItem& Data);
	void AddFilterDataArray(TArray<struct FDebugListMenuFilter>& Data);
	void AddFilterData(struct FDebugListMenuFilter& Data);
	void AddFilter(int32 Index, class FText* Text, bool bChecked);
};

// 0x48 (0x268 - 0x220)
// Class Majesty.DebugLoadCheatCommand
class ADebugLoadCheatCommand : public AActor
{
public:
	uint8                                        Pad_117D[0x48];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADebugLoadCheatCommand* GetDefaultObj();

};

// 0x0 (0x2C0 - 0x2C0)
// Class Majesty.DebugMenuParamPanelWidgetBase
class UDebugMenuParamPanelWidgetBase : public UAcqUserWidget
{
public:

	static class UClass* StaticClass();
	static class UDebugMenuParamPanelWidgetBase* GetDefaultObj();

};

// 0x0 (0x2C0 - 0x2C0)
// Class Majesty.DebugMenuParamWidgetBase
class UDebugMenuParamWidgetBase : public UAcqUserWidget
{
public:

	static class UClass* StaticClass();
	static class UDebugMenuParamWidgetBase* GetDefaultObj();

	void SetInformationValue(class FText& InText);
	void OnTickFunc(struct FDebugParam& Param);
};

// 0x178 (0x228 - 0xB0)
// Class Majesty.DebugMenuSupportBase
class UDebugMenuSupportBase : public UActorComponent
{
public:
	uint8                                        Pad_11B7[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  RootMenuName;                                      // 0xC0(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FDebugParam>                   DebugParamList;                                    // 0xD8(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDebugParam                           CCurrentParamData;                                 // 0xE8(0x130)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         IsSubMenuActive;                                   // 0x218(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_nCurrentHierarchy;                               // 0x21C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nMaxHierarchy;                                   // 0x220(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        M_nParentHierarchy;                                // 0x224(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDebugMenuSupportBase* GetDefaultObj();

	void OnPreInitWidgetFunc(struct FDebugParam& Param);
	void OnDecideFunc(struct FDebugParam& Param);
	void OnChangeFunc(struct FDebugParam& Param);
	void Initialize();
	TArray<struct FDebugParam> GetSubMenuParam(int32 Index);
	TArray<struct FDebugParam> GetDebugSubMenuList(struct FDebugParam& baseManuItem);
	TArray<struct FDebugParam> GetDebugParamFromHierarchy(int32 NHierarcy);
	void DebugPrintScreenMessage(const class FString& Str, const struct FColor& Col);
	void CreateMenu_Implementation();
	void CreateMenu();
	void CloseMenu_Implementation();
	int32 BackParentHierarchy();
	void AddToggleVal_Change(const class FString& MenuName, bool Enable, FDelegateProperty_ OnChangeFunc, FDelegateProperty_ OnDecideFunc);
	void AddToggleVal(const class FString& MenuName, bool Enable, FDelegateProperty_ OnDecideFunc);
	void AddSubMenuEnd();
	void AddSubMenuBegin(const class FString& MenuName, FDelegateProperty_ OnDecideFunc);
	void AddListVal_Change_PreInitWidget(const class FString& MenuName, const TArray<class FText>& StrList, int32 StartIndex, FDelegateProperty_ OnChangeFunc, FDelegateProperty_ OnDecideFunc, FDelegateProperty_ OnPreInitWidgetFunc);
	void AddListVal_Change(const class FString& MenuName, const TArray<class FText>& StrList, int32 StartIndex, FDelegateProperty_ OnChangeFunc, FDelegateProperty_ OnDecideFunc);
	void AddListVal(const class FString& MenuName, const TArray<class FText>& StrList, int32 StartIndex, FDelegateProperty_ OnDecideFunc);
	void AddIntVal_Change(const class FString& MenuName, int32 DefaultValue, int32 IntMin, int32 IntMax, FDelegateProperty_ OnChangeFunc, FDelegateProperty_ OnDecideFunc);
	void AddIntVal(const class FString& MenuName, int32 DefaultValue, int32 IntMin, int32 IntMax, FDelegateProperty_ OnDecideFunc);
	void AddInfomationWithCallback(const class FString& MenuName, const class FString& InformationStr, FDelegateProperty_ OnTickFunc, enum class EDEBUG_INFORMATION_COLOR_TYPE ColorType);
	void AddInfomation(const class FString& MenuName, const class FString& InfomationStr, enum class EDEBUG_INFORMATION_COLOR_TYPE ColorType);
	void AddFloatVal_Change(const class FString& MenuName, float DefaultValue, float FloatMin, float FloatMax, FDelegateProperty_ OnChangeFunc, FDelegateProperty_ OnDecideFunc);
	void AddFloatVal(const class FString& MenuName, float DefaultValue, float FloatMin, float FloatMax, FDelegateProperty_ OnDecideFunc);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.DebugParamFunction
class UDebugParamFunction : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDebugParamFunction* GetDefaultObj();

	void SetDebugFlag(enum class EDEBUG_FLAG EFlag, bool Enable);
	void SetAutoTalkTimer(float FAutoTimer);
	bool GetDebugFlag(enum class EDEBUG_FLAG EFlag);
	float GetAutoTalkTimer();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.DebugSaveDataUti
class UDebugSaveDataUti : public USaveDataUtilBase
{
public:

	static class UClass* StaticClass();
	static class UDebugSaveDataUti* GetDefaultObj();

	void Debug_ActivateAllEventFlagsWithoutSaveBanFlag();
};

// 0x10 (0x38 - 0x28)
// Class Majesty.ServiceConnecter
class UServiceConnecter : public UObject
{
public:
	FDelegateProperty_                           OnUnLockedAchievement;                             // 0x28(0x10)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UServiceConnecter* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Majesty.DebugServiceConnecter
class UDebugServiceConnecter : public UServiceConnecter
{
public:
	uint8                                        Pad_11E8[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDebugServiceConnecter* GetDefaultObj();

};

// 0xD8 (0x308 - 0x230)
// Class Majesty.DialogManager
class ADialogManager : public AAcqManagerBase
{
public:
	TArray<class UCommonDialog*>                 DialogList;                                        // 0x230(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMJUICommonDialogParam                RequestParam;                                      // 0x240(0xC8)(BlueprintVisible, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ADialogManager* GetDefaultObj();

	void SetSelectSE(TArray<class FName>& SelectSE);
	bool SetReference();
	void SetButtonVisible(bool Visible);
	class UCommonDialog* OpenRequestDialog(struct FMJUICommonDialogParam& Param);
	void OnDialogCloseFinishCallback();
	bool IsDialogRunning();
	bool Initialize();
	class UCommonDialog* GetTopDialog();
	bool CloseRequestDialog();
};

// 0x8 (0xB8 - 0xB0)
// Class Majesty.DiseaseComponent
class UDiseaseComponent : public UActorComponent
{
public:
	class ABattleCharacterBase*                  M_cOwnerPlayer;                                    // 0xB0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UDiseaseComponent* GetDefaultObj();

};

// 0x0 (0x2C0 - 0x2C0)
// Class Majesty.DiseaseListItem
class UDiseaseListItem : public UAcqUserWidget
{
public:

	static class UClass* StaticClass();
	static class UDiseaseListItem* GetDefaultObj();

	void Setup(struct FDiseaseListItemData& Data);
};

// 0x8 (0x360 - 0x358)
// Class Majesty.DiseaseListWidget
class UDiseaseListWidget : public UKSUserWidgetBase
{
public:
	enum class EDiseaseListState                 M_WidgetState;                                     // 0x358(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11EE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDiseaseListWidget* GetDefaultObj();

	void SortDiseaseList(TArray<struct FDiseaseListItemData>& List);
	void SetWidgetState(enum class EDiseaseListState State);
	enum class EDiseaseListState GetWidgetState();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.EffectDataTableUtility
class UEffectDataTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UEffectDataTableUtility* GetDefaultObj();

	bool GetEffectRowNames(TArray<class FName>* OutRowNames);
	bool GetEffectRowData(enum class EBPFuncReturnCode* ReturnCode, struct FEffectData* OutData, class FName TargetLabel, bool LogEnable);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.EncountDataTableUtility
class UEncountDataTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UEncountDataTableUtility* GetDefaultObj();

	bool GetEncountVolumeRowDataByID(enum class EBPFuncReturnCode* ReturnCode, struct FEncountVolume* OutData, int32 TargetID, bool LogEnable);
	bool GetEncountVolumeRowData(enum class EBPFuncReturnCode* ReturnCode, struct FEncountVolume* OutData, class FName TargetLabel, bool LogEnable);
	bool GetEncountTriggerRowDataByID(enum class EBPFuncReturnCode* ReturnCode, struct FEncountTriggerData* OutData, int32 TargetID, bool LogEnable);
	bool GetEncountTriggerRowData(enum class EBPFuncReturnCode* ReturnCode, struct FEncountTriggerData* OutData, class FName TargetLabel, bool LogEnable);
	bool GetEncountTableRowNames(enum class EBPFuncReturnCode* ReturnCode, TArray<class FName>* OutRowNames, enum class EEncountTableType Type);
	int32 EncountTriggerLabelToId(class FName EncountTriggerLabel);
	class FName EncountTriggerIdToLabel(int32 EncountTriggerId);
};

// 0x70 (0x2A0 - 0x230)
// Class Majesty.EncountManager
class AEncountManager : public AAcqManagerBase
{
public:
	bool                                         M_bIsViewerMode;                                   // 0x230(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_121F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               EncountPosition;                                   // 0x234(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EKSCharacterDir                   EncountDir;                                        // 0x240(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1220[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  TressaSpeialStepLevel;                             // 0x244(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_RequestRestoreEncountVolume;                     // 0x24C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPlayableCharacterID              M_eFixFirstOrderPlayerID;                          // 0x24D(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBATTLE_VIEWER_MODE               Debug_BattleViewerMode;                            // 0x24E(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1221[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Debug_EnemyGroupID;                                // 0x250(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          Debug_EnemyIDList;                                 // 0x258(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                  Debug_PlacementID;                                 // 0x268(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Debug_UseBattleViewerParty;                        // 0x270(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Debug_UseBattleRandomParty;                        // 0x271(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Debug_UseExtraJob;                                 // 0x272(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1222[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Debug_RandomPartyLevel;                            // 0x274(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Debug_RandomPartyLevelRange;                       // 0x278(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Debug_RandomPartyNum;                              // 0x27C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<enum class EPlayableCharacterID>      Debug_BattleViewePartyList;                        // 0x280(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         Debug_UseBattleViewerMap;                          // 0x290(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1223[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Debug_BattleViewerMapID;                           // 0x294(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Debug_IsWaterSide;                                 // 0x29C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Debug_UseFixedSituation;                           // 0x29D(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBATTLE_START_TYPE                Debug_FixedSituation;                              // 0x29E(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBATTLE_ENCOUNT_TYPE              Debug_FixedBattleMode;                             // 0x29F(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AEncountManager* GetDefaultObj();

	bool StartRobBattle(class FName EnemyGroupID, enum class EBATTLE_START_TYPE StartType, bool IsPlayEventAfterBattle, int32 NBattleMapIndex);
	bool StartRevealBattle(class FName EnemyGroupID, bool IsPlayEventAfterBattle, int32 NBattleMapIndex);
	bool StartPreparationBattle(class FName EnemyGroupID, bool IsPlayEventAfterBattle, int32 NBattleMapIndex);
	bool StartInvadeBattle(class FName EnemyGroupID, enum class EBATTLE_START_TYPE StartType, bool IsPlayEventAfterBattle, int32 NBattleMapIndex);
	bool StartEventBattle(class FName EncountVolumeID, bool IsEventBGM, bool SingleBattle, enum class EPlayableCharacterID CharacterID, bool IsNextEvent, enum class EPlayableCharacterID FixFirstOrderPlayer);
	bool StartEightBattle(class FName EnemyGroupID, bool IsPlayEventAfterBattle, int32 NBattleMapIndex, TArray<enum class EPlayableCharacterID>& MainParty, TArray<enum class EPlayableCharacterID>& SubParty);
	bool StartBoutBattle(class FName EnemyGroupID, bool IsPlayEventAfterBattle, int32 NBattleMapIndex, enum class EPlayableCharacterID EBattleCHaraID);
	bool SettingBattleParam();
	bool SetLiquidationSkip(bool SkipLiquidation);
	bool SetForceStopEncountStep(int32 NForceStopEncountStepCount);
	bool SetEncountVolume(const struct FEncountTriggerData& TriggerData);
	bool SetAfterMainMenu();
	bool RestoreEncountVolumeFromSaveData();
	bool RestoreEncount();
	bool ResetTrigger();
	bool ResetEncountVolume();
	bool ResetEncountStep();
	void RequestRestoreEncountVolumeFromSaveData();
	bool RefleshEncountVolume();
	void OnLevelChanged(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& NoticeArgs);
	bool IsChkEncountFlagStartEndData(struct FEncountFlagStartEndData& ChkEncountData);
	bool GetViewerParameter(enum class EBATTLE_VIEWER_MODE* EViewerMode, TArray<class FName>* AstrEnemyIDList, class FName* StrPlacementID);
	bool GetReplaceEncountFlagData(struct FEncountFlagData& ChkData, class FName& EncountTriggerLabel);
	void GetLiquidationSkip(bool* SkipLiquidation);
	enum class EPlayableCharacterID GetFixFirstOrderPlayer();
	void GetEncountType(enum class EBATTLE_ENCOUNT_TYPE* EncountType);
	void GetEncountTriggerID(int32* TriggerID);
	bool GetEncountParameter(class FName* StrEnemyGroupID, bool* bIsEventBGM, enum class EBATTLE_ENCOUNT_TYPE* EEncountType);
	int32 GetEncounterLevel();
	void GetEncountCameraRotation(struct FRotator* EncountSign);
	int32 GetDangerLevel();
	struct FEncountTriggerData GetCurrentEncountTrigger();
	bool GetBattleViewerMode();
	bool GeRareEnemyParameter(struct FRareEnemyParam* CRareCatlinParam, struct FRareEnemyParam* CRareOctlinParam, enum class EAreaID* EArea);
	bool Debug_StartViewerBattle();
	bool Debug_SetFixedSituation(int32 Situation);
	bool Debug_SetFixedEnemyGroupID(class FName GrounpID);
	bool Debug_SetFixedEncount(bool Fixed);
	bool Debug_SetEncountSoon(bool Enable);
	bool Debug_SetEightBattle(int32 PartyLevel, int32 LevelRange, bool bEnableEightBattle);
	bool Debug_SetDisableStepRandom(bool Enable);
	bool Debug_SetBattleViewerSituation(enum class EBATTLE_START_TYPE FixedSituation, bool UseFixedSituation);
	bool Debug_SetBattleViewerParty(TArray<enum class EPlayableCharacterID>& PartyList, bool UseBattleViewerParty);
	bool Debug_SetBattleViewerMode(enum class EBATTLE_VIEWER_MODE ViewerMode);
	bool Debug_SetBattleViewerMap(class FName ViewerMapID, bool IsWaterSide, bool UseBattleViewerMap);
	bool Debug_SetBattleViewerEnemy(class FName EnemyGroupID, TArray<class FName>& EnemyIDList, class FName PlacementID);
	bool Debug_SetBattleRandomParty(int32 PartyLevel, int32 LevelRange, int32 PartyNum, bool UseExtraJob, bool UseRandomParty);
	bool Debug_SetBattleMode(enum class EBATTLE_ENCOUNT_TYPE EBattleMode);
	void Debug_GetFixedEncount(bool* Fixed);
	void Debug_GetEncountSoon(bool* Enable);
	void Debug_GetEncountInfo(class FString* OutDebugInfo);
	void Debug_GetDisableStepRandom(bool* Enable);
	bool Debug_GetBattleRandomParty();
	class FName Debug_GetActiveEncountVolumeLabel();
	bool Debug_CreateRandomPartyData(int32 CharacterID, int32 PartyLevel, bool UseExtraJob);
	void CalcEncounterLevel(int32 LevelId, int32* EncounterLevel, int32* DangerLevel);
	bool BattleStartExec();
	bool BackupEncount();
	bool AddEncountTrigger(class AKSTriggerBase* Trigger);
};

// 0x8 (0x240 - 0x238)
// Class Majesty.EncountTriggerBase
class AEncountTriggerBase : public AMJBoxTrigger
{
public:
	bool                                         bDisableTrigger;                                   // 0x238(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1224[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AEncountTriggerBase* GetDefaultObj();

	void SetEncountVolume();
	class FString Debug_GetDebugInfo_BP();
};

// 0x20 (0x240 - 0x220)
// Class Majesty.EndRollFlowManager
class AEndRollFlowManager : public AActor
{
public:
	enum class EEndRollFlowState                 CurrentState;                                      // 0x220(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1234[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StagingTimer;                                      // 0x224(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1235[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UEndRollSegmentPlayData*>       SegmentList;                                       // 0x230(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AEndRollFlowManager* GetDefaultObj();

	void UpdateStagingTime(float DeltaTime);
	void UpdateSegments();
	void UpdateManager(float DeltaSeconds);
	void StopEndRoll();
	void StartEndroll();
	void SegmentTransitionCallback(class UEndRollSegmentPlayData* Segment);
	void ResetEndRoll();
	void OnStop();
	void OnStart();
	void OnReset();
	void OnBeginPlay();
	bool IsSegmentsCompleted();
	bool IsReadyEndRoll();
	bool IsPlayingEndRoll();
	bool IsDisplayDebugInfo();
	enum class EEndRollSegmentSet GetNextPlaySegmentID();
	void DebugUpdate();
	bool CreateSegmentPlayData();
	void ChangeState(enum class EEndRollFlowState NextState);
	bool ChangeSegmentTransition(enum class EEndRollSegmentState State, class UEndRollSegmentPlayData* Segment);
	void AddSegment(struct FEndRollSegmentData& SegmentData, enum class EEndRollSegmentSet SegSetID, bool IsEnable, float StartEvImageTime, float StartBattleTime, float EndTime, float WipeTime);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.EndRollSaveDataUtil
class UEndRollSaveDataUtil : public USaveDataUtilBase
{
public:

	static class UClass* StaticClass();
	static class UEndRollSaveDataUtil* GetDefaultObj();

	enum class EEndRollSegmentSet GetClearedEndRollSegmentByIndex(int32 Index);
	bool AddClearedMainStory(enum class EEndRollSegmentSet Segment);
};

// 0x38 (0x60 - 0x28)
// Class Majesty.EndRollSegmentPlayData
class UEndRollSegmentPlayData : public UObject
{
public:
	uint8                                        Pad_1242[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEndRollSegmentPlayData* GetDefaultObj();

	enum class EEndRollSegmentSet GetSegmentSetID();
	class FName GetEventImage();
	bool GetBattleRevivalFlag();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.EndRollUtil
class UEndRollUtil : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UEndRollUtil* GetDefaultObj();

	void StopEndRoll(class UObject* WorldContextObject);
	void StartEndroll(class UObject* WorldContextObject);
	void SetupEndRoll();
	void ResetEndRoll(class UObject* WorldContextObject);
	bool IsReadyEndRoll(class UObject* WorldContextObject);
	bool IsPlayingEndRoll(class UObject* WorldContextObject);
	bool GetEndRollManager(class UObject* WorldContextObject, class AEndRollFlowManager** Out);
};

// 0x40 (0xF0 - 0xB0)
// Class Majesty.EnforcerOffsetComponent
class UEnforcerOffsetComponent : public UActorComponent
{
public:
	struct FTransform                            EnforcerOffset;                                    // 0xB0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         M_bIsEnforcerTarget;                               // 0xE0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1248[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEnforcerOffsetComponent* GetDefaultObj();

	void SetEnforcerTarget(bool bEnable);
	void SetEnforcerOffset(const struct FTransform& CTransform);
};

// 0x50 (0x278 - 0x228)
// Class Majesty.EnvSound
class AEnvSound : public AAtomSound
{
public:
	float                                        M_FirstWaitTime;                                   // 0x228(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_124E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundAtomCue*                         M_NightEnvSound;                                   // 0x230(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundAtomCue*                         M_DayTimeEnvSound;                                 // 0x238(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_124F[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AEnvSound* GetDefaultObj();

	void UpdateFade(float DeltaSeconds);
	void StopEnvSound(int32 NFadeOutTime);
	void PlayEnvSound(enum class ETimeZoneType ETimeZoneType, int32 NFadeInTime);
	void PauseSE(bool bPause);
	bool IsFade();
	void Init();
	class UAtomComponent* GetAtomComponent();
	bool ChangeEnvSound(enum class ETimeZoneType ETimeZone);
	void BattleChange_SavePlayingState();
	void BattleChange_RestorePlayingState();
	bool ApplyOptionVolume();
};

// 0x10 (0x230 - 0x220)
// Class Majesty.EnvSoundObjectBase
class AEnvSoundObjectBase : public AActor
{
public:
	class UAtomComponent*                        M_cpAtomComponent;                                 // 0x220(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1251[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AEnvSoundObjectBase* GetDefaultObj();

	void BattleChange_SavePlayingState();
	void BattleChange_RestorePlayingState();
};

// 0x10 (0x368 - 0x358)
// Class Majesty.KSUserWidgetWithState
class UKSUserWidgetWithState : public UKSUserWidgetBase
{
public:
	uint8                                        Pad_1253[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UKSUserWidgetWithState* GetDefaultObj();

	void UpdateState();
	void SetNextState(int32 NextState);
	void OnUpdateState(int32 CurrentState);
	void OnEndState(int32 CurrentState, int32 NextState);
	void OnBeginState(int32 PrevState, int32 CurrentState);
	bool IsClosingState(int32 State);
	void InitState();
	int32 GetPrevState();
	int32 GetNextState();
	int32 GetCurrentState();
};

// 0x0 (0x368 - 0x368)
// Class Majesty.EquipmentMenuWidgetBase
class UEquipmentMenuWidgetBase : public UKSUserWidgetWithState
{
public:

	static class UClass* StaticClass();
	static class UEquipmentMenuWidgetBase* GetDefaultObj();

	bool SetBarMode(bool IsBar);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.EquipmentTextureUtility
class UEquipmentTextureUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UEquipmentTextureUtility* GetDefaultObj();

	class FName GetResourceLabel(struct FEquipmentTextureData& EquipmentTextureData, enum class EWEAPON_STANCE Stance, bool bGetNPC);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.EquipmentTextureTableUtility
class UEquipmentTextureTableUtility : public UDataTableUtilityBase
{
public:

	static class UClass* StaticClass();
	static class UEquipmentTextureTableUtility* GetDefaultObj();

	bool GetEquipmentTextureRowData(enum class EBPFuncReturnCode* ReturnCode, struct FEquipmentTextureData* OutData, class FName TargetLabel, bool LogEnable);
};

// 0x0 (0x28 - 0x28)
// Class Majesty.EvaluateAchievementFunctions
class UEvaluateAchievementFunctions : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UEvaluateAchievementFunctions* GetDefaultObj();

	bool EvaluateVisitLevelCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateSwoonNpcUniqueCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateSubStoryClearCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateSpecifySpecialItemCount_MusicRecord(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateSpecifySpecialItemCount_BattleTestedWeapon(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateSpecifySpecialItemCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateOwnShip(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateOpenEndCard(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateMaxDamage(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateMainStoryRecordReOpen(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateMainStoryClearCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateMainStoryClear(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateLinerShipCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateJoinedPlayerCharacterCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateJobItemCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateInformationFieldCommandSuccessCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateFollowingCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateExtraStoryRecordReOpen(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateEpilogueClear(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateClearExBoss(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateBreakCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateBoostAttackCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateAllAchievement(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateAcquisitonDivineAbilityCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateAcquisitonAdvancedAbilityCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateAcquisitonAbilityCount(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool EvaluateAcquisitonAbility(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
	bool CalculateMainStoryProgress(struct FAchievementData& Achieve, struct FNoticeArgs& NoticeArgs, float* OutProgress);
};

// 0xB0 (0xE8 - 0x38)
// Class Majesty.EventCommandBase
class UEventCommandBase : public ULevelSequenceDirector
{
public:
	class ULevelSequencePlayer*                  M_pTargetMainSequencePlayer;                       // 0x38(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsStopMainSequence;                             // 0x40(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_fPlaybackSubSeqPosition;                         // 0x44(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_fFadeTime;                                       // 0x48(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ULevelSequencePlayer*                  M_pTargetSubSequencePlayer;                        // 0x50(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_bIsStopSubSequence;                              // 0x58(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A2[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, struct FEventEmotion>      EventEmotionList;                                  // 0x70(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_12A3[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEventCommandBase* GetDefaultObj();

	void TitlePauseFunction();
	void SubSequencePlayIndexFunction(int32 NNumLoops, float FSubSeqPlayPosition, int32 NIndex);
	void SubSequencePlayFunction(int32 NNumLoops, float FSubSeqPlayPosition);
	void StopRichEventBgmFunction(float FFadeOutTime);
	void StopEmotionFunction(class FName TagName);
	void StartPlayEmotionFunction(class FName TagName, enum class EEMOTION_TYPE EmotionType, float LifeTime, const struct FVector& Offset);
	void StartCameraSpawnFunction(enum class EKSCameraType CameraType, float FBlend);
	void SpawnCharaFunction(class AKSCharacterBase* EventChara, class FName CharaLabelName, enum class EKSCharacterDir SetDir, class FName AddTagName);
	void ShowDebugInfoTextFunction(const class FString& Text, float Time);
	void SetPlayerPositionFunction(const struct FVector& Position, bool PlaySkip);
	void SetLateFadeParam(enum class ERICHEVENT_CMD Command, float EndTime, const struct FLinearColor& Color);
	void SetHouseModeFunction(bool In, class FName TargetBP, bool DoorOpen);
	void PlayRichEventSeFunction(class FName StrSeLabel);
	void PlayRichEventBgmMapFunction(float FFadeOutTime, float FFadeInTime);
	void PlayRichEventBgmFunction(class FName StrBgmLabel, float FFadeOutTime, float FFadeInTime);
	void PlayRichEventBgmBlockFunction(int32 NBlockId);
	void NarrationPlayFunction(class FName StrNarrationLabel, bool StopMainSequence, float FPlaybackSubSeqPosition);
	void InitSeqData();
	bool GetAllInvokeMode();
	void FinishBattleWipe(enum class ENOTICE_TYPE ENoticeType, struct FNoticeArgs& Args);
	void FadeOutFunction(float EndTime, const struct FLinearColor& Color);
	void FadeInFunction(float EndTime, const struct FLinearColor& Color);
	void End();
	void DetachCharacterFunction(class AKSCharacterBase* EventChara);
	bool CheckActiveMessage();
	void ChangeVolumeEnvFunction(float FVolume, float FFadeTime);
	bool ChangeUpdateCommand(enum class ERICHEVENT_CMD EType);
	void ChangeCameraFunction(enum class EKSCameraType CameraType, float FBlend);
	void ChangeActionFunction(class AKSCharacterBase* EventChara, enum class EKSCharacterAction ActionLabelName, int32 Frame, enum class EKSCharacterAnimationLoop LoopSetting, enum class EKSCharacterDir SetDir);
	void BalloonOpenLabelPlayerFunction(enum class EBalloonType BalloonType, enum class EEventBalloonDir BalloonDir, class FName TalkTargetName, class FName TalkText, float AutoTalkWait, bool StopMainSeq, float PlaybackSubSeqPosition, bool WithoutTail);
	void BalloonOpenLabelFunction(class FName TalkTargetTag, enum class EBalloonType BalloonType, enum class EEventBalloonDir BalloonDir, class FName TalkTargetName, class FName TalkText, float AutoTalkWait, bool StopMainSeq, float PlaybackSubSeqPosition, const struct FVector2D& Offset, bool WithoutTail);
	void BalloonOpenFunction(class FName TalkTargetTag, enum class EBalloonType BalloonType, enum class EEventBalloonDir BalloonDir, class FName TalkTargetName, const class FString& TalkText, float AutoTalkWait, bool StopMainSeq, float PlaybackSubSeqPosition, const struct FVector2D& Offset, bool WithoutTail, const struct FTalkVoice& TalkVoiceData);
	void AttachPlayerFunction(class AKSCharacterBase* EventChara, enum class EKSCharacterDir SetDir, class FName MemoryLabelName);
	void AttachCharacterActionFunction(class AKSCharacterBase* EventChara, enum class EKSCharacterAction ActionLabelName, int32 Frame, enum class EKSCharacterAnimationLoop LoopSetting, enum class EKSCharacterDir SetDir);
};

// 0x0 (0x358 - 0x358)
// Class Majesty.EventFieldCommandBattleBase
class UEventFieldCommandBattleBase : public UKSUserWidgetBase
{
public:

	static class UClass* StaticClass();
	static class UEventFieldCommandBattleBase* GetDefaultObj();

	bool Open(class FName NPCLabel);
};

// 0x18 (0x238 - 0x220)
// Class Majesty.EventFlagObjectBase
class AEventFlagObjectBase : public AActor
{
public:
	TArray<struct FEventFlagData>                M_anEventFlagData;                                 // 0x220(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         PrologueForceHidden;                               // 0x230(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         SwitchVisibilityOnPostTick;                        // 0x231(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_12AA[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AEventFlagObjectBase* GetDefaultObj();

	void SetVisible(bool bEnable);
	bool SetupEventFlagVisible();
	void SetupEnable(int32 NFlagIndex, bool bStatusFlag);
	TArray<struct FEventFlagData> GetEventFlagArray();
};

// 0x0 (0x28 - 0x28)
// Class Majesty.EventFunction
class UEventFunction : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UEventFunction* GetDefaultObj();

	bool SetTheaterEventData(FDelegateProperty_ Delegate);
	void SetNpcTalkDir(class AKSCharacterBase* TargetNpc, int32 ParamDir);
	bool SetJsonData(TArray<class FString>* OutEventData, class UJsonFieldData* JsonData, const class FString& Command, const class FString& EventJsonName);
	bool SetEventData(FDelegateProperty_ Delegate);
	bool PlayEventTheater(class FName EventName, int32 OverrideTimeZone);
	void MakeActiveEventLabelList(TArray<class FName>* OutEventLabelList, struct FPlacementData& PlaceData);
	bool IsEventSkipEnable();
	bool IsEventPlayTheater();
	bool IsEventPlaying();
	bool IsEventBattleDefeatNextEvent();
	bool IsEventActive(int32 StartFlag, int32 EndFlag);
	bool IsActiveByEventFlag(int32 StartFlag, int32 EndFlag);
	int32 GetThiefChokerFlag();
	class FName GetThiefActionLabelPartyChat(int32 PartyChatId, bool bTheater);
	class FName GetThiefActionLabelName(bool Flag);
	class FName GetThiefActionLabelMainStory(int32 StoryTaskID, bool bTheater);
	class FString GetPlayingEventName();
	int32 GetMovieSectionsCount(class UMovieScene* Movie);
	class UMovieSceneEventTriggerSection* GetMovieSectionData(class UMovieScene* Movie, int32 Count);
	class UMovieSceneAtomSection* GetMovieSectionAtomData(class UMovieScene* Movie, int32 Count);
	struct FMovieSceneEvent GetEventTriggerParam(class UMovieSceneEventTriggerSection* Section, int32 Count);
	int32 GetEventTriggerNum(class UMovieSceneEventTriggerSection* Section);
	class AKSCharacterBase* GetEventTargetCharacter();
	bool GetEventMemoryObjectFlag(int32 StoryTaskID, int32 FlagID);
	enum class EKSCharacterDir GetEventDir(int32 ParamDir);
	bool EventPlay(class FName EventName, class AKSCharacterBase* TargetCharacter);
	void EventFlagRefresh(class UObject* WorldContextObject);
	bool CheckCurrentTimeByTimeZoneTriggerType(enum class ETIMEZONE_TRIGGER_TYPE TimeZoneTrgType);
};

// 0x600 (0x830 - 0x230)
// Class Majesty.EventManager
class AEventManager : public AAcqManagerBase
{
public:
	uint8                                        Pad_13EC[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FEventAtomSoundData>           AtomCueArray;                                      // 0x248(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_13ED[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialParameterCollection*          M_pMPC;                                            // 0x260(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13EE[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                JsonFilename;                                      // 0x278(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEventData>                    EventData;                                         // 0x288(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        EventIndex;                                        // 0x298(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        EndIndex;                                          // 0x29C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            EventListDb;                                       // 0x2A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AKSCharacterBase*                      PlayerCharacter;                                   // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AKSCharacterBase*                      PlayActionCharacter;                               // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AKSObjectBase*                         TargetObject;                                      // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AKSCharacterBase*                      EventTargetCharacter;                              // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                        EventArgs;                                         // 0x2C8(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                        CommandTime;                                       // 0x2D8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        WaitTime;                                          // 0x2DC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        TalkIndex;                                         // 0x2E0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ActiveTalkIndex;                                   // 0x2E4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                PlayEventName;                                     // 0x2E8(0x10)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                NextEventName;                                     // 0x2F8(0x10)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                          DialogEventName;                                   // 0x308(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                        BattleEndNextEventID;                              // 0x318(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13F4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BattleEndNextEventName;                            // 0x320(0x10)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                BattleEndDefeatNextEventName;                      // 0x330(0x10)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AEventTargetBase*                      CameraTarget;                                      // 0x340(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                      ActiveCamera;                                      // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CameraTrackStartPos;                               // 0x350(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CameraTrackEndPos;                                 // 0x35C(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CameraTrackPos;                                    // 0x368(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CameraTrackEndTime;                                // 0x374(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CameraTrackTime;                                   // 0x378(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bCameraDecelerate;                               // 0x37C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13F5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AKSObjectBase*>                 ObjectArray;                                       // 0x380(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FEventListData                        PlayEventData;                                     // 0x390(0x98)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	int32                                        TempPlayEventSkip;                                 // 0x428(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13F6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBalloonBase*                          EventBalloon;                                      // 0x430(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIFlashbackBase*                      EventFlashback;                                    // 0x438(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterial*>                     PostProcessMaterial;                               // 0x440(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>      PostProcessMaterialDynamic;                        // 0x450(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FEventEffect>             EventEffectList;                                   // 0x460(0x50)(BlueprintVisible, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FEventEmotion>            EventEmotionList;                                  // 0x4B0(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         EventBattle;                                       // 0x500(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         BeforEventBattle;                                  // 0x501(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IgnoreFootStepSound;                               // 0x502(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13FE[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPartyChatBase*                        PartyChatWidget;                                   // 0x508(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsRichEventLoadResourceData;                       // 0x510(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13FF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RandomNumber;                                      // 0x514(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsCreateRandomNumber;                              // 0x518(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         ExecFinishPre;                                     // 0x519(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         RefreshEventFlag;                                  // 0x51A(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         RefreshEventObject;                                // 0x51B(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EditPlayerPosition;                                // 0x51C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EditCameraLock;                                    // 0x51D(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EditPlayerCharacterEnable;                         // 0x51E(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1401[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FirstCharacterSpawn;                               // 0x520(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        LastFlagChangeIndex;                               // 0x524(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        LastFadeOutIndex;                                  // 0x528(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         RefreshPlayerFlag;                                 // 0x52C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         ContinueEvent;                                     // 0x52D(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1402[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TempTime;                                          // 0x530(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               TempVector;                                        // 0x534(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AKSCharacterBase*                      EventMoveTarget;                                   // 0x540(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UTexture2D>>     FlashBackTexture;                                  // 0x548(0x10)(BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FVector                               CameraLockPos;                                     // 0x558(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         CameraLockFlag;                                    // 0x564(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1403[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AEndRollFlowManager*                   TempEndrollManager;                                // 0x568(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        EndrollFlow;                                       // 0x570(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EEventTheater                     TheaterStatus;                                     // 0x574(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1404[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        EventStartLevelID;                                 // 0x578(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               PlayerLocation;                                    // 0x57C(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EKSCharacterDir                   PlayerDir;                                         // 0x588(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1405[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RestoreHouseName;                                  // 0x58C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  RestoreBGMLabel;                                   // 0x594(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1406[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         IsPlayEventForce;                                  // 0x59D(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsSequencerSkip;                                   // 0x59E(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsTempChangeTimeZone;                              // 0x59F(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1407[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture*                              SepiaLUT;                                          // 0x5B0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               GRAY_SCALE;                                        // 0x5B8(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               GRAY_ALPHA;                                        // 0x5C4(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               SEPIA;                                             // 0x5D0(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1408[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ALevelSequenceActor*                   M_pcMainSeqActor;                                  // 0x5E0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ALevelSequenceActor*>           M_apcSubSeqActor;                                  // 0x5E8(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1409[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ALevelSequenceActor*>           M_apSeqList;                                       // 0x608(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class URichEventCommandBase*                 M_pcEventCommandData;                              // 0x618(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_140A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class URichEventCommandBase*                 M_pcSubEventCommandData;                           // 0x628(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class ULevelSequence>> M_acResList;                                       // 0x630(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_140B[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ULevelSequence*                        M_pcCacheTimeSequencer;                            // 0x660(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULevelSequence*                        M_ReplaceTimeSequencer;                            // 0x668(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_140C[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            EventFinish;                                       // 0x6A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_140E[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, class AKSCharacterBase*>         M_EventCharacter;                                  // 0x720(0x50)(Protected, NativeAccessSpecifierProtected)
	TMap<int32, class AKSObjectBase*>            M_EventObject;                                     // 0x770(0x50)(Protected, NativeAccessSpecifierProtected)
	TMap<int32, class AKSCharacterBase*>         M_MoveList;                                        // 0x7C0(0x50)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_140F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSubSeqData>                   M_DeepThinkParams;                                 // 0x818(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1410[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AEventManager* GetDefaultObj();

	bool UpdateWPMEventReflection(float DeltaTime);
	bool UpdateWPMEventEnd(float DeltaTime);
	bool UpdateWPMEventCheck(float DeltaTime);
	bool UpdateWPMEvent(float DeltaTime);
	bool UpdateUIStorySelect(float DeltaTime);
	bool UpdateTalk(float DeltaTime);
	bool UpdateSubStoryLabelJump(float DeltaTime);
	bool UpdateSubDelivMessageDialog(float DeltaTime);
	bool UpdateSubDeliveryDialog(float DeltaTime);
	bool UpdateSpawnCharacterThief(float DeltaTime);
	bool UpdateSpawnCharacterPlacement(float DeltaTime);
	bool UpdateSpawnCharacterPartyPosition(float DeltaTime);
	bool UpdateSpawnCharacterNPC(float DeltaTime);
	bool UpdateSpawnCharacter(float DeltaTime);
	bool UpdateSelectMemberDialog(float DeltaTime);
	void UpdateResetBattleWipeMPC_PlayingEvent(bool bWipe);
	bool UpdateReminiscenceDialog(float DeltaTime);
	bool UpdatePChatMode(float DeltaTime);
	bool UpdatePartnerSelectDialog(float DeltaTime);
	bool UpdateOpenPartySquadWidget(float DeltaTime);
	bool UpdateOpenPartySplitWidget(float DeltaTime);
	bool UpdateMove(float DeltaTime);
	bool UpdateInventorLearnAbility(float DeltaTime);
	bool UpdateInventorEventDialog(float DeltaTime);
	bool UpdateGetJobDialog(float DeltaTime);
	bool UpdateGetItemDialog(float DeltaTime);
	bool UpdateFinishTheater(float DeltaTime);
	bool UpdateFieldCommandDialog(float DeltaTime);
	bool UpdateExPartyChange(float DeltaTime);
	bool UpdateEventFadeOut(float DeltaTime);
	bool UpdateEventFadeIn(float DeltaTime);
	void UpdateEventEmotion(float DeltaTime);
	void UpdateEventEffect(float DeltaTime);
	bool UpdateEndrollInit(float DeltaTime);
	bool UpdateEndroll(float DeltaTime);
	bool UpdateDialogJumpEpilogue(float DeltaTime);
	bool UpdateDialogJump(float DeltaTime);
	bool UpdateCharaMoveStart(float DeltaTime);
	bool UpdateCharaFadeOut(float DeltaTime);
	bool UpdateCharaFadeIn(float DeltaTime);
	bool UpdateCharacterForce(float DeltaTime);
	bool UpdateCharacterAction(float DeltaTime);
	bool UpdateChallengeDialog(float DeltaTime);
	bool UpdateCameraDecelerate(float DeltaTime);
	bool UpdateBattleStart(float DeltaTime);
	bool UpdateAddMemberEnd(float DeltaTime);
	bool UpdateAddMemberDialog(float DeltaTime);
	bool UpdateAddMember(float DeltaTime);
	void Update_StartFadeOut(float DetalTime);
	void Update_EventSkipFadeOut(float DeltaTime);
	void Update_EventSkipFadeIn(float DeltaTime);
	void Update_CameraMove(float DeltaTime);
	bool TempEventSkip(bool NewEventSkip);
	bool StopSubSequencer(int32 NIndex);
	bool StartWPMEventReflection(struct FEventData& RefEventData);
	bool StartWPMEventEnd(struct FEventData& RefEventData);
	bool StartWPMEventCheck(struct FEventData& RefEventData);
	bool StartWPMEvent(struct FEventData& RefEventData);
	bool StartWeaponMasterFrow(struct FEventData& RefEventData);
	bool StartUnlockFasttravel(struct FEventData& RefEventData);
	bool StartUIStorySelect(struct FEventData& RefEventData);
	bool StartUIShop(struct FEventData& RefEventData);
	bool StartUIPartyEdit(struct FEventData& RefEventData);
	bool StartUINote(struct FEventData& RefEventData);
	bool StartUIBar(struct FEventData& RefEventData);
	bool StartTopCharaTypeLabelJump(struct FEventData& RefEventData);
	bool StartTempPartySetting(struct FEventData& RefEventData);
	bool StartTalkPos(struct FEventData& RefEventData);
	bool StartTalkPChat(struct FEventData& RefEventData);
	bool StartTalkParty(struct FEventData& RefEventData);
	bool StartTalkPartner(struct FEventData& RefEventData);
	bool StartTalkGeneral(struct FEventData& RefEventData);
	bool StartTalk(struct FEventData& RefEventData);
	bool StartSuccsessFCTypeLabelJump(struct FEventData& RefEventData);
	bool StartSubTitleNextBlock(struct FEventData& RefEventData);
	bool StartSubTitle(struct FEventData& RefEventData);
	bool StartSubStoryLabelJump(struct FEventData& RefEventData);
	bool StartSubDelivMessageDialog(struct FEventData& RefEventData);
	bool StartSubDeliveryDialog(struct FEventData& RefEventData);
	bool StartStopEmotionIconAll();
	bool StartSpawnEffect(struct FEventData& RefEventData);
	bool StartShipPutUpSail(struct FEventData& RefEventData);
	bool StartSetSwoonEventObject(struct FEventData& RefEventData);
	bool StartSetSwoon(struct FEventData& RefEventData);
	bool StartSetNextLevelTriggerID(struct FEventData& RefEventData);
	bool StartSetFastTravel(struct FEventData& RefEventData);
	bool StartSequencerStart(struct FEventData& RefEventData);
	bool StartSequencerSkip();
	bool StartSequencerPause();
	bool StartSequencerLabelJump(const class FString& StrLabel);
	bool StartSelectMemberJump(struct FEventData& RefEventData);
	bool StartSelectMemberDialog(struct FEventData& RefEventData);
	bool StartResidentSubSequencerStopIndex(int32 NIndex);
	bool StartResidentSubSequencerStop();
	bool StartResidentSubSequencerStart(struct FEventData& InEventData);
	bool StartReminisceneDialog(struct FEventData& RefEventData);
	bool StartRefreshEventObject();
	bool StartRecoverSwoonEventChara(struct FEventData& RefEventData);
	bool StartRecoverSwoon(struct FEventData& RefEventData);
	bool StartRadarMap(struct FEventData& RefEventData);
	bool StartPreparationBattleStart(struct FEventData& RefEventData);
	bool StartPostEffectSetting(class UCameraComponent* TargetCamera, struct FEventData& RefEventData);
	bool StartPlaySE(struct FEventData& RefEventData);
	bool StartPlayerCharacterEnable(struct FEventData& RefEventData);
	bool StartPlayEmotionIcon(struct FEventData& RefEventData);
	bool StartPChatMode(struct FEventData& RefEventData);
	bool StartPartnerSelectDialog(struct FEventData& RefEventData);
	bool StartOpenPartySquadWidget(struct FEventData& RefEventData);
	bool StartOpenPartySplitWidget(struct FEventData& RefEventData);
	bool StartOpenEndCardUI(struct FEventData& RefEventData);
	bool StartOpenEndCardEpilogueUI(struct FEventData& RefEventData);
	bool StartOpenDoor(struct FEventData& RefEventData);
	bool StartOKDialog(struct FEventData& RefEventData);
	bool StartObjectSpawn(struct FEventData& RefEventData);
	bool StartNotificationMessage(struct FEventData& RefEventData);
	bool StartNotificationCountShow(struct FEventData& RefEventData);
	bool StartNarration(struct FEventData& RefEventData);
	bool StartMovePos(struct FEventData& RefEventData);
	bool StartMove(struct FEventData& RefEventData);
	bool StartModifyMP(struct FEventData& RefEventData);
	bool StartModifyHP(struct FEventData& RefEventData);
	bool StartLeaveMember(struct FEventData& RefEventData);
	bool StartJudgeMoney(struct FEventData& RefEventData);
	bool StartInventorLearnAbility(struct FEventData& RefEventData);
	bool StartInventorEventDialog(struct FEventData& RefEventData);
	bool StartHouseInSettingPlaySeq(struct FEventData& RefEventData);
	bool StartHouseInSetting(struct FEventData& RefEventData);
	bool StartGetTameMonster(struct FEventData& RefEventData);
	bool StartGetJobDialog(struct FEventData& RefEventData);
	bool StartGetItemDialog(struct FEventData& RefEventData);
	bool StartFullRecoveryAndPotentiality(struct FEventData& RefEventData);
	bool StartFullRecovery(struct FEventData& RefEventData);
	bool StartFlashbackStart(struct FEventData& RefEventData);
	bool StartFlashbackEnd(struct FEventData& RefEventData);
	bool StartFinishTheater(struct FEventData& RefEventData);
	bool StartFinishTempPartySetting(struct FEventData& RefEventData);
	bool StartFinalBattleStart(struct FEventData& RefEventData);
	bool StartFieldCommandDialog(struct FEventData& RefEventData);
	bool StartEventFadeOut(struct FEventData& RefEventData);
	bool StartEventFadeIn(struct FEventData& RefEventData);
	bool StartEndrollInit(struct FEventData& RefEventData);
	bool StartEndroll(struct FEventData& RefEventData);
	bool StartEndReminiscene(struct FEventData& RefEventData);
	bool StartEndPlayReminiscene(struct FEventData& RefEventData);
	bool StartEnableFieldObject(struct FEventData& RefEventData);
	bool StartEnableEventObject(struct FEventData& RefEventData);
	bool StartEmotionEnable(struct FEventData& RefEventData);
	bool StartDelFollow(struct FEventData& RefEventData);
	bool StartCommand(struct FEventData& RefEventData);
	bool StartCharaMoveStart(struct FEventData& RefEventData);
	bool StartCharaFadeOut(struct FEventData& RefEventData);
	bool StartCharaFadeIn(struct FEventData& RefEventData);
	bool StartCharacterPhysics(struct FEventData& RefEventData);
	bool StartChangeTitle(struct FEventData& RefEventData);
	bool StartChangePlayerResource(struct FEventData& RefEventData);
	bool StartChangePartySet(struct FEventData& RefEventData);
	bool StartChangeMoeny(struct FEventData& RefEventData);
	bool StartChangeMap(struct FEventData& RefEventData);
	bool StartChangeItem(struct FEventData& RefEventData);
	bool StartChangeArea(struct FEventData& RefEventData);
	bool StartChallengeDialog(struct FEventData& RefEventData);
	bool StartCancelSwoon(struct FEventData& RefEventData);
	bool StartCameraTargetEvent(struct FEventData& RefEventData);
	bool StartCameraTarget(struct FEventData& RefEventData);
	bool StartCameraSpawn(struct FEventData& RefEventData);
	bool StartCameraRotation(struct FEventData& RefEventData);
	bool StartCameraPos(struct FEventData& RefEventData);
	bool StartCameraLock(struct FEventData& RefEventData);
	bool StartCameraDecelerate(struct FEventData& RefEventData);
	bool StartBeginReminiscene(struct FEventData& RefEventData);
	bool StartBeginPlayReminiscene(struct FEventData& RefEventData);
	bool StartBattleStart(struct FEventData& RefEventData);
	bool StartAutoSave(struct FEventData& RefEventData);
	bool StartAddMemberEnd(struct FEventData& RefEventData, bool* AddMember);
	bool StartAddMemberDialog(struct FEventData& RefEventData);
	bool StartAddMember(struct FEventData& RefEventData);
	bool SpawnPlayerCharacter(struct FEventData& RefEventData);
	bool SpawnPChatCharacter(struct FEventData& RefEventData);
	bool SpawnEventEffect(int32 ID, class FName& Label, float LifeTime, struct FVector& Pos, int32 TargetCharacter);
	bool SpawnEventCharacterList();
	bool SpawnCharacterThief(struct FEventData& RefEventData);
	bool SpawnCharacterPlacement(struct FEventData& RefEventData);
	bool SpawnCharacterPartyPosition(struct FEventData& RefEventData);
	bool SpawnCharacterNPC(struct FEventData& RefEventData);
	bool SpawnCharacter(struct FEventData& RefEventData);
	void SkipPositionSequencer(const struct FFrameTime& Time);
	void SetUpSeamlessMode(bool bSeamless);
	void SetUpdateType(enum class EEventUpdateType Type);
	void SetTimeZoneTheater(class FName EventName, int32 OverrideTimeZone);
	void SetSubSequenceDirector(class URichEventCommandBase* PEvent);
	void SetSkipOpenDoorLabel(class FName TargetName, bool bOpen);
	void SetRichEventLoadData(bool IsLoad);
	void SetResumeGamePlaySystem();
	bool SetPostProcessDeepThink(bool Enable, class AKSCharacterBase* RefTarget, float Time);
	bool SetPChatCharacterDir(struct FEventData& RefEventData);
	bool SetPartnerNumber(struct FEventData& RefEventData);
	bool SetOpenCloseDoorFunction(struct FEventData& RefEventData);
	void SetMaxSkipInputTime(float MaxTime);
	void SetMaterialEnvParams();
	bool SetLegendMonsterAwakening(enum class EAWAKENING_MONSTER_PARAM EAwake);
	void SetLastSoundBlock(int32 bLock);
	void SetFinishBattleWipe(bool Enable);
	void SetFinish(bool Finish);
	void SetEventSkipInput(bool IsSkipInput);
	void SetEventPlayMode(enum class EKSEVENT_PLAY Mode);
	void SetEventObjectEnableTheater(class FName EventName);
	void SetEventDataWithLevelIDForPartyChat(class FName EventLabel, class AKSCharacterBase* TargetChara, class FName MapLabel, bool TheaterMode);
	void SetEventDataWithLevelID(class FName EventLabel, class AKSCharacterBase* TargetChara, class FName MapLabel, bool TheaterMode);
