#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x2 (0x2 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.BPI_ResetAppearance
struct UMonsterListWidget_ToggleItem_C_BPI_ResetAppearance_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.BPI_Decide
struct UMonsterListWidget_ToggleItem_C_BPI_Decide_Params
{
public:
	bool                                         IsDecided;                                         // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.BPI_Focus
struct UMonsterListWidget_ToggleItem_C_BPI_Focus_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.BPI_OutFocus
struct UMonsterListWidget_ToggleItem_C_BPI_OutFocus_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.BPI_OnRight
struct UMonsterListWidget_ToggleItem_C_BPI_OnRight_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.BPI_OnLeft
struct UMonsterListWidget_ToggleItem_C_BPI_OnLeft_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         _;                                                 // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.SetValue
struct UMonsterListWidget_ToggleItem_C_SetValue_Params
{
public:
	bool                                         ToggleSwitch;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.OnChangeValue
struct UMonsterListWidget_ToggleItem_C_OnChangeValue_Params
{
public:
	bool                                         Value;                                             // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x19 (0x19 - 0x0)
// Function MonsterListWidget_ToggleItem.MonsterListWidget_ToggleItem_C.ExecuteUbergraph_MonsterListWidget_ToggleItem
struct UMonsterListWidget_ToggleItem_C_ExecuteUbergraph_MonsterListWidget_ToggleItem_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


