#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_10
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_10_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_9
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_9_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_8
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_8_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_7
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_7_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_6
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_6_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_5
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_5_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_4
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_4_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_3
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_3_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_2
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_2_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_1
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_0
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x9 (0x9 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.PlayAction
struct USequenceDirector_C_PlayAction_Params
{
public:
	class ABattleCharacterBase*                  Character;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EKSCharacterAction                BattleActionID;                                    // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.JumpToFrame
struct USequenceDirector_C_JumpToFrame_Params
{
public:
	int32                                        Frame;                                             // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.RandomJumpToFrame
struct USequenceDirector_C_RandomJumpToFrame_Params
{
public:
	float                                        Rate;                                              // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Frame;                                             // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.PlaySE
struct USequenceDirector_C_PlaySE_Params
{
public:
	class FName                                  SEID;                                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x9 (0x9 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.PlayVibration
struct USequenceDirector_C_PlayVibration_Params
{
public:
	class FName                                  VibrationID;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVibrationPower                   Power;                                             // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x31 (0x31 - 0x0)
// Function ResultDash_Normal.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
struct USequenceDirector_C_ExecuteUbergraph_SequenceDirector_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


