#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x10 (0x10 - 0x0)
// Function WBP_3DPlayerSelectIcon.WBP_3DPlayerSelectIcon_C.StartEnable
struct UWBP_3DPlayerSelectIcon_C_StartEnable_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function WBP_3DPlayerSelectIcon.WBP_3DPlayerSelectIcon_C.StartDisable
struct UWBP_3DPlayerSelectIcon_C_StartDisable_Params
{
public:
	bool                                         IsFast;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function WBP_3DPlayerSelectIcon.WBP_3DPlayerSelectIcon_C.GetSnapPositionOffset
struct UWBP_3DPlayerSelectIcon_C_GetSnapPositionOffset_Params
{
public:
	struct FVector2D                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function WBP_3DPlayerSelectIcon.WBP_3DPlayerSelectIcon_C.UpdateTimeZone
struct UWBP_3DPlayerSelectIcon_C_UpdateTimeZone_Params
{
public:
	enum class ETimeZoneType                     TimeZone;                                          // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x29 (0x29 - 0x0)
// Function WBP_3DPlayerSelectIcon.WBP_3DPlayerSelectIcon_C.StartFocus
struct UWBP_3DPlayerSelectIcon_C_StartFocus_Params
{
public:
	bool                                         IsFocus;                                           // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         IsFast;                                            // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         ReturnValue;                                       // 0x2(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function WBP_3DPlayerSelectIcon.WBP_3DPlayerSelectIcon_C.FinishAnimation
struct UWBP_3DPlayerSelectIcon_C_FinishAnimation_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x3C (0x3C - 0x0)
// Function WBP_3DPlayerSelectIcon.WBP_3DPlayerSelectIcon_C.Tick
struct UWBP_3DPlayerSelectIcon_C_Tick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                        InDeltaTime;                                       // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function WBP_3DPlayerSelectIcon.WBP_3DPlayerSelectIcon_C.ExecuteUbergraph_WBP_3DPlayerSelectIcon
struct UWBP_3DPlayerSelectIcon_C_ExecuteUbergraph_WBP_3DPlayerSelectIcon_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


