#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x31 (0x31 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.GetSelectingPartyChatItem
struct UWBP_MainMenuStoryRecordPartyChat_C_GetSelectingPartyChatItem_Params
{
public:
	class UWBP_PartyChatItem_C*                  AsWBP_Party_Chat_Item;                             // 0x0(0x8)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.Paging
struct UWBP_MainMenuStoryRecordPartyChat_C_Paging_Params
{
public:
	bool                                         IsLeftInput;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.SetActive
struct UWBP_MainMenuStoryRecordPartyChat_C_SetActive_Params
{
public:
	bool                                         Active;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.IsActive
struct UWBP_MainMenuStoryRecordPartyChat_C_IsActive_Params
{
public:
	bool                                         IsActive;                                          // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0xC8 (0xC8 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.Setup
struct UWBP_MainMenuStoryRecordPartyChat_C_Setup_Params
{
public:
	TArray<class FName>                          PartyChatLabel;                                    // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                         ReOpen;                                            // 0x10(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.OnRightAxisX
struct UWBP_MainMenuStoryRecordPartyChat_C_OnRightAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.OnRightAxisY
struct UWBP_MainMenuStoryRecordPartyChat_C_OnRightAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.OnLeftAxisX
struct UWBP_MainMenuStoryRecordPartyChat_C_OnLeftAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.OnLeftAxisY
struct UWBP_MainMenuStoryRecordPartyChat_C_OnLeftAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.OnGamePadAxisX
struct UWBP_MainMenuStoryRecordPartyChat_C_OnGamePadAxisX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.OnGamePadAxisY
struct UWBP_MainMenuStoryRecordPartyChat_C_OnGamePadAxisY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.WorldMapSlowCursorX
struct UWBP_MainMenuStoryRecordPartyChat_C_WorldMapSlowCursorX_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.WorldMapSlowCursorY
struct UWBP_MainMenuStoryRecordPartyChat_C_WorldMapSlowCursorY_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.HelpScrollAxis
struct UWBP_MainMenuStoryRecordPartyChat_C_HelpScrollAxis_Params
{
public:
	float                                        AxisaValue;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.OnListPaging
struct UWBP_MainMenuStoryRecordPartyChat_C_OnListPaging_Params
{
public:
	bool                                         IsLeftInput;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.PartyChatCinfirmDialogCallback
struct UWBP_MainMenuStoryRecordPartyChat_C_PartyChatCinfirmDialogCallback_Params
{
public:
	int32                                        SelectIndex;                                       // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3C (0x3C - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.Tick
struct UWBP_MainMenuStoryRecordPartyChat_C_Tick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                        InDeltaTime;                                       // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x464 (0x464 - 0x0)
// Function WBP_MainMenuStoryRecordPartyChat.WBP_MainMenuStoryRecordPartyChat_C.ExecuteUbergraph_WBP_MainMenuStoryRecordPartyChat
struct UWBP_MainMenuStoryRecordPartyChat_C_ExecuteUbergraph_WBP_MainMenuStoryRecordPartyChat_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


